kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>PMD5</name>
          <description>PMD5 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U6MD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPI3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPI4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI5MD</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPI6MD</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>USBMD</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CAN1MD</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CAN2MD</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5CLR</name>
          <description>PMD5CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U6MD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPI3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPI4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI5MD</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPI6MD</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>USBMD</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CAN1MD</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CAN2MD</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5SET</name>
          <description>PMD5SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U6MD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPI3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPI4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI5MD</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPI6MD</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>USBMD</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CAN1MD</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CAN2MD</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD5INV</name>
          <description>PMD5INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1MD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>U2MD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>U3MD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>U4MD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>U5MD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>U6MD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPI1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPI2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPI3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPI4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI5MD</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPI6MD</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C1MD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>I2C2MD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>I2C3MD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C4MD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C5MD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>USBMD</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CAN1MD</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CAN2MD</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6</name>
          <description>PMD6 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFO1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>REFO2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>REFO3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>REFO4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIMD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SQI1MD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ETHMD</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6CLR</name>
          <description>PMD6CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFO1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>REFO2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>REFO3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>REFO4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIMD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SQI1MD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ETHMD</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6SET</name>
          <description>PMD6SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFO1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>REFO2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>REFO3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>REFO4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIMD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SQI1MD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ETHMD</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD6INV</name>
          <description>PMD6INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RTCCMD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>REFO1MD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>REFO2MD</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>REFO3MD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>REFO4MD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PMPMD</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIMD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SQI1MD</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ETHMD</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7</name>
          <description>PMD7 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAMD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RNGMD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CRYPTMD</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7CLR</name>
          <description>PMD7CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAMD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RNGMD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CRYPTMD</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7SET</name>
          <description>PMD7SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAMD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RNGMD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CRYPTMD</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PMD7INV</name>
          <description>PMD7INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAMD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RNGMD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CRYPTMD</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBIA</name>
          <description>CFGEBIA register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIA0EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIA1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBIA2EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EBIA3EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EBIA4EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBIA5EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBIA6EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBIA7EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIA8EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIA9EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIA10EN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EBIA11EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EBIA12EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIA13EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIA14EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBIA15EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EBIA16EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIA17EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIA18EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EBIA19EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EBIA20EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EBIA21EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EBIA22EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EBIA23EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EBIPINEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
