kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CFGEBIACLR</name>
          <description>CFGEBIACLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIA0EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIA1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBIA2EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EBIA3EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EBIA4EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBIA5EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBIA6EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBIA7EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIA8EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIA9EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIA10EN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EBIA11EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EBIA12EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIA13EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIA14EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBIA15EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EBIA16EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIA17EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIA18EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EBIA19EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EBIA20EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EBIA21EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EBIA22EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EBIA23EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EBIPINEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBIASET</name>
          <description>CFGEBIASET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIA0EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIA1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBIA2EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EBIA3EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EBIA4EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBIA5EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBIA6EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBIA7EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIA8EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIA9EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIA10EN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EBIA11EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EBIA12EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIA13EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIA14EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBIA15EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EBIA16EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIA17EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIA18EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EBIA19EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EBIA20EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EBIA21EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EBIA22EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EBIA23EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EBIPINEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBIAINV</name>
          <description>CFGEBIAINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIA0EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIA1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBIA2EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EBIA3EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EBIA4EN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBIA5EN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBIA6EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBIA7EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIA8EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIA9EN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIA10EN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EBIA11EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EBIA12EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIA13EN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIA14EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EBIA15EN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EBIA16EN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIA17EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIA18EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EBIA19EN</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EBIA20EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EBIA21EN</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EBIA22EN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EBIA23EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EBIPINEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBIC</name>
          <description>CFGEBIC register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIDEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIDEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBICSEN0</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBICSEN1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBICSEN2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBICSEN3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIBSEN0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIBSEN1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIOEEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIWEEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIRPEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIRDYLVL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN1</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN2</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN3</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV1</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBICCLR</name>
          <description>CFGEBICCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIDEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIDEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBICSEN0</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBICSEN1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBICSEN2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBICSEN3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIBSEN0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIBSEN1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIOEEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIWEEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIRPEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIRDYLVL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN1</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN2</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN3</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV1</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBICSET</name>
          <description>CFGEBICSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIDEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIDEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBICSEN0</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBICSEN1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBICSEN2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBICSEN3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIBSEN0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIBSEN1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIOEEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIWEEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIRPEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIRDYLVL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN1</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN2</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN3</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV1</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGEBICINV</name>
          <description>CFGEBICINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EBIDEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EBIDEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EBICSEN0</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EBICSEN1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EBICSEN2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EBICSEN3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EBIBSEN0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EBIBSEN1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EBIOEEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EBIWEEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EBIRPEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EBIRDYLVL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN1</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN2</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EBIRDYEN3</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV1</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV2</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EBIRDYINV3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGPG</name>
          <description>CFGPG register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CPUPG</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMAPG</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>USBPG</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CAN1PG</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>CAN2PG</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ETHPG</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SQI1PG</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>FCPG</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>CRYPTPG</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ICD1PG</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
