kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVM</name>
      <description>NVM peripheral</description>
      <baseAddress>0xbf800600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xb0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>NVMCON</name>
          <description>NVMCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>BFSWAP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PFSWAP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONCLR</name>
          <description>NVMCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>BFSWAP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PFSWAP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONSET</name>
          <description>NVMCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>BFSWAP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PFSWAP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCONINV</name>
          <description>NVMCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMOP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>BFSWAP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PFSWAP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LVDERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRERR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WREN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WR</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMKEY</name>
          <description>NVMKEY register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMKEY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDR</name>
          <description>NVMADDR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRCLR</name>
          <description>NVMADDRCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRSET</name>
          <description>NVMADDRSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMADDRINV</name>
          <description>NVMADDRINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA0</name>
          <description>NVMDATA0 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA0CLR</name>
          <description>NVMDATA0CLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA0SET</name>
          <description>NVMDATA0SET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA0INV</name>
          <description>NVMDATA0INV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA1</name>
          <description>NVMDATA1 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA1CLR</name>
          <description>NVMDATA1CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA1SET</name>
          <description>NVMDATA1SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA1INV</name>
          <description>NVMDATA1INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA2</name>
          <description>NVMDATA2 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA2CLR</name>
          <description>NVMDATA2CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA2SET</name>
          <description>NVMDATA2SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA2INV</name>
          <description>NVMDATA2INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA3</name>
          <description>NVMDATA3 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA3CLR</name>
          <description>NVMDATA3CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA3SET</name>
          <description>NVMDATA3SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMDATA3INV</name>
          <description>NVMDATA3INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMDATA3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDR</name>
          <description>NVMSRCADDR register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDRCLR</name>
          <description>NVMSRCADDRCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDRSET</name>
          <description>NVMSRCADDRSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMSRCADDRINV</name>
          <description>NVMSRCADDRINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NVMSRCADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMPWP</name>
          <description>NVMPWP register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>2147483648</resetValue>
          <fields>
            <field>
              <name>PWP</name>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>PWPULOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMPWPCLR</name>
          <description>NVMPWPCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PWP</name>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>PWPULOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMPWPSET</name>
          <description>NVMPWPSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PWP</name>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>PWPULOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMPWPINV</name>
          <description>NVMPWPINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PWP</name>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>PWPULOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMBWP</name>
          <description>NVMBWP register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>40927</resetValue>
          <fields>
            <field>
              <name>UBWP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UBWP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UBWP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UBWP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UBWP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBGWP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UBWPULOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LBWP0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LBWP1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LBWP2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LBWP3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LBWP4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LBWPULOCK</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMBWPCLR</name>
          <description>NVMBWPCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UBWP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UBWP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UBWP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UBWP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UBWP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBGWP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UBWPULOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LBWP0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LBWP1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LBWP2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LBWP3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LBWP4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LBWPULOCK</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMBWPSET</name>
          <description>NVMBWPSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UBWP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UBWP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UBWP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UBWP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UBWP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBGWP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UBWPULOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LBWP0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LBWP1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LBWP2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LBWP3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LBWP4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LBWPULOCK</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMBWPINV</name>
          <description>NVMBWPINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UBWP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UBWP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UBWP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UBWP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UBWP4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBGWP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UBWPULOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LBWP0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LBWP1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LBWP2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LBWP3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LBWP4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LBWPULOCK</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
