kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>NVMCON2</name>
          <description>NVMCON2 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWAPLOCK</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON2CLR</name>
          <description>NVMCON2CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWAPLOCK</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON2SET</name>
          <description>NVMCON2SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWAPLOCK</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVMCON2INV</name>
          <description>NVMCON2INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWAPLOCK</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>WDT peripheral</description>
      <baseAddress>0xbf800800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCON</name>
          <description>WDTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RUNDIV</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WDTCLRKEY</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONCLR</name>
          <description>WDTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RUNDIV</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WDTCLRKEY</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONSET</name>
          <description>WDTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RUNDIV</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WDTCLRKEY</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONINV</name>
          <description>WDTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDTWINEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RUNDIV</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WDTCLRKEY</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMT</name>
      <description>DMT peripheral</description>
      <baseAddress>0xbf800a00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMTCON</name>
          <description>DMTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTPRECLR</name>
          <description>DMTPRECLR register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STEP1</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTCLR</name>
          <description>DMTCLR register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STEP2</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTSTAT</name>
          <description>DMTSTAT register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WINOPN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMTEVENT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BAD</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTCNT</name>
          <description>DMTCNT register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>COUNTER</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTPSCNT</name>
          <description>DMTPSCNT register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PSCNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMTPSINTV</name>
          <description>DMTPSINTV register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PSINTV</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
