kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ALRMDATECLR</name>
          <description>ALRMDATECLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMDATESET</name>
          <description>ALRMDATESET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMDATEINV</name>
          <description>ALRMDATEINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>WDAY01</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DAY01</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DAY10</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MONTH01</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MONTH10</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CVR</name>
      <description>CVR peripheral</description>
      <baseAddress>0xbf800e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CVRCON</name>
          <description>CVRCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONCLR</name>
          <description>CVRCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONSET</name>
          <description>CVRCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CVRCONINV</name>
          <description>CVRCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CVR</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CVRSS</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CVRR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CVROE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
