kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ICD</name>
      <description>ICD peripheral</description>
      <baseAddress>0xbf801130</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_ICDCON</name>
          <description>_ICDCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CKSWBKEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLPBKEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WDTBKEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WDTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RSTBUG</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMTBKEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMTEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>_DDPSTAT</name>
      <description>_DDPSTAT peripheral</description>
      <baseAddress>0xbf801140</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>_ICDSTAT</name>
          <description>_ICDSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CKSWBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLPBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WDTBF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMTBF</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRU</name>
      <description>CRU peripheral</description>
      <baseAddress>0xbf801200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1e0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OSCCON</name>
          <description>OSCCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SLP2SPD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DRMEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONCLR</name>
          <description>OSCCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SLP2SPD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DRMEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONSET</name>
          <description>OSCCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SLP2SPD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DRMEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCONINV</name>
          <description>OSCCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OSWEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOSCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SLPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLKLOCK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>NOSC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>COSC</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SLP2SPD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DRMEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRCDIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUN</name>
          <description>OSCTUN register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNCLR</name>
          <description>OSCTUNCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNSET</name>
          <description>OSCTUNSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCTUNINV</name>
          <description>OSCTUNINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUN</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCON</name>
          <description>SPLLCON register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>16777216</resetValue>
          <fields>
            <field>
              <name>PLLRANGE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PLLICLK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLLIDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCONCLR</name>
          <description>SPLLCONCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PLLRANGE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PLLICLK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLLIDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCONSET</name>
          <description>SPLLCONSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PLLRANGE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PLLICLK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLLIDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPLLCONINV</name>
          <description>SPLLCONINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PLLRANGE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PLLICLK</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLLIDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PLLMULT</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>PLLODIV</name>
              <bitRange>[26:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCON</name>
          <description>RCON register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCFGFAIL</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BCFGERR</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONCLR</name>
          <description>RCONCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCFGFAIL</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BCFGERR</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONSET</name>
          <description>RCONSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCFGFAIL</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BCFGERR</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCONINV</name>
          <description>RCONINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BOR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EXTR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMR</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCFGFAIL</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BCFGERR</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRST</name>
          <description>RSWRST register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTCLR</name>
          <description>RSWRSTCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTSET</name>
          <description>RSWRSTSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSWRSTINV</name>
          <description>RSWRSTINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SWRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNMICON</name>
          <description>RNMICON register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNMICONCLR</name>
          <description>RNMICONCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
