kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>RNMICONSET</name>
          <description>RNMICONSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNMICONINV</name>
          <description>RNMICONINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DMTO</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCON</name>
          <description>PWRCON register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONCLR</name>
          <description>PWRCONCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONSET</name>
          <description>PWRCONSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONINV</name>
          <description>PWRCONINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CON</name>
          <description>REFO1CON register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONCLR</name>
          <description>REFO1CONCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONSET</name>
          <description>REFO1CONSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONINV</name>
          <description>REFO1CONINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIM</name>
          <description>REFO1TRIM register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMCLR</name>
          <description>REFO1TRIMCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMSET</name>
          <description>REFO1TRIMSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMINV</name>
          <description>REFO1TRIMINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2CON</name>
          <description>REFO2CON register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2CONCLR</name>
          <description>REFO2CONCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2CONSET</name>
          <description>REFO2CONSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2CONINV</name>
          <description>REFO2CONINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2TRIM</name>
          <description>REFO2TRIM register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2TRIMCLR</name>
          <description>REFO2TRIMCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2TRIMSET</name>
          <description>REFO2TRIMSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO2TRIMINV</name>
          <description>REFO2TRIMINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3CON</name>
          <description>REFO3CON register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3CONCLR</name>
          <description>REFO3CONCLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3CONSET</name>
          <description>REFO3CONSET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3CONINV</name>
          <description>REFO3CONINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3TRIM</name>
          <description>REFO3TRIM register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3TRIMCLR</name>
          <description>REFO3TRIMCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO3TRIMSET</name>
          <description>REFO3TRIMSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
