kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>REFO3TRIMINV</name>
          <description>REFO3TRIMINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4CON</name>
          <description>REFO4CON register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4CONCLR</name>
          <description>REFO4CONCLR register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4CONSET</name>
          <description>REFO4CONSET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4CONINV</name>
          <description>REFO4CONINV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4TRIM</name>
          <description>REFO4TRIM register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4TRIMCLR</name>
          <description>REFO4TRIMCLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4TRIMSET</name>
          <description>REFO4TRIMSET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO4TRIMINV</name>
          <description>REFO4TRIMINV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIV</name>
          <description>PB1DIV register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>2048</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVCLR</name>
          <description>PB1DIVCLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVSET</name>
          <description>PB1DIVSET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVINV</name>
          <description>PB1DIVINV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB2DIV</name>
          <description>PB2DIV register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB2DIVCLR</name>
          <description>PB2DIVCLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB2DIVSET</name>
          <description>PB2DIVSET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB2DIVINV</name>
          <description>PB2DIVINV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB3DIV</name>
          <description>PB3DIV register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB3DIVCLR</name>
          <description>PB3DIVCLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB3DIVSET</name>
          <description>PB3DIVSET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB3DIVINV</name>
          <description>PB3DIVINV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB4DIV</name>
          <description>PB4DIV register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB4DIVCLR</name>
          <description>PB4DIVCLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB4DIVSET</name>
          <description>PB4DIVSET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB4DIVINV</name>
          <description>PB4DIVINV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB5DIV</name>
          <description>PB5DIV register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB5DIVCLR</name>
          <description>PB5DIVCLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB5DIVSET</name>
          <description>PB5DIVSET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB5DIVINV</name>
          <description>PB5DIVINV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB7DIV</name>
          <description>PB7DIV register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB7DIVCLR</name>
          <description>PB7DIVCLR register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB7DIVSET</name>
          <description>PB7DIVSET register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB7DIVINV</name>
          <description>PB7DIVINV register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB8DIV</name>
          <description>PB8DIV register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB8DIVCLR</name>
          <description>PB8DIVCLR register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB8DIVSET</name>
          <description>PB8DIVSET register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
