kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>PB8DIVINV</name>
          <description>PB8DIVINV register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEWCON</name>
          <description>SLEWCON register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DNEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLWDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SYSDIV</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEWCONCLR</name>
          <description>SLEWCONCLR register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DNEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLWDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SYSDIV</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEWCONSET</name>
          <description>SLEWCONSET register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DNEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLWDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SYSDIV</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEWCONINV</name>
          <description>SLEWCONINV register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DNEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLWDIV</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SYSDIV</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAT</name>
          <description>CLKSTAT register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATCLR</name>
          <description>CLKSTATCLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATSET</name>
          <description>CLKSTATSET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATINV</name>
          <description>CLKSTATINV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
