kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INT</name>
      <description>INT peripheral</description>
      <baseAddress>0xbf810000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1060</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INTCON</name>
          <description>INTCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NMIKEY</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONCLR</name>
          <description>INTCONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NMIKEY</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONSET</name>
          <description>INTCONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NMIKEY</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCONINV</name>
          <description>INTCONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT0EP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INT1EP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INT2EP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT3EP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INT4EP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TPC</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>MVEC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NMIKEY</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRISS</name>
          <description>PRISS register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SS0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRI1SS</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PRI2SS</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PRI3SS</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>PRI4SS</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PRI5SS</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>PRI6SS</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>PRI7SS</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRISSCLR</name>
          <description>PRISSCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SS0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRI1SS</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PRI2SS</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PRI3SS</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>PRI4SS</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PRI5SS</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>PRI6SS</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>PRI7SS</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRISSSET</name>
          <description>PRISSSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SS0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRI1SS</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PRI2SS</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PRI3SS</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>PRI4SS</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PRI5SS</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>PRI6SS</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>PRI7SS</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRISSINV</name>
          <description>PRISSINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SS0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PRI1SS</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>PRI2SS</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PRI3SS</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>PRI4SS</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PRI5SS</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>PRI6SS</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>PRI7SS</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>INTSTAT register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIRQ</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SRIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATCLR</name>
          <description>INTSTATCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIRQ</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SRIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATSET</name>
          <description>INTSTATSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIRQ</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SRIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INTSTATINV</name>
          <description>INTSTATINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIRQ</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SRIPL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMR</name>
          <description>IPTMR register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRCLR</name>
          <description>IPTMRCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRSET</name>
          <description>IPTMRSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTMRINV</name>
          <description>IPTMRINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IPTMR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0</name>
          <description>IFS0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0CLR</name>
          <description>IFS0CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
