kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IFS0SET</name>
          <description>IFS0SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS0INV</name>
          <description>IFS0INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1</name>
          <description>IFS1 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1CLR</name>
          <description>IFS1CLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS1SET</name>
          <description>IFS1SET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
