kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IFS1INV</name>
          <description>IFS1INV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2</name>
          <description>IFS2 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2CLR</name>
          <description>IFS2CLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2SET</name>
          <description>IFS2SET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS2INV</name>
          <description>IFS2INV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
