kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IFS3</name>
          <description>IFS3 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS3CLR</name>
          <description>IFS3CLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS3SET</name>
          <description>IFS3SET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS3INV</name>
          <description>IFS3INV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS4</name>
          <description>IFS4 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS4CLR</name>
          <description>IFS4CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
