kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IFS4SET</name>
          <description>IFS4SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS4INV</name>
          <description>IFS4INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIF</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS5</name>
          <description>IFS5 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TX</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS5CLR</name>
          <description>IFS5CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TX</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS5SET</name>
          <description>IFS5SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TX</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS5INV</name>
          <description>IFS5INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIF</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TX</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIF</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIF</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
