kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IFS6</name>
          <description>IFS6 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS6CLR</name>
          <description>IFS6CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS6SET</name>
          <description>IFS6SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS6INV</name>
          <description>IFS6INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0</name>
          <description>IEC0 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0CLR</name>
          <description>IEC0CLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC0SET</name>
          <description>IEC0SET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
