kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IEC0INV</name>
          <description>IEC0INV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CS0IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CS1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INT0IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T1IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC1EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC1IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>INT1IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T2IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC2EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IC2IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INT2IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>T3IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IC3EIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC3IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>INT3IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>T4IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC4EIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>IC4IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OC4IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>INT4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>T5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC5EIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC5IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>OC5IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>T6IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC6EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IC6IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>OC6IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1</name>
          <description>IEC1 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1CLR</name>
          <description>IEC1CLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1SET</name>
          <description>IEC1SET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC1INV</name>
          <description>IEC1INV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IC7EIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IC7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC7IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T8IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>IC8EIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>IC8IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OC8IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T9IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IC9EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IC9IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC9IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCDC1IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCDC2IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCDC3IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCDC4IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCDC5IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCDF1IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCDF2IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCDF3IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCDF4IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCDF5IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCDF6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCFLTIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD0IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD1IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD2IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD3IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD4IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
