kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IEC2</name>
          <description>IEC2 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2CLR</name>
          <description>IEC2CLR register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2SET</name>
          <description>IEC2SET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC2INV</name>
          <description>IEC2INV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD6IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD7IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD8IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD9IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD10IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD11IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD12IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADCD13IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADCD15IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADCD16IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADCD17IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ADCD18IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADCD19IE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADCD20IE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADCD21IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADCD22IE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADCD23IE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ADCD25IE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ADCD26IE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ADCD27IE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ADCD28IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCD29IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADCD30IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADCD31IE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADCD32IE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADCD33IE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ADCD34IE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADCD35IE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ADCD36IE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC3</name>
          <description>IEC3 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
