kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IEC3CLR</name>
          <description>IEC3CLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC3SET</name>
          <description>IEC3SET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC3INV</name>
          <description>IEC3INV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCD38IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCD39IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCD40IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADCD41IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADCD42IE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADCD43IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADCD44IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CPCIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFDCIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SBIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CRPTIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI1RXIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI1TXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>U1EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U1RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U1TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C1SIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1MIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CNAIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CNBIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CNCIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CNDIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CNEIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CNFIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CNGIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CNHIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CNJIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CNKIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC4</name>
          <description>IEC4 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC4CLR</name>
          <description>IEC4CLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC4SET</name>
          <description>IEC4SET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
