kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IEC4INV</name>
          <description>IEC4INV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PMPEIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMP1IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMP2IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USBDMAIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA0IE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA1IE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DMA2IE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMA3IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMA4IE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMA5IE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMA6IE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMA7IE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SPI2EIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPI2RXIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI2TXIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>U2EIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>U2RXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U2TXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>I2C2BIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C2SIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C2MIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CAN1IE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CAN2IE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ETHIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI3EIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI3RXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SPI3TXIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U3EIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U3RXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>U3TXIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC5</name>
          <description>IEC5 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC5CLR</name>
          <description>IEC5CLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC5SET</name>
          <description>IEC5SET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC5INV</name>
          <description>IEC5INV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C3SIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C3MIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPI4EIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPI4RXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SPI4TXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RTCCIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FCEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PREIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SQI1IE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>U4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>U4RXIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>U4TXIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2C4BIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>I2C4SIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>I2C4MIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SPI5EIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPI5RXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SPI5TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>U5EIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>U5RXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>U5TXIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>I2C5BIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>I2C5SIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>I2C5MIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SPI6IE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SPI6RXIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SPI6TXIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>U6EIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>U6RXIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>U6TXIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC6</name>
          <description>IEC6 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
