kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IEC6CLR</name>
          <description>IEC6CLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC6SET</name>
          <description>IEC6SET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEC6INV</name>
          <description>IEC6INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCARDYIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADCURDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADCGRPIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADC0EIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ADC1EIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADC2EIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC4EIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ADC7EIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ADC0WIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADC1WIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADC2WIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ADC3WIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ADC4WIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADC7WIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0</name>
          <description>IPC0 register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0CLR</name>
          <description>IPC0CLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0SET</name>
          <description>IPC0SET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC0INV</name>
          <description>IPC0INV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CTIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CS0IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CS0IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CS1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CS1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1</name>
          <description>IPC1 register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1CLR</name>
          <description>IPC1CLR register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1SET</name>
          <description>IPC1SET register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC1INV</name>
          <description>IPC1INV register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2</name>
          <description>IPC2 register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>T2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2CLR</name>
          <description>IPC2CLR register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>T2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2SET</name>
          <description>IPC2SET register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>T2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC2INV</name>
          <description>IPC2INV register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INT1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>INT1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>T2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>T2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3</name>
          <description>IPC3 register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>T3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC3EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC3EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3CLR</name>
          <description>IPC3CLR register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>T3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC3EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC3EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
