kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC3SET</name>
          <description>IPC3SET register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>T3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC3EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC3EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC3INV</name>
          <description>IPC3INV register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>INT2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>INT2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>T3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>T3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>IC3EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>IC3EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4</name>
          <description>IPC4 register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>T4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4CLR</name>
          <description>IPC4CLR register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>T4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4SET</name>
          <description>IPC4SET register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>T4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC4INV</name>
          <description>IPC4INV register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>OC3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>INT3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>INT3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>T4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>T4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5</name>
          <description>IPC5 register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC4EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5CLR</name>
          <description>IPC5CLR register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC4EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5SET</name>
          <description>IPC5SET register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC4EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC5INV</name>
          <description>IPC5INV register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC4EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC4EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>OC4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OC4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>INT4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INT4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6</name>
          <description>IPC6 register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6CLR</name>
          <description>IPC6CLR register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6SET</name>
          <description>IPC6SET register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC6INV</name>
          <description>IPC6INV register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC5EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC5EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7</name>
          <description>IPC7 register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7CLR</name>
          <description>IPC7CLR register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7SET</name>
          <description>IPC7SET register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC7INV</name>
          <description>IPC7INV register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC6IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC6IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8</name>
          <description>IPC8 register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T7IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
