kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC8CLR</name>
          <description>IPC8CLR register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T7IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8SET</name>
          <description>IPC8SET register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T7IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC8INV</name>
          <description>IPC8INV register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T7IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T7IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC7IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC7IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9</name>
          <description>IPC9 register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T8IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T8IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC8EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC8EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC8IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC8IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9CLR</name>
          <description>IPC9CLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T8IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T8IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC8EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC8EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC8IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC8IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9SET</name>
          <description>IPC9SET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T8IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T8IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC8EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC8EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC8IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC8IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC9INV</name>
          <description>IPC9INV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T8IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T8IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC8EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC8EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC8IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC8IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10</name>
          <description>IPC10 register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC9EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC9EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC9IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC9IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC9IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC9IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10CLR</name>
          <description>IPC10CLR register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC9EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC9EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC9IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC9IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC9IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC9IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10SET</name>
          <description>IPC10SET register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC9EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC9EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC9IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC9IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC9IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC9IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC10INV</name>
          <description>IPC10INV register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>IC9EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC9EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>IC9IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>IC9IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>OC9IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>OC9IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11</name>
          <description>IPC11 register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11CLR</name>
          <description>IPC11CLR register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11SET</name>
          <description>IPC11SET register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC11INV</name>
          <description>IPC11INV register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCFIFOIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12</name>
          <description>IPC12 register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12CLR</name>
          <description>IPC12CLR register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12SET</name>
          <description>IPC12SET register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC12INV</name>
          <description>IPC12INV register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDC3IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDC3IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDC4IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDC4IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDC5IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDC5IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDC6IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDC6IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
