kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC13</name>
          <description>IPC13 register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDF3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDF3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDF4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDF4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC13CLR</name>
          <description>IPC13CLR register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDF3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDF3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDF4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDF4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC13SET</name>
          <description>IPC13SET register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDF3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDF3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDF4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDF4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC13INV</name>
          <description>IPC13INV register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCDF3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCDF3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCDF4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCDF4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14</name>
          <description>IPC14 register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCFLTIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCFLTIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14CLR</name>
          <description>IPC14CLR register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCFLTIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCFLTIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14SET</name>
          <description>IPC14SET register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCFLTIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCFLTIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC14INV</name>
          <description>IPC14INV register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDF5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCDF5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCDF6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCDF6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCFLTIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCFLTIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD0IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD0IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15</name>
          <description>IPC15 register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15CLR</name>
          <description>IPC15CLR register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15SET</name>
          <description>IPC15SET register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC15INV</name>
          <description>IPC15INV register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD1IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD1IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD2IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD2IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD3IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD3IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD4IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD4IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16</name>
          <description>IPC16 register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16CLR</name>
          <description>IPC16CLR register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16SET</name>
          <description>IPC16SET register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC16INV</name>
          <description>IPC16INV register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD5IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD5IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD6IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD6IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD7IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD7IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD8IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD8IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC17</name>
          <description>IPC17 register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD10IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD10IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD11IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD11IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD12IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD12IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC17CLR</name>
          <description>IPC17CLR register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD10IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD10IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD11IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD11IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD12IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD12IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC17SET</name>
          <description>IPC17SET register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD10IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD10IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD11IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD11IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD12IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD12IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
