kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC17INV</name>
          <description>IPC17INV register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD9IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD9IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD10IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD10IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD11IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD11IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD12IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD12IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18</name>
          <description>IPC18 register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD13IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD13IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD14IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD15IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD15IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD16IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD16IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18CLR</name>
          <description>IPC18CLR register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD13IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD13IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD14IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD15IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD15IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD16IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD16IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18SET</name>
          <description>IPC18SET register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD13IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD13IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD14IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD15IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD15IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD16IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD16IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC18INV</name>
          <description>IPC18INV register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD13IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD13IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD14IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD14IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD15IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD15IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD16IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD16IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC19</name>
          <description>IPC19 register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD17IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD17IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD18IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD18IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD19IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD19IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD20IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD20IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC19CLR</name>
          <description>IPC19CLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD17IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD17IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD18IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD18IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD19IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD19IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD20IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD20IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC19SET</name>
          <description>IPC19SET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD17IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD17IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD18IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD18IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD19IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD19IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD20IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD20IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC19INV</name>
          <description>IPC19INV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD17IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD17IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD18IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD18IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD19IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD19IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD20IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD20IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC20</name>
          <description>IPC20 register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD21IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD21IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD22IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD22IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD23IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD23IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD24IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC20CLR</name>
          <description>IPC20CLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD21IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD21IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD22IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD22IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD23IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD23IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD24IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC20SET</name>
          <description>IPC20SET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD21IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD21IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD22IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD22IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD23IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD23IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD24IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC20INV</name>
          <description>IPC20INV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD21IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD21IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD22IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD22IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD23IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD23IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD24IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD24IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC21</name>
          <description>IPC21 register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD25IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD25IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD26IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD26IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD27IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD27IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD28IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD28IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC21CLR</name>
          <description>IPC21CLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD25IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD25IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD26IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD26IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD27IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD27IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD28IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD28IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC21SET</name>
          <description>IPC21SET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD25IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD25IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD26IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD26IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD27IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD27IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD28IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD28IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC21INV</name>
          <description>IPC21INV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD25IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD25IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD26IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD26IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD27IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD27IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD28IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD28IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC22</name>
          <description>IPC22 register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD29IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD29IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD30IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD30IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD31IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD31IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD32IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD32IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC22CLR</name>
          <description>IPC22CLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD29IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD29IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD30IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD30IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD31IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD31IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD32IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD32IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
