kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC22SET</name>
          <description>IPC22SET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD29IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD29IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD30IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD30IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD31IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD31IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD32IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD32IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC22INV</name>
          <description>IPC22INV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD29IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD29IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD30IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD30IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD31IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD31IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD32IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD32IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC23</name>
          <description>IPC23 register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD33IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD33IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD34IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD34IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD35IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD35IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD36IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD36IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC23CLR</name>
          <description>IPC23CLR register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD33IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD33IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD34IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD34IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD35IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD35IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD36IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD36IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC23SET</name>
          <description>IPC23SET register</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD33IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD33IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD34IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD34IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD35IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD35IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD36IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD36IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC23INV</name>
          <description>IPC23INV register</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD33IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD33IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD34IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD34IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD35IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD35IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD36IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD36IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC24</name>
          <description>IPC24 register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD37IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD38IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD38IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD39IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD39IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD40IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD40IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC24CLR</name>
          <description>IPC24CLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD37IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD38IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD38IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD39IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD39IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD40IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD40IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC24SET</name>
          <description>IPC24SET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD37IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD38IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD38IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD39IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD39IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD40IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD40IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC24INV</name>
          <description>IPC24INV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD37IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD37IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD38IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD38IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD39IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD39IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD40IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD40IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC25</name>
          <description>IPC25 register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD41IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD41IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD42IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD42IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD43IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD43IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD44IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD44IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC25CLR</name>
          <description>IPC25CLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD41IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD41IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD42IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD42IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD43IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD43IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD44IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD44IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC25SET</name>
          <description>IPC25SET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD41IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD41IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD42IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD42IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD43IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD43IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD44IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD44IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC25INV</name>
          <description>IPC25INV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCD41IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCD41IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCD42IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCD42IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCD43IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCD43IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADCD44IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCD44IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC26</name>
          <description>IPC26 register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CPCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CPCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CFDCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CFDCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CRPTIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CRPTIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC26CLR</name>
          <description>IPC26CLR register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CPCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CPCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CFDCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CFDCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CRPTIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CRPTIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC26SET</name>
          <description>IPC26SET register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CPCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CPCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CFDCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CFDCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CRPTIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CRPTIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC26INV</name>
          <description>IPC26INV register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CPCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CPCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CFDCIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CFDCIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SBIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SBIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CRPTIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CRPTIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC27</name>
          <description>IPC27 register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI1RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI1RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC27CLR</name>
          <description>IPC27CLR register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI1RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI1RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
