kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC27SET</name>
          <description>IPC27SET register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI1RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI1RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC27INV</name>
          <description>IPC27INV register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI1EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI1EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI1RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI1RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI1TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI1TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC28</name>
          <description>IPC28 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U1RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U1RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U1TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U1TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C1BIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC28CLR</name>
          <description>IPC28CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U1RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U1RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U1TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U1TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C1BIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC28SET</name>
          <description>IPC28SET register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U1RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U1RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U1TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U1TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C1BIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC28INV</name>
          <description>IPC28INV register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U1EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U1EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U1RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U1RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U1TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U1TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C1BIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C1BIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC29</name>
          <description>IPC29 register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C1SIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C1SIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1MIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1MIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNAIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNAIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNBIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNBIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC29CLR</name>
          <description>IPC29CLR register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C1SIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C1SIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1MIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1MIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNAIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNAIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNBIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNBIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC29SET</name>
          <description>IPC29SET register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C1SIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C1SIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1MIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1MIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNAIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNAIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNBIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNBIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC29INV</name>
          <description>IPC29INV register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C1SIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C1SIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C1MIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C1MIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNAIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNAIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNBIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNBIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC30</name>
          <description>IPC30 register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNDIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNDIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNFIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNFIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC30CLR</name>
          <description>IPC30CLR register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNDIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNDIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNFIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNFIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC30SET</name>
          <description>IPC30SET register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNDIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNDIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNFIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNFIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC30INV</name>
          <description>IPC30INV register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNCIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNCIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNDIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNDIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNEIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNEIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNFIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNFIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC31</name>
          <description>IPC31 register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNGIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNGIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNJIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNJIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNKIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNKIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC31CLR</name>
          <description>IPC31CLR register</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNGIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNGIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNJIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNJIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNKIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNKIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC31SET</name>
          <description>IPC31SET register</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNGIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNGIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNJIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNJIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNKIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNKIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC31INV</name>
          <description>IPC31INV register</description>
          <addressOffset>0x33c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNGIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CNGIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>CNHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CNHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CNJIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CNJIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CNKIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CNKIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC32</name>
          <description>IPC32 register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>PMPEIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PMPEIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC32CLR</name>
          <description>IPC32CLR register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>PMPEIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PMPEIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
