kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC32SET</name>
          <description>IPC32SET register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>PMPEIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PMPEIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC32INV</name>
          <description>IPC32INV register</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PMPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PMPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>PMPEIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PMPEIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>CMP1IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CMP1IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CMP2IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CMP2IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC33</name>
          <description>IPC33 register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBDMAIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBDMAIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA0IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC33CLR</name>
          <description>IPC33CLR register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBDMAIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBDMAIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA0IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC33SET</name>
          <description>IPC33SET register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBDMAIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBDMAIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA0IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC33INV</name>
          <description>IPC33INV register</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>USBIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>USBDMAIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>USBDMAIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA0IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA0IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC34</name>
          <description>IPC34 register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC34CLR</name>
          <description>IPC34CLR register</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC34SET</name>
          <description>IPC34SET register</description>
          <addressOffset>0x368</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC34INV</name>
          <description>IPC34INV register</description>
          <addressOffset>0x36c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA3IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA3IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>DMA4IS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>DMA4IP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DMA5IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>DMA5IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC35</name>
          <description>IPC35 register</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI2RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC35CLR</name>
          <description>IPC35CLR register</description>
          <addressOffset>0x374</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI2RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC35SET</name>
          <description>IPC35SET register</description>
          <addressOffset>0x378</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI2RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC35INV</name>
          <description>IPC35INV register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA6IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DMA6IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>DMA7IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DMA7IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI2EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI2EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI2RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI2RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC36</name>
          <description>IPC36 register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U2RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U2RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U2TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U2TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC36CLR</name>
          <description>IPC36CLR register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U2RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U2RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U2TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U2TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC36SET</name>
          <description>IPC36SET register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U2RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U2RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U2TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U2TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC36INV</name>
          <description>IPC36INV register</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI2TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U2EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U2EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U2RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U2RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U2TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U2TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC37</name>
          <description>IPC37 register</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C2BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C2BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C2SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C2SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CAN1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CAN1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
