kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC37CLR</name>
          <description>IPC37CLR register</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C2BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C2BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C2SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C2SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CAN1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CAN1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC37SET</name>
          <description>IPC37SET register</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C2BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C2BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C2SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C2SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CAN1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CAN1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC37INV</name>
          <description>IPC37INV register</description>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C2BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C2BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C2SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C2SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C2MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C2MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>CAN1IS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>CAN1IP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC38</name>
          <description>IPC38 register</description>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CAN2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CAN2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ETHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI3EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI3EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI3RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI3RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC38CLR</name>
          <description>IPC38CLR register</description>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CAN2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CAN2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ETHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI3EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI3EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI3RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI3RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC38SET</name>
          <description>IPC38SET register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CAN2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CAN2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ETHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI3EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI3EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI3RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI3RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC38INV</name>
          <description>IPC38INV register</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CAN2IS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CAN2IP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ETHIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ETHIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI3EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI3EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI3RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI3RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC39</name>
          <description>IPC39 register</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI3TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI3TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U3RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U3RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U3TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U3TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC39CLR</name>
          <description>IPC39CLR register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI3TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI3TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U3RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U3RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U3TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U3TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC39SET</name>
          <description>IPC39SET register</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI3TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI3TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U3RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U3RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U3TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U3TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC39INV</name>
          <description>IPC39INV register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI3TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI3TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U3RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U3RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U3TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U3TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC40</name>
          <description>IPC40 register</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C3BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C3SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C3SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C3MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C3MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI4EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI4EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC40CLR</name>
          <description>IPC40CLR register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C3BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C3SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C3SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C3MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C3MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI4EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI4EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC40SET</name>
          <description>IPC40SET register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C3BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C3SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C3SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C3MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C3MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI4EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI4EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC40INV</name>
          <description>IPC40INV register</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C3BIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C3BIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C3SIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C3SIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C3MIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C3MIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI4EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI4EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC41</name>
          <description>IPC41 register</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI4RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI4RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI4TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI4TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC41CLR</name>
          <description>IPC41CLR register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI4RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI4RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI4TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI4TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC41SET</name>
          <description>IPC41SET register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI4RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI4RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI4TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI4TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC41INV</name>
          <description>IPC41INV register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI4RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI4RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI4TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI4TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>RTCCIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>RTCCIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>FCEIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>FCEIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
