kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC42</name>
          <description>IPC42 register</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PREIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PREIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SQI1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SQI1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U4RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U4RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC42CLR</name>
          <description>IPC42CLR register</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PREIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PREIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SQI1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SQI1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U4RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U4RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC42SET</name>
          <description>IPC42SET register</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PREIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PREIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SQI1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SQI1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U4RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U4RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC42INV</name>
          <description>IPC42INV register</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PREIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PREIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SQI1IS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SQI1IP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U4RXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U4RXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC43</name>
          <description>IPC43 register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U4TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U4TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C4BIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C4BIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C4SIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C4SIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C4MIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C4MIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC43CLR</name>
          <description>IPC43CLR register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U4TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U4TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C4BIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C4BIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C4SIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C4SIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C4MIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C4MIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC43SET</name>
          <description>IPC43SET register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U4TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U4TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C4BIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C4BIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C4SIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C4SIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C4MIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C4MIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC43INV</name>
          <description>IPC43INV register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U4TXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U4TXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>I2C4BIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>I2C4BIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C4SIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C4SIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C4MIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C4MIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC44</name>
          <description>IPC44 register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI5EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI5EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI5RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI5RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI5TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI5TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC44CLR</name>
          <description>IPC44CLR register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI5EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI5EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI5RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI5RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI5TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI5TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC44SET</name>
          <description>IPC44SET register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI5EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI5EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI5RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI5RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI5TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI5TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC44INV</name>
          <description>IPC44INV register</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI5EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SPI5EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI5RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI5RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI5TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI5TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>U5EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>U5EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC45</name>
          <description>IPC45 register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U5RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U5TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U5TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C5BIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C5BIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C5SIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C5SIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC45CLR</name>
          <description>IPC45CLR register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U5RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U5TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U5TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C5BIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C5BIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C5SIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C5SIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC45SET</name>
          <description>IPC45SET register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U5RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U5TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U5TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C5BIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C5BIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C5SIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C5SIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC45INV</name>
          <description>IPC45INV register</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5RXIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U5RXIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U5TXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U5TXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>I2C5BIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>I2C5BIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>I2C5SIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>I2C5SIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC46</name>
          <description>IPC46 register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C5MIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C5MIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI6RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI6RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI6TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI6TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC46CLR</name>
          <description>IPC46CLR register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C5MIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C5MIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI6RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI6RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI6TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI6TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC46SET</name>
          <description>IPC46SET register</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C5MIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C5MIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI6RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI6RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI6TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI6TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
