kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC46INV</name>
          <description>IPC46INV register</description>
          <addressOffset>0x42c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2C5MIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C5MIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>SPI6EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SPI6EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SPI6RXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SPI6RXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>SPI6TXIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>SPI6TXIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC47</name>
          <description>IPC47 register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U6EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U6EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U6RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U6RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC47CLR</name>
          <description>IPC47CLR register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U6EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U6EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U6RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U6RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC47SET</name>
          <description>IPC47SET register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U6EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U6EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U6RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U6RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC47INV</name>
          <description>IPC47INV register</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U6EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>U6EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>U6RXIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>U6RXIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>U6TXIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>U6TXIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC48</name>
          <description>IPC48 register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCEOSIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCARDYIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCARDYIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCURDYIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCURDYIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC48CLR</name>
          <description>IPC48CLR register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCEOSIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCARDYIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCARDYIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCURDYIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCURDYIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC48SET</name>
          <description>IPC48SET register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCEOSIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCARDYIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCARDYIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCURDYIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCURDYIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC48INV</name>
          <description>IPC48INV register</description>
          <addressOffset>0x44c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCEOSIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCEOSIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADCARDYIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADCARDYIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADCURDYIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADCURDYIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC49</name>
          <description>IPC49 register</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCGRPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCGRPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC0EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC49CLR</name>
          <description>IPC49CLR register</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCGRPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCGRPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC0EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC49SET</name>
          <description>IPC49SET register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCGRPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCGRPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC0EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC49INV</name>
          <description>IPC49INV register</description>
          <addressOffset>0x45c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCGRPIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADCGRPIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC0EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1EIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1EIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC50</name>
          <description>IPC50 register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC50CLR</name>
          <description>IPC50CLR register</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC50SET</name>
          <description>IPC50SET register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC50INV</name>
          <description>IPC50INV register</description>
          <addressOffset>0x46c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2EIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2EIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4EIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4EIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC51</name>
          <description>IPC51 register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC0WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1WIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1WIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC51CLR</name>
          <description>IPC51CLR register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC0WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1WIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1WIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC51SET</name>
          <description>IPC51SET register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC0WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1WIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1WIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC51INV</name>
          <description>IPC51INV register</description>
          <addressOffset>0x47c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7EIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7EIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC0WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC0WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>ADC1WIS</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADC1WIP</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC52</name>
          <description>IPC52 register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2WIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2WIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC52CLR</name>
          <description>IPC52CLR register</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2WIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2WIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC52SET</name>
          <description>IPC52SET register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2WIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2WIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
