kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>IPC52INV</name>
          <description>IPC52INV register</description>
          <addressOffset>0x48c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC2WIS</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC2WIP</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>ADC3WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC3WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>ADC4WIS</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ADC4WIP</name>
              <bitRange>[20:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC53</name>
          <description>IPC53 register</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC53CLR</name>
          <description>IPC53CLR register</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC53SET</name>
          <description>IPC53SET register</description>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IPC53INV</name>
          <description>IPC53INV register</description>
          <addressOffset>0x49c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC7WIS</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC7WIP</name>
              <bitRange>[12:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF000</name>
          <description>OFF000 register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF001</name>
          <description>OFF001 register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF002</name>
          <description>OFF002 register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF003</name>
          <description>OFF003 register</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF004</name>
          <description>OFF004 register</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF005</name>
          <description>OFF005 register</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF006</name>
          <description>OFF006 register</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF007</name>
          <description>OFF007 register</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF008</name>
          <description>OFF008 register</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF009</name>
          <description>OFF009 register</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF010</name>
          <description>OFF010 register</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF011</name>
          <description>OFF011 register</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF012</name>
          <description>OFF012 register</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF013</name>
          <description>OFF013 register</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF014</name>
          <description>OFF014 register</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF015</name>
          <description>OFF015 register</description>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF016</name>
          <description>OFF016 register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF017</name>
          <description>OFF017 register</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF018</name>
          <description>OFF018 register</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF019</name>
          <description>OFF019 register</description>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF020</name>
          <description>OFF020 register</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF021</name>
          <description>OFF021 register</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF022</name>
          <description>OFF022 register</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF023</name>
          <description>OFF023 register</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF024</name>
          <description>OFF024 register</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF025</name>
          <description>OFF025 register</description>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF026</name>
          <description>OFF026 register</description>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF027</name>
          <description>OFF027 register</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF028</name>
          <description>OFF028 register</description>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF029</name>
          <description>OFF029 register</description>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF030</name>
          <description>OFF030 register</description>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF031</name>
          <description>OFF031 register</description>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF032</name>
          <description>OFF032 register</description>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF033</name>
          <description>OFF033 register</description>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF034</name>
          <description>OFF034 register</description>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF035</name>
          <description>OFF035 register</description>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF036</name>
          <description>OFF036 register</description>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF037</name>
          <description>OFF037 register</description>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF038</name>
          <description>OFF038 register</description>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF039</name>
          <description>OFF039 register</description>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF040</name>
          <description>OFF040 register</description>
          <addressOffset>0x5e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF041</name>
          <description>OFF041 register</description>
          <addressOffset>0x5e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF042</name>
          <description>OFF042 register</description>
          <addressOffset>0x5e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF043</name>
          <description>OFF043 register</description>
          <addressOffset>0x5ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF044</name>
          <description>OFF044 register</description>
          <addressOffset>0x5f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF045</name>
          <description>OFF045 register</description>
          <addressOffset>0x5f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF046</name>
          <description>OFF046 register</description>
          <addressOffset>0x5f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF047</name>
          <description>OFF047 register</description>
          <addressOffset>0x5fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF048</name>
          <description>OFF048 register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF049</name>
          <description>OFF049 register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF050</name>
          <description>OFF050 register</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF051</name>
          <description>OFF051 register</description>
          <addressOffset>0x60c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF052</name>
          <description>OFF052 register</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF053</name>
          <description>OFF053 register</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
