kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>OFF054</name>
          <description>OFF054 register</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF055</name>
          <description>OFF055 register</description>
          <addressOffset>0x61c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF056</name>
          <description>OFF056 register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF057</name>
          <description>OFF057 register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF058</name>
          <description>OFF058 register</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF059</name>
          <description>OFF059 register</description>
          <addressOffset>0x62c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF060</name>
          <description>OFF060 register</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF061</name>
          <description>OFF061 register</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF062</name>
          <description>OFF062 register</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF063</name>
          <description>OFF063 register</description>
          <addressOffset>0x63c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF064</name>
          <description>OFF064 register</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF065</name>
          <description>OFF065 register</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF066</name>
          <description>OFF066 register</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF067</name>
          <description>OFF067 register</description>
          <addressOffset>0x64c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF068</name>
          <description>OFF068 register</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF069</name>
          <description>OFF069 register</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF070</name>
          <description>OFF070 register</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF071</name>
          <description>OFF071 register</description>
          <addressOffset>0x65c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF072</name>
          <description>OFF072 register</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF073</name>
          <description>OFF073 register</description>
          <addressOffset>0x664</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF074</name>
          <description>OFF074 register</description>
          <addressOffset>0x668</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF075</name>
          <description>OFF075 register</description>
          <addressOffset>0x66c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF076</name>
          <description>OFF076 register</description>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF077</name>
          <description>OFF077 register</description>
          <addressOffset>0x674</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF078</name>
          <description>OFF078 register</description>
          <addressOffset>0x678</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF079</name>
          <description>OFF079 register</description>
          <addressOffset>0x67c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF080</name>
          <description>OFF080 register</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF081</name>
          <description>OFF081 register</description>
          <addressOffset>0x684</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF082</name>
          <description>OFF082 register</description>
          <addressOffset>0x688</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF083</name>
          <description>OFF083 register</description>
          <addressOffset>0x68c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF084</name>
          <description>OFF084 register</description>
          <addressOffset>0x690</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF085</name>
          <description>OFF085 register</description>
          <addressOffset>0x694</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF086</name>
          <description>OFF086 register</description>
          <addressOffset>0x698</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF087</name>
          <description>OFF087 register</description>
          <addressOffset>0x69c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF088</name>
          <description>OFF088 register</description>
          <addressOffset>0x6a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF089</name>
          <description>OFF089 register</description>
          <addressOffset>0x6a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF090</name>
          <description>OFF090 register</description>
          <addressOffset>0x6a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF091</name>
          <description>OFF091 register</description>
          <addressOffset>0x6ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF092</name>
          <description>OFF092 register</description>
          <addressOffset>0x6b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF093</name>
          <description>OFF093 register</description>
          <addressOffset>0x6b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF094</name>
          <description>OFF094 register</description>
          <addressOffset>0x6b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF095</name>
          <description>OFF095 register</description>
          <addressOffset>0x6bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF096</name>
          <description>OFF096 register</description>
          <addressOffset>0x6c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF097</name>
          <description>OFF097 register</description>
          <addressOffset>0x6c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF098</name>
          <description>OFF098 register</description>
          <addressOffset>0x6c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF099</name>
          <description>OFF099 register</description>
          <addressOffset>0x6cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF100</name>
          <description>OFF100 register</description>
          <addressOffset>0x6d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF101</name>
          <description>OFF101 register</description>
          <addressOffset>0x6d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF102</name>
          <description>OFF102 register</description>
          <addressOffset>0x6d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF103</name>
          <description>OFF103 register</description>
          <addressOffset>0x6dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF104</name>
          <description>OFF104 register</description>
          <addressOffset>0x6e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF105</name>
          <description>OFF105 register</description>
          <addressOffset>0x6e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF106</name>
          <description>OFF106 register</description>
          <addressOffset>0x6e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF107</name>
          <description>OFF107 register</description>
          <addressOffset>0x6ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF109</name>
          <description>OFF109 register</description>
          <addressOffset>0x6f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF110</name>
          <description>OFF110 register</description>
          <addressOffset>0x6f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF111</name>
          <description>OFF111 register</description>
          <addressOffset>0x6fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF112</name>
          <description>OFF112 register</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF113</name>
          <description>OFF113 register</description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF114</name>
          <description>OFF114 register</description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF115</name>
          <description>OFF115 register</description>
          <addressOffset>0x70c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF116</name>
          <description>OFF116 register</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
