kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>OFF117</name>
          <description>OFF117 register</description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF118</name>
          <description>OFF118 register</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF119</name>
          <description>OFF119 register</description>
          <addressOffset>0x71c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF120</name>
          <description>OFF120 register</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF121</name>
          <description>OFF121 register</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF122</name>
          <description>OFF122 register</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF123</name>
          <description>OFF123 register</description>
          <addressOffset>0x72c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF124</name>
          <description>OFF124 register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF125</name>
          <description>OFF125 register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF126</name>
          <description>OFF126 register</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF127</name>
          <description>OFF127 register</description>
          <addressOffset>0x73c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF128</name>
          <description>OFF128 register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF129</name>
          <description>OFF129 register</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF130</name>
          <description>OFF130 register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF131</name>
          <description>OFF131 register</description>
          <addressOffset>0x74c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF132</name>
          <description>OFF132 register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF133</name>
          <description>OFF133 register</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF134</name>
          <description>OFF134 register</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF135</name>
          <description>OFF135 register</description>
          <addressOffset>0x75c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF136</name>
          <description>OFF136 register</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF137</name>
          <description>OFF137 register</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF138</name>
          <description>OFF138 register</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF139</name>
          <description>OFF139 register</description>
          <addressOffset>0x76c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF140</name>
          <description>OFF140 register</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF141</name>
          <description>OFF141 register</description>
          <addressOffset>0x774</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF142</name>
          <description>OFF142 register</description>
          <addressOffset>0x778</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF143</name>
          <description>OFF143 register</description>
          <addressOffset>0x77c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF144</name>
          <description>OFF144 register</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF145</name>
          <description>OFF145 register</description>
          <addressOffset>0x784</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF146</name>
          <description>OFF146 register</description>
          <addressOffset>0x788</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF147</name>
          <description>OFF147 register</description>
          <addressOffset>0x78c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF148</name>
          <description>OFF148 register</description>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF149</name>
          <description>OFF149 register</description>
          <addressOffset>0x794</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF150</name>
          <description>OFF150 register</description>
          <addressOffset>0x798</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF151</name>
          <description>OFF151 register</description>
          <addressOffset>0x79c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF152</name>
          <description>OFF152 register</description>
          <addressOffset>0x7a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF153</name>
          <description>OFF153 register</description>
          <addressOffset>0x7a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF154</name>
          <description>OFF154 register</description>
          <addressOffset>0x7a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF155</name>
          <description>OFF155 register</description>
          <addressOffset>0x7ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF156</name>
          <description>OFF156 register</description>
          <addressOffset>0x7b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF157</name>
          <description>OFF157 register</description>
          <addressOffset>0x7b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF158</name>
          <description>OFF158 register</description>
          <addressOffset>0x7b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF159</name>
          <description>OFF159 register</description>
          <addressOffset>0x7bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF160</name>
          <description>OFF160 register</description>
          <addressOffset>0x7c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF161</name>
          <description>OFF161 register</description>
          <addressOffset>0x7c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF162</name>
          <description>OFF162 register</description>
          <addressOffset>0x7c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF163</name>
          <description>OFF163 register</description>
          <addressOffset>0x7cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF164</name>
          <description>OFF164 register</description>
          <addressOffset>0x7d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF165</name>
          <description>OFF165 register</description>
          <addressOffset>0x7d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF166</name>
          <description>OFF166 register</description>
          <addressOffset>0x7d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF167</name>
          <description>OFF167 register</description>
          <addressOffset>0x7dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF168</name>
          <description>OFF168 register</description>
          <addressOffset>0x7e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF169</name>
          <description>OFF169 register</description>
          <addressOffset>0x7e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF170</name>
          <description>OFF170 register</description>
          <addressOffset>0x7e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF171</name>
          <description>OFF171 register</description>
          <addressOffset>0x7ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF172</name>
          <description>OFF172 register</description>
          <addressOffset>0x7f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF173</name>
          <description>OFF173 register</description>
          <addressOffset>0x7f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF174</name>
          <description>OFF174 register</description>
          <addressOffset>0x7f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF175</name>
          <description>OFF175 register</description>
          <addressOffset>0x7fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF176</name>
          <description>OFF176 register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF177</name>
          <description>OFF177 register</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF178</name>
          <description>OFF178 register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
