kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>OFF179</name>
          <description>OFF179 register</description>
          <addressOffset>0x80c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF180</name>
          <description>OFF180 register</description>
          <addressOffset>0x810</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF181</name>
          <description>OFF181 register</description>
          <addressOffset>0x814</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF182</name>
          <description>OFF182 register</description>
          <addressOffset>0x818</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF183</name>
          <description>OFF183 register</description>
          <addressOffset>0x81c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF184</name>
          <description>OFF184 register</description>
          <addressOffset>0x820</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF185</name>
          <description>OFF185 register</description>
          <addressOffset>0x824</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF186</name>
          <description>OFF186 register</description>
          <addressOffset>0x828</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF187</name>
          <description>OFF187 register</description>
          <addressOffset>0x82c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF188</name>
          <description>OFF188 register</description>
          <addressOffset>0x830</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF189</name>
          <description>OFF189 register</description>
          <addressOffset>0x834</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x838</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x840</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x844</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x848</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x850</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x858</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x85c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x860</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x864</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x868</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x874</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x878</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x87c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x880</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x884</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x888</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OFF190</name>
          <description>OFF190 register</description>
          <addressOffset>0x894</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VOFF</name>
              <bitRange>[17:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACON</name>
          <description>DMACON register</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONCLR</name>
          <description>DMACONCLR register</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONSET</name>
          <description>DMACONSET register</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACONINV</name>
          <description>DMACONINV register</description>
          <addressOffset>0x100c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMABUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMASTAT register</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATCLR</name>
          <description>DMASTATCLR register</description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATSET</name>
          <description>DMASTATSET register</description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTATINV</name>
          <description>DMASTATINV register</description>
          <addressOffset>0x101c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>RDWR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDR</name>
          <description>DMAADDR register</description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRCLR</name>
          <description>DMAADDRCLR register</description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRSET</name>
          <description>DMAADDRSET register</description>
          <addressOffset>0x1028</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADDRINV</name>
          <description>DMAADDRINV register</description>
          <addressOffset>0x102c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCON</name>
          <description>DCRCCON register</description>
          <addressOffset>0x1030</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONCLR</name>
          <description>DCRCCONCLR register</description>
          <addressOffset>0x1034</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONSET</name>
          <description>DCRCCONSET register</description>
          <addressOffset>0x1038</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCCONINV</name>
          <description>DCRCCONINV register</description>
          <addressOffset>0x103c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CRCCH</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CRCTYP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCAPP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PLEN</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>BITO</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WBO</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>BYTO</name>
              <bitRange>[29:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATA</name>
          <description>DCRCDATA register</description>
          <addressOffset>0x1040</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATACLR</name>
          <description>DCRCDATACLR register</description>
          <addressOffset>0x1044</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATASET</name>
          <description>DCRCDATASET register</description>
          <addressOffset>0x1048</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCDATAINV</name>
          <description>DCRCDATAINV register</description>
          <addressOffset>0x104c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
