kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCRCXOR</name>
          <description>DCRCXOR register</description>
          <addressOffset>0x1050</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORCLR</name>
          <description>DCRCXORCLR register</description>
          <addressOffset>0x1054</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORSET</name>
          <description>DCRCXORSET register</description>
          <addressOffset>0x1058</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRCXORINV</name>
          <description>DCRCXORINV register</description>
          <addressOffset>0x105c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCRCXOR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
      <interrupt>
        <name>CORE_TIMER</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CORE_SOFTWARE_0</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>CORE_SOFTWARE_1</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_0</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>TIMER_1</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_1_ERROR</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_1</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_1</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_1</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>TIMER_2</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_2_ERROR</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_2</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_2</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_2</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIMER_3</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_3_ERROR</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_3</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_3</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_3</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>TIMER_4</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_4_ERROR</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_4</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_4</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>EXTERNAL_4</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIMER_5</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_5_ERROR</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_5</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_5</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>TIMER_6</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_6_ERROR</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_6</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_6</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>TIMER_7</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_7_ERROR</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_7</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_7</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>TIMER_8</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_8_ERROR</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_8</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_8</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>TIMER_9</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_9_ERROR</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>INPUT_CAPTURE_9</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>OUTPUT_COMPARE_9</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>ADC_FIFO</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC1</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC2</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC3</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC4</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC5</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>ADC_DC6</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF1</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF2</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF3</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF4</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF5</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>ADC_DF6</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>ADC_FAULT</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA0</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA1</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA2</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA3</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA4</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA5</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA6</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA7</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA8</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA9</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA10</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA11</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA12</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA13</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA14</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA15</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA16</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA17</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA18</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA19</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA20</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA21</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA22</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA23</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA24</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA25</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA26</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA27</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA28</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA29</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA30</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA31</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA32</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA33</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA34</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA35</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA36</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA37</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA38</name>
        <value>97</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA39</name>
        <value>98</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA40</name>
        <value>99</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA41</name>
        <value>100</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA42</name>
        <value>101</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA43</name>
        <value>102</value>
      </interrupt>
      <interrupt>
        <name>ADC_DATA44</name>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>CORE_PERF_COUNT</name>
        <value>104</value>
      </interrupt>
      <interrupt>
        <name>CORE_FAST_DEBUG_CHAN</name>
        <value>105</value>
      </interrupt>
      <interrupt>
        <name>SYSTEM_BUS_PROTECTION</name>
        <value>106</value>
      </interrupt>
      <interrupt>
        <name>CRYPTO</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>SPI1_FAULT</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>SPI1_RX</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>SPI1_TX</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>UART1_FAULT</name>
        <value>112</value>
      </interrupt>
      <interrupt>
        <name>UART1_RX</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>UART1_TX</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>I2C1_BUS</name>
        <value>115</value>
      </interrupt>
      <interrupt>
        <name>I2C1_SLAVE</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>I2C1_MASTER</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_A</name>
        <value>118</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_B</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_C</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_D</name>
        <value>121</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_E</name>
        <value>122</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_F</name>
        <value>123</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_G</name>
        <value>124</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_H</name>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_J</name>
        <value>126</value>
      </interrupt>
      <interrupt>
        <name>CHANGE_NOTICE_K</name>
        <value>127</value>
      </interrupt>
      <interrupt>
        <name>PMP</name>
        <value>128</value>
      </interrupt>
      <interrupt>
        <name>PMP_ERROR</name>
        <value>129</value>
      </interrupt>
      <interrupt>
        <name>COMPARATOR_1</name>
        <value>130</value>
      </interrupt>
      <interrupt>
        <name>COMPARATOR_2</name>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>USB</name>
        <value>132</value>
      </interrupt>
      <interrupt>
        <name>USB_DMA</name>
        <value>133</value>
      </interrupt>
      <interrupt>
        <name>DMA0</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>DMA1</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>DMA2</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>DMA3</name>
        <value>137</value>
      </interrupt>
      <interrupt>
        <name>DMA4</name>
        <value>138</value>
      </interrupt>
      <interrupt>
        <name>DMA5</name>
        <value>139</value>
      </interrupt>
      <interrupt>
        <name>DMA6</name>
        <value>140</value>
      </interrupt>
      <interrupt>
        <name>DMA7</name>
        <value>141</value>
      </interrupt>
      <interrupt>
        <name>SPI2_FAULT</name>
        <value>142</value>
      </interrupt>
      <interrupt>
        <name>SPI2_RX</name>
        <value>143</value>
      </interrupt>
      <interrupt>
        <name>SPI2_TX</name>
        <value>144</value>
      </interrupt>
      <interrupt>
        <name>UART2_FAULT</name>
        <value>145</value>
      </interrupt>
      <interrupt>
        <name>UART2_RX</name>
        <value>146</value>
      </interrupt>
      <interrupt>
        <name>UART2_TX</name>
        <value>147</value>
      </interrupt>
      <interrupt>
        <name>I2C2_BUS</name>
        <value>148</value>
      </interrupt>
      <interrupt>
        <name>I2C2_SLAVE</name>
        <value>149</value>
      </interrupt>
      <interrupt>
        <name>I2C2_MASTER</name>
        <value>150</value>
      </interrupt>
      <interrupt>
        <name>CAN1</name>
        <value>151</value>
      </interrupt>
      <interrupt>
        <name>CAN2</name>
        <value>152</value>
      </interrupt>
      <interrupt>
        <name>ETHERNET</name>
        <value>153</value>
      </interrupt>
      <interrupt>
        <name>SPI3_FAULT</name>
        <value>154</value>
      </interrupt>
      <interrupt>
        <name>SPI3_RX</name>
        <value>155</value>
      </interrupt>
      <interrupt>
        <name>SPI3_TX</name>
        <value>156</value>
      </interrupt>
      <interrupt>
        <name>UART3_FAULT</name>
        <value>157</value>
      </interrupt>
      <interrupt>
        <name>UART3_RX</name>
        <value>158</value>
      </interrupt>
      <interrupt>
        <name>UART3_TX</name>
        <value>159</value>
      </interrupt>
      <interrupt>
        <name>I2C3_BUS</name>
        <value>160</value>
      </interrupt>
      <interrupt>
        <name>I2C3_SLAVE</name>
        <value>161</value>
      </interrupt>
      <interrupt>
        <name>I2C3_MASTER</name>
        <value>162</value>
      </interrupt>
      <interrupt>
        <name>SPI4_FAULT</name>
        <value>163</value>
      </interrupt>
      <interrupt>
        <name>SPI4_RX</name>
        <value>164</value>
      </interrupt>
      <interrupt>
        <name>SPI4_TX</name>
        <value>165</value>
      </interrupt>
      <interrupt>
        <name>RTCC</name>
        <value>166</value>
      </interrupt>
      <interrupt>
        <name>FLASH_CONTROL</name>
        <value>167</value>
      </interrupt>
      <interrupt>
        <name>PREFETCH</name>
        <value>168</value>
      </interrupt>
      <interrupt>
        <name>SQI1</name>
        <value>169</value>
      </interrupt>
      <interrupt>
        <name>UART4_FAULT</name>
        <value>170</value>
      </interrupt>
      <interrupt>
        <name>UART4_RX</name>
        <value>171</value>
      </interrupt>
      <interrupt>
        <name>UART4_TX</name>
        <value>172</value>
      </interrupt>
      <interrupt>
        <name>I2C4_BUS</name>
        <value>173</value>
      </interrupt>
      <interrupt>
        <name>I2C4_SLAVE</name>
        <value>174</value>
      </interrupt>
      <interrupt>
        <name>I2C4_MASTER</name>
        <value>175</value>
      </interrupt>
      <interrupt>
        <name>SPI5_FAULT</name>
        <value>176</value>
      </interrupt>
      <interrupt>
        <name>SPI5_RX</name>
        <value>177</value>
      </interrupt>
      <interrupt>
        <name>SPI5_TX</name>
        <value>178</value>
      </interrupt>
      <interrupt>
        <name>UART5_FAULT</name>
        <value>179</value>
      </interrupt>
      <interrupt>
        <name>UART5_RX</name>
        <value>180</value>
      </interrupt>
      <interrupt>
        <name>UART5_TX</name>
        <value>181</value>
      </interrupt>
      <interrupt>
        <name>I2C5_BUS</name>
        <value>182</value>
      </interrupt>
      <interrupt>
        <name>I2C5_SLAVE</name>
        <value>183</value>
      </interrupt>
      <interrupt>
        <name>I2C5_MASTER</name>
        <value>184</value>
      </interrupt>
      <interrupt>
        <name>SPI6_FAULT</name>
        <value>185</value>
      </interrupt>
      <interrupt>
        <name>SPI6_RX</name>
        <value>186</value>
      </interrupt>
      <interrupt>
        <name>SPI6_TX</name>
        <value>187</value>
      </interrupt>
      <interrupt>
        <name>UART6_FAULT</name>
        <value>188</value>
      </interrupt>
      <interrupt>
        <name>UART6_RX</name>
        <value>189</value>
      </interrupt>
      <interrupt>
        <name>UART6_TX</name>
        <value>190</value>
      </interrupt>
      <interrupt>
        <name>ADC_EOS</name>
        <value>192</value>
      </interrupt>
      <interrupt>
        <name>ADC_ARDY</name>
        <value>193</value>
      </interrupt>
      <interrupt>
        <name>ADC_URDY</name>
        <value>194</value>
      </interrupt>
      <interrupt>
        <name>ADC_EARLY</name>
        <value>196</value>
      </interrupt>
      <interrupt>
        <name>ADC0_EARLY</name>
        <value>198</value>
      </interrupt>
      <interrupt>
        <name>ADC1_EARLY</name>
        <value>199</value>
      </interrupt>
      <interrupt>
        <name>ADC2_EARLY</name>
        <value>200</value>
      </interrupt>
      <interrupt>
        <name>ADC3_EARLY</name>
        <value>201</value>
      </interrupt>
      <interrupt>
        <name>ADC4_EARLY</name>
        <value>202</value>
      </interrupt>
      <interrupt>
        <name>ADC7_EARLY</name>
        <value>205</value>
      </interrupt>
      <interrupt>
        <name>ADC0_WARM</name>
        <value>206</value>
      </interrupt>
      <interrupt>
        <name>ADC1_WARM</name>
        <value>207</value>
      </interrupt>
      <interrupt>
        <name>ADC2_WARM</name>
        <value>208</value>
      </interrupt>
      <interrupt>
        <name>ADC3_WARM</name>
        <value>209</value>
      </interrupt>
      <interrupt>
        <name>ADC4_WARM</name>
        <value>210</value>
      </interrupt>
      <interrupt>
        <name>ADC7_WARM</name>
        <value>213</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DMAC</name>
      <description>DMAC peripheral</description>
      <baseAddress>0xbf811060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x600</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DCH0CON</name>
          <description>DCH0CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
