kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH1INTSET</name>
          <description>DCH1INTSET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1INTINV</name>
          <description>DCH1INTINV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSA</name>
          <description>DCH1SSA register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSACLR</name>
          <description>DCH1SSACLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSASET</name>
          <description>DCH1SSASET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSAINV</name>
          <description>DCH1SSAINV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSA</name>
          <description>DCH1DSA register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSACLR</name>
          <description>DCH1DSACLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSASET</name>
          <description>DCH1DSASET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSAINV</name>
          <description>DCH1DSAINV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSIZ</name>
          <description>DCH1SSIZ register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSIZCLR</name>
          <description>DCH1SSIZCLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSIZSET</name>
          <description>DCH1SSIZSET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SSIZINV</name>
          <description>DCH1SSIZINV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSIZ</name>
          <description>DCH1DSIZ register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSIZCLR</name>
          <description>DCH1DSIZCLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSIZSET</name>
          <description>DCH1DSIZSET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DSIZINV</name>
          <description>DCH1DSIZINV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SPTR</name>
          <description>DCH1SPTR register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SPTRCLR</name>
          <description>DCH1SPTRCLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SPTRSET</name>
          <description>DCH1SPTRSET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1SPTRINV</name>
          <description>DCH1SPTRINV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DPTR</name>
          <description>DCH1DPTR register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DPTRCLR</name>
          <description>DCH1DPTRCLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DPTRSET</name>
          <description>DCH1DPTRSET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DPTRINV</name>
          <description>DCH1DPTRINV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CSIZ</name>
          <description>DCH1CSIZ register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CSIZCLR</name>
          <description>DCH1CSIZCLR register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CSIZSET</name>
          <description>DCH1CSIZSET register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CSIZINV</name>
          <description>DCH1CSIZINV register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CPTR</name>
          <description>DCH1CPTR register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CPTRCLR</name>
          <description>DCH1CPTRCLR register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CPTRSET</name>
          <description>DCH1CPTRSET register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1CPTRINV</name>
          <description>DCH1CPTRINV register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DAT</name>
          <description>DCH1DAT register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DATCLR</name>
          <description>DCH1DATCLR register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DATSET</name>
          <description>DCH1DATSET register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH1DATINV</name>
          <description>DCH1DATINV register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2CON</name>
          <description>DCH2CON register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2CONCLR</name>
          <description>DCH2CONCLR register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2CONSET</name>
          <description>DCH2CONSET register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
