kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH2CONINV</name>
          <description>DCH2CONINV register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2ECON</name>
          <description>DCH2ECON register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>16776960</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2ECONCLR</name>
          <description>DCH2ECONCLR register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2ECONSET</name>
          <description>DCH2ECONSET register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2ECONINV</name>
          <description>DCH2ECONINV register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2INT</name>
          <description>DCH2INT register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2INTCLR</name>
          <description>DCH2INTCLR register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2INTSET</name>
          <description>DCH2INTSET register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2INTINV</name>
          <description>DCH2INTINV register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSA</name>
          <description>DCH2SSA register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSACLR</name>
          <description>DCH2SSACLR register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSASET</name>
          <description>DCH2SSASET register</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSAINV</name>
          <description>DCH2SSAINV register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSA</name>
          <description>DCH2DSA register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSACLR</name>
          <description>DCH2DSACLR register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSASET</name>
          <description>DCH2DSASET register</description>
          <addressOffset>0x1c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSAINV</name>
          <description>DCH2DSAINV register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSIZ</name>
          <description>DCH2SSIZ register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSIZCLR</name>
          <description>DCH2SSIZCLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSIZSET</name>
          <description>DCH2SSIZSET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SSIZINV</name>
          <description>DCH2SSIZINV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSIZ</name>
          <description>DCH2DSIZ register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSIZCLR</name>
          <description>DCH2DSIZCLR register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSIZSET</name>
          <description>DCH2DSIZSET register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DSIZINV</name>
          <description>DCH2DSIZINV register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SPTR</name>
          <description>DCH2SPTR register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SPTRCLR</name>
          <description>DCH2SPTRCLR register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SPTRSET</name>
          <description>DCH2SPTRSET register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2SPTRINV</name>
          <description>DCH2SPTRINV register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DPTR</name>
          <description>DCH2DPTR register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DPTRCLR</name>
          <description>DCH2DPTRCLR register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH2DPTRSET</name>
          <description>DCH2DPTRSET register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
