kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH4CPTRSET</name>
          <description>DCH4CPTRSET register</description>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH4CPTRINV</name>
          <description>DCH4CPTRINV register</description>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH4DAT</name>
          <description>DCH4DAT register</description>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH4DATCLR</name>
          <description>DCH4DATCLR register</description>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH4DATSET</name>
          <description>DCH4DATSET register</description>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH4DATINV</name>
          <description>DCH4DATINV register</description>
          <addressOffset>0x3bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CON</name>
          <description>DCH5CON register</description>
          <addressOffset>0x3c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CONCLR</name>
          <description>DCH5CONCLR register</description>
          <addressOffset>0x3c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CONSET</name>
          <description>DCH5CONSET register</description>
          <addressOffset>0x3c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CONINV</name>
          <description>DCH5CONINV register</description>
          <addressOffset>0x3cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5ECON</name>
          <description>DCH5ECON register</description>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <resetValue>16776960</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5ECONCLR</name>
          <description>DCH5ECONCLR register</description>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5ECONSET</name>
          <description>DCH5ECONSET register</description>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5ECONINV</name>
          <description>DCH5ECONINV register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5INT</name>
          <description>DCH5INT register</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5INTCLR</name>
          <description>DCH5INTCLR register</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5INTSET</name>
          <description>DCH5INTSET register</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5INTINV</name>
          <description>DCH5INTINV register</description>
          <addressOffset>0x3ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSA</name>
          <description>DCH5SSA register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSACLR</name>
          <description>DCH5SSACLR register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSASET</name>
          <description>DCH5SSASET register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSAINV</name>
          <description>DCH5SSAINV register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSA</name>
          <description>DCH5DSA register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSACLR</name>
          <description>DCH5DSACLR register</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
