kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH5DSASET</name>
          <description>DCH5DSASET register</description>
          <addressOffset>0x408</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSAINV</name>
          <description>DCH5DSAINV register</description>
          <addressOffset>0x40c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSIZ</name>
          <description>DCH5SSIZ register</description>
          <addressOffset>0x410</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSIZCLR</name>
          <description>DCH5SSIZCLR register</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSIZSET</name>
          <description>DCH5SSIZSET register</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SSIZINV</name>
          <description>DCH5SSIZINV register</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSIZ</name>
          <description>DCH5DSIZ register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSIZCLR</name>
          <description>DCH5DSIZCLR register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSIZSET</name>
          <description>DCH5DSIZSET register</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DSIZINV</name>
          <description>DCH5DSIZINV register</description>
          <addressOffset>0x42c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SPTR</name>
          <description>DCH5SPTR register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SPTRCLR</name>
          <description>DCH5SPTRCLR register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SPTRSET</name>
          <description>DCH5SPTRSET register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5SPTRINV</name>
          <description>DCH5SPTRINV register</description>
          <addressOffset>0x43c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DPTR</name>
          <description>DCH5DPTR register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DPTRCLR</name>
          <description>DCH5DPTRCLR register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DPTRSET</name>
          <description>DCH5DPTRSET register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DPTRINV</name>
          <description>DCH5DPTRINV register</description>
          <addressOffset>0x44c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CSIZ</name>
          <description>DCH5CSIZ register</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CSIZCLR</name>
          <description>DCH5CSIZCLR register</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CSIZSET</name>
          <description>DCH5CSIZSET register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CSIZINV</name>
          <description>DCH5CSIZINV register</description>
          <addressOffset>0x45c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CPTR</name>
          <description>DCH5CPTR register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CPTRCLR</name>
          <description>DCH5CPTRCLR register</description>
          <addressOffset>0x464</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CPTRSET</name>
          <description>DCH5CPTRSET register</description>
          <addressOffset>0x468</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5CPTRINV</name>
          <description>DCH5CPTRINV register</description>
          <addressOffset>0x46c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DAT</name>
          <description>DCH5DAT register</description>
          <addressOffset>0x470</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DATCLR</name>
          <description>DCH5DATCLR register</description>
          <addressOffset>0x474</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DATSET</name>
          <description>DCH5DATSET register</description>
          <addressOffset>0x478</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH5DATINV</name>
          <description>DCH5DATINV register</description>
          <addressOffset>0x47c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CON</name>
          <description>DCH6CON register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CONCLR</name>
          <description>DCH6CONCLR register</description>
          <addressOffset>0x484</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CONSET</name>
          <description>DCH6CONSET register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CONINV</name>
          <description>DCH6CONINV register</description>
          <addressOffset>0x48c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6ECON</name>
          <description>DCH6ECON register</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <resetValue>16776960</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6ECONCLR</name>
          <description>DCH6ECONCLR register</description>
          <addressOffset>0x494</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6ECONSET</name>
          <description>DCH6ECONSET register</description>
          <addressOffset>0x498</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6ECONINV</name>
          <description>DCH6ECONINV register</description>
          <addressOffset>0x49c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
