kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH6INT</name>
          <description>DCH6INT register</description>
          <addressOffset>0x4a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6INTCLR</name>
          <description>DCH6INTCLR register</description>
          <addressOffset>0x4a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6INTSET</name>
          <description>DCH6INTSET register</description>
          <addressOffset>0x4a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6INTINV</name>
          <description>DCH6INTINV register</description>
          <addressOffset>0x4ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSA</name>
          <description>DCH6SSA register</description>
          <addressOffset>0x4b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSACLR</name>
          <description>DCH6SSACLR register</description>
          <addressOffset>0x4b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSASET</name>
          <description>DCH6SSASET register</description>
          <addressOffset>0x4b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSAINV</name>
          <description>DCH6SSAINV register</description>
          <addressOffset>0x4bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSA</name>
          <description>DCH6DSA register</description>
          <addressOffset>0x4c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSACLR</name>
          <description>DCH6DSACLR register</description>
          <addressOffset>0x4c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSASET</name>
          <description>DCH6DSASET register</description>
          <addressOffset>0x4c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSAINV</name>
          <description>DCH6DSAINV register</description>
          <addressOffset>0x4cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSIZ</name>
          <description>DCH6SSIZ register</description>
          <addressOffset>0x4d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSIZCLR</name>
          <description>DCH6SSIZCLR register</description>
          <addressOffset>0x4d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSIZSET</name>
          <description>DCH6SSIZSET register</description>
          <addressOffset>0x4d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SSIZINV</name>
          <description>DCH6SSIZINV register</description>
          <addressOffset>0x4dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSIZ</name>
          <description>DCH6DSIZ register</description>
          <addressOffset>0x4e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSIZCLR</name>
          <description>DCH6DSIZCLR register</description>
          <addressOffset>0x4e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSIZSET</name>
          <description>DCH6DSIZSET register</description>
          <addressOffset>0x4e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DSIZINV</name>
          <description>DCH6DSIZINV register</description>
          <addressOffset>0x4ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SPTR</name>
          <description>DCH6SPTR register</description>
          <addressOffset>0x4f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SPTRCLR</name>
          <description>DCH6SPTRCLR register</description>
          <addressOffset>0x4f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SPTRSET</name>
          <description>DCH6SPTRSET register</description>
          <addressOffset>0x4f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6SPTRINV</name>
          <description>DCH6SPTRINV register</description>
          <addressOffset>0x4fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DPTR</name>
          <description>DCH6DPTR register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DPTRCLR</name>
          <description>DCH6DPTRCLR register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DPTRSET</name>
          <description>DCH6DPTRSET register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DPTRINV</name>
          <description>DCH6DPTRINV register</description>
          <addressOffset>0x50c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CSIZ</name>
          <description>DCH6CSIZ register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CSIZCLR</name>
          <description>DCH6CSIZCLR register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CSIZSET</name>
          <description>DCH6CSIZSET register</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CSIZINV</name>
          <description>DCH6CSIZINV register</description>
          <addressOffset>0x51c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CPTR</name>
          <description>DCH6CPTR register</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CPTRCLR</name>
          <description>DCH6CPTRCLR register</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CPTRSET</name>
          <description>DCH6CPTRSET register</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6CPTRINV</name>
          <description>DCH6CPTRINV register</description>
          <addressOffset>0x52c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DAT</name>
          <description>DCH6DAT register</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DATCLR</name>
          <description>DCH6DATCLR register</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DATSET</name>
          <description>DCH6DATSET register</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH6DATINV</name>
          <description>DCH6DATINV register</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
