kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH7CON</name>
          <description>DCH7CON register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CONCLR</name>
          <description>DCH7CONCLR register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CONSET</name>
          <description>DCH7CONSET register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CONINV</name>
          <description>DCH7CONINV register</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CHEDET</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHAEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHCHN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHAED</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHCHNS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CHPATLEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CHPIGNEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CHBUSY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CHPIGN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7ECON</name>
          <description>DCH7ECON register</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <resetValue>16776960</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7ECONCLR</name>
          <description>DCH7ECONCLR register</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7ECONSET</name>
          <description>DCH7ECONSET register</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7ECONINV</name>
          <description>DCH7ECONINV register</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AIRQEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIRQEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PATEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CABORT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFORCE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHSIRQ</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CHAIRQ</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7INT</name>
          <description>DCH7INT register</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7INTCLR</name>
          <description>DCH7INTCLR register</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7INTSET</name>
          <description>DCH7INTSET register</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7INTINV</name>
          <description>DCH7INTINV register</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHERIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CHTAIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHCCIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CHBCIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CHDHIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CHDDIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHSHIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CHSDIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CHERIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CHTAIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CHCCIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CHBCIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CHDHIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CHDDIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CHSHIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CHSDIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSA</name>
          <description>DCH7SSA register</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSACLR</name>
          <description>DCH7SSACLR register</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSASET</name>
          <description>DCH7SSASET register</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSAINV</name>
          <description>DCH7SSAINV register</description>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSA</name>
          <description>DCH7DSA register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSACLR</name>
          <description>DCH7DSACLR register</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSASET</name>
          <description>DCH7DSASET register</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSAINV</name>
          <description>DCH7DSAINV register</description>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSIZ</name>
          <description>DCH7SSIZ register</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSIZCLR</name>
          <description>DCH7SSIZCLR register</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSIZSET</name>
          <description>DCH7SSIZSET register</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SSIZINV</name>
          <description>DCH7SSIZINV register</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
