kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>DCH7DSIZ</name>
          <description>DCH7DSIZ register</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSIZCLR</name>
          <description>DCH7DSIZCLR register</description>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSIZSET</name>
          <description>DCH7DSIZSET register</description>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DSIZINV</name>
          <description>DCH7DSIZINV register</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SPTR</name>
          <description>DCH7SPTR register</description>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SPTRCLR</name>
          <description>DCH7SPTRCLR register</description>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SPTRSET</name>
          <description>DCH7SPTRSET register</description>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7SPTRINV</name>
          <description>DCH7SPTRINV register</description>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHSPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DPTR</name>
          <description>DCH7DPTR register</description>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DPTRCLR</name>
          <description>DCH7DPTRCLR register</description>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DPTRSET</name>
          <description>DCH7DPTRSET register</description>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DPTRINV</name>
          <description>DCH7DPTRINV register</description>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHDPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CSIZ</name>
          <description>DCH7CSIZ register</description>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CSIZCLR</name>
          <description>DCH7CSIZCLR register</description>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CSIZSET</name>
          <description>DCH7CSIZSET register</description>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CSIZINV</name>
          <description>DCH7CSIZINV register</description>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCSIZ</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CPTR</name>
          <description>DCH7CPTR register</description>
          <addressOffset>0x5e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CPTRCLR</name>
          <description>DCH7CPTRCLR register</description>
          <addressOffset>0x5e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CPTRSET</name>
          <description>DCH7CPTRSET register</description>
          <addressOffset>0x5e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7CPTRINV</name>
          <description>DCH7CPTRINV register</description>
          <addressOffset>0x5ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHCPTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DAT</name>
          <description>DCH7DAT register</description>
          <addressOffset>0x5f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DATCLR</name>
          <description>DCH7DATCLR register</description>
          <addressOffset>0x5f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DATSET</name>
          <description>DCH7DATSET register</description>
          <addressOffset>0x5f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCH7DATINV</name>
          <description>DCH7DATINV register</description>
          <addressOffset>0x5fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CHPDAT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
