kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>I2C3BRGINV</name>
          <description>I2C3BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRN</name>
          <description>I2C3TRN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>255</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNCLR</name>
          <description>I2C3TRNCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNSET</name>
          <description>I2C3TRNSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3TRNINV</name>
          <description>I2C3TRNINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3RCV</name>
          <description>I2C3RCV register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3RCVCLR</name>
          <description>I2C3RCVCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3RCVSET</name>
          <description>I2C3RCVSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C3RCVINV</name>
          <description>I2C3RCVINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C4</name>
      <description>I2C4 peripheral</description>
      <baseAddress>0xbf820600</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>I2C4CON</name>
          <description>I2C4CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>4096</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DHEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AHEN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SBCDE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SDAHT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BOEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SCIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PCIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4CONCLR</name>
          <description>I2C4CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DHEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AHEN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SBCDE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SDAHT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BOEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SCIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PCIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4CONSET</name>
          <description>I2C4CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DHEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AHEN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SBCDE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SDAHT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BOEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SCIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PCIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4CONINV</name>
          <description>I2C4CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACKEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACKDT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STREN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GCEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISSLW</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>A10M</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRICT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SCLREL</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DHEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AHEN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SBCDE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SDAHT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BOEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SCIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>PCIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4STAT</name>
          <description>I2C4STAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ACKTIM</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4STATCLR</name>
          <description>I2C4STATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ACKTIM</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4STATSET</name>
          <description>I2C4STATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ACKTIM</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4STATINV</name>
          <description>I2C4STATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>R_W</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>S</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>D_A</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2COV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>IWCOL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ADD10</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GCSTAT</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BCL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ACKTIM</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRSTAT</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACKSTAT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4ADD</name>
          <description>I2C4ADD register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4ADDCLR</name>
          <description>I2C4ADDCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
