kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>I2C4ADDSET</name>
          <description>I2C4ADDSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4ADDINV</name>
          <description>I2C4ADDINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CADD</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4MSK</name>
          <description>I2C4MSK register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4MSKCLR</name>
          <description>I2C4MSKCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4MSKSET</name>
          <description>I2C4MSKSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4MSKINV</name>
          <description>I2C4MSKINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CMSK</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4BRG</name>
          <description>I2C4BRG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4BRGCLR</name>
          <description>I2C4BRGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4BRGSET</name>
          <description>I2C4BRGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4BRGINV</name>
          <description>I2C4BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CBRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4TRN</name>
          <description>I2C4TRN register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>255</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4TRNCLR</name>
          <description>I2C4TRNCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4TRNSET</name>
          <description>I2C4TRNSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4TRNINV</name>
          <description>I2C4TRNINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CTRN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4RCV</name>
          <description>I2C4RCV register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4RCVCLR</name>
          <description>I2C4RCVCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4RCVSET</name>
          <description>I2C4RCVSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C4RCVINV</name>
          <description>I2C4RCVINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>I2CRCV</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
