kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SPI1CON2</name>
          <description>SPI1CON2 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2CLR</name>
          <description>SPI1CON2CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2SET</name>
          <description>SPI1CON2SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI1CON2INV</name>
          <description>SPI1CON2INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI2</name>
      <description>SPI2 peripheral</description>
      <baseAddress>0xbf821200</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPI2CON</name>
          <description>SPI2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CONCLR</name>
          <description>SPI2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CONSET</name>
          <description>SPI2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CONINV</name>
          <description>SPI2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STAT</name>
          <description>SPI2STAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STATCLR</name>
          <description>SPI2STATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STATSET</name>
          <description>SPI2STATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2STATINV</name>
          <description>SPI2STATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
