kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SPI2BUF</name>
          <description>SPI2BUF register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2BUF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BRG</name>
          <description>SPI2BRG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BRGCLR</name>
          <description>SPI2BRGCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BRGSET</name>
          <description>SPI2BRGSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2BRGINV</name>
          <description>SPI2BRGINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI2BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2</name>
          <description>SPI2CON2 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2CLR</name>
          <description>SPI2CON2CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2SET</name>
          <description>SPI2CON2SET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2CON2INV</name>
          <description>SPI2CON2INV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
