kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SPI6</name>
      <description>SPI6 peripheral</description>
      <baseAddress>0xbf821a00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SPI6CON</name>
          <description>SPI6CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6CONCLR</name>
          <description>SPI6CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6CONSET</name>
          <description>SPI6CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6CONINV</name>
          <description>SPI6CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SRXISEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>STXISEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DISSDI</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MSTEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CKP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SSEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MODE16</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODE32</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DISSDO</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ENHBUF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIFE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MCLKSEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FRMCNT</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>FRMSYPW</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>MSSEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FRMPOL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FRMSYNC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FRMEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6STAT</name>
          <description>SPI6STAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6STATCLR</name>
          <description>SPI6STATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6STATSET</name>
          <description>SPI6STATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6STATINV</name>
          <description>SPI6STATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPIRBF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPITBF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SPITBE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPIRBE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPIROV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRMT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SPITUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SPIBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TXBUFELM</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXBUFELM</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6BUF</name>
          <description>SPI6BUF register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI6BUF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6BRG</name>
          <description>SPI6BRG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI6BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6BRGCLR</name>
          <description>SPI6BRGCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI6BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6BRGSET</name>
          <description>SPI6BRGSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI6BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6BRGINV</name>
          <description>SPI6BRGINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPI6BRG</name>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6CON2</name>
          <description>SPI6CON2 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI6CON2CLR</name>
          <description>SPI6CON2CLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AUDMOD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AUDMONO</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IGNTUR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>IGNROV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SPITUREN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SPIROVEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>FRMERREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SPISGNEXT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
