kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UART5</name>
      <description>UART5 peripheral</description>
      <baseAddress>0xbf822800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>U5MODE</name>
          <description>U5MODE register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5MODECLR</name>
          <description>U5MODECLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5MODESET</name>
          <description>U5MODESET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5MODEINV</name>
          <description>U5MODEINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PDSEL</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BRGH</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXINV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ABAUD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPBACK</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UEN</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTSMD</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5STA</name>
          <description>U5STA register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>272</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5STACLR</name>
          <description>U5STACLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5STASET</name>
          <description>U5STASET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5STAINV</name>
          <description>U5STAINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>URXDA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OERR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>FERR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PERR</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RIDLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ADDEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>URXISEL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TRMT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UTXBF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UTXEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UTXBRK</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>URXEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UTXINV</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>UTXISEL</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>ADDR</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ADM_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5TXREG</name>
          <description>U5TXREG register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5TXREG</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5RXREG</name>
          <description>U5RXREG register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>U5RXREG</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5BRG</name>
          <description>U5BRG register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5BRGCLR</name>
          <description>U5BRGCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5BRGSET</name>
          <description>U5BRGSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>U5BRGINV</name>
          <description>U5BRGINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRG</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
