kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR1</name>
      <description>TMR1 peripheral</description>
      <baseAddress>0xbf840000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>T1CON</name>
          <description>T1CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONCLR</name>
          <description>T1CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONSET</name>
          <description>T1CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CONINV</name>
          <description>T1CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TSYNC</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TWIP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TWDIS</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1</name>
          <description>TMR1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1CLR</name>
          <description>TMR1CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1SET</name>
          <description>TMR1SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR1INV</name>
          <description>TMR1INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1</name>
          <description>PR1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1CLR</name>
          <description>PR1CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1SET</name>
          <description>PR1SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR1INV</name>
          <description>PR1INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
