kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR6</name>
      <description>TMR6 peripheral</description>
      <baseAddress>0xbf840a00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>T6CON</name>
          <description>T6CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T6CONCLR</name>
          <description>T6CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T6CONSET</name>
          <description>T6CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T6CONINV</name>
          <description>T6CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6</name>
          <description>TMR6 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6CLR</name>
          <description>TMR6CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6SET</name>
          <description>TMR6SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR6INV</name>
          <description>TMR6INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR6</name>
          <description>PR6 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>PR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR6CLR</name>
          <description>PR6CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR6SET</name>
          <description>PR6SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR6INV</name>
          <description>PR6INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
