kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TMR8</name>
      <description>TMR8 peripheral</description>
      <baseAddress>0xbf840e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>T8CON</name>
          <description>T8CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T8CONCLR</name>
          <description>T8CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T8CONSET</name>
          <description>T8CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T8CONINV</name>
          <description>T8CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TCS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T32</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TCKPS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TGATE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR8</name>
          <description>TMR8 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR8CLR</name>
          <description>TMR8CLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR8SET</name>
          <description>TMR8SET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR8INV</name>
          <description>TMR8INV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TMR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR8</name>
          <description>PR8 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>PR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR8CLR</name>
          <description>PR8CLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR8SET</name>
          <description>PR8SET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PR8INV</name>
          <description>PR8INV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PR8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
