kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ICAP1</name>
      <description>ICAP1 peripheral</description>
      <baseAddress>0xbf842000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IC1CON</name>
          <description>IC1CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CONCLR</name>
          <description>IC1CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CONSET</name>
          <description>IC1CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1CONINV</name>
          <description>IC1CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>ICBNE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ICI</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ICTMR</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>C32</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FEDGE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC1BUF</name>
          <description>IC1BUF register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IC1BUF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
