kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCMP3</name>
      <description>OCMP3 peripheral</description>
      <baseAddress>0xbf844400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC3CON</name>
          <description>OC3CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CONCLR</name>
          <description>OC3CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CONSET</name>
          <description>OC3CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3CONINV</name>
          <description>OC3CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3R</name>
          <description>OC3R register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RCLR</name>
          <description>OC3RCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RSET</name>
          <description>OC3RSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RINV</name>
          <description>OC3RINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RS</name>
          <description>OC3RS register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RSCLR</name>
          <description>OC3RSCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RSSET</name>
          <description>OC3RSSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC3RSINV</name>
          <description>OC3RSINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC3RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
