kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCMP6</name>
      <description>OCMP6 peripheral</description>
      <baseAddress>0xbf844a00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC6CON</name>
          <description>OC6CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CONCLR</name>
          <description>OC6CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CONSET</name>
          <description>OC6CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6CONINV</name>
          <description>OC6CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6R</name>
          <description>OC6R register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RCLR</name>
          <description>OC6RCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RSET</name>
          <description>OC6RSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RINV</name>
          <description>OC6RINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RS</name>
          <description>OC6RS register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RSCLR</name>
          <description>OC6RSCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RSSET</name>
          <description>OC6RSSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC6RSINV</name>
          <description>OC6RSINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC6RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
