kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCMP7</name>
      <description>OCMP7 peripheral</description>
      <baseAddress>0xbf844c00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC7CON</name>
          <description>OC7CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CONCLR</name>
          <description>OC7CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CONSET</name>
          <description>OC7CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7CONINV</name>
          <description>OC7CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7R</name>
          <description>OC7R register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RCLR</name>
          <description>OC7RCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RSET</name>
          <description>OC7RSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RINV</name>
          <description>OC7RINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RS</name>
          <description>OC7RS register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RSCLR</name>
          <description>OC7RSCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RSSET</name>
          <description>OC7RSSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC7RSINV</name>
          <description>OC7RSINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC7RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
