kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCMP8</name>
      <description>OCMP8 peripheral</description>
      <baseAddress>0xbf844e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC8CON</name>
          <description>OC8CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CONCLR</name>
          <description>OC8CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CONSET</name>
          <description>OC8CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8CONINV</name>
          <description>OC8CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8R</name>
          <description>OC8R register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RCLR</name>
          <description>OC8RCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RSET</name>
          <description>OC8RSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RINV</name>
          <description>OC8RINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RS</name>
          <description>OC8RS register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RSCLR</name>
          <description>OC8RSCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RSSET</name>
          <description>OC8RSSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC8RSINV</name>
          <description>OC8RSINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC8RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
