kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OCMP9</name>
      <description>OCMP9 peripheral</description>
      <baseAddress>0xbf845000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OC9CON</name>
          <description>OC9CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9CONCLR</name>
          <description>OC9CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9CONSET</name>
          <description>OC9CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9CONINV</name>
          <description>OC9CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OCM</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCTSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OCFLT</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OC32</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9R</name>
          <description>OC9R register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RCLR</name>
          <description>OC9RCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RSET</name>
          <description>OC9RSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RINV</name>
          <description>OC9RINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9R</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RS</name>
          <description>OC9RS register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RSCLR</name>
          <description>OC9RSCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RSSET</name>
          <description>OC9RSSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC9RSINV</name>
          <description>OC9RSINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>OC9RS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
