kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADCHS</name>
      <description>ADCHS peripheral</description>
      <baseAddress>0xbf84b000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2c0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCCON1</name>
          <description>ADCCON1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STRGLVL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IRQVS</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>FSPBCLKEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>FSSCLKEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CVDEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AICPMPEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>STRGSRC</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FRACT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TRBSLV</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>TRBMST</name>
              <bitRange>[29:27]</bitRange>
            </field>
            <field>
              <name>TRBERR</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>TRBEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCON2</name>
          <description>ADCCON2 register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>ADCEIOVR</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EOSIEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>REFFLTIEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BGVRIEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SAMC</name>
              <bitRange>[25:16]</bitRange>
            </field>
            <field>
              <name>CVDCPL</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>EOSRDY</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>REFFLT</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>BGVRRDY</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCON3</name>
          <description>ADCCON3 register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADINSEL</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>GSWTRG</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>GLSWTRG</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RQCNVRT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SAMP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UPDRDY</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>UPDIEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRGSUSP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VREFSEL</name>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>DIGEN0</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DIGEN1</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DIGEN2</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DIGEN3</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DIGEN4</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIGEN7</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CONCLKDIV</name>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>ADCSEL</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRGMODE</name>
          <description>ADCTRGMODE register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SSAMPEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SSAMPEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSAMPEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SSAMPEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SSAMPEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>STRGEN0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STRGEN1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>STRGEN2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STRGEN3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STRGEN4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SH0ALT</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>SH1ALT</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>SH2ALT</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SH3ALT</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>SH4ALT</name>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIMCON1</name>
          <description>ADCIMCON1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIGN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DIFF0</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIGN1</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIFF1</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIGN2</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIFF2</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIGN3</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DIFF3</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIGN4</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIFF4</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIGN5</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DIFF5</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIGN6</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIFF6</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SIGN7</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DIFF7</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SIGN8</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DIFF8</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SIGN9</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DIFF9</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SIGN10</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIFF10</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SIGN11</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DIFF11</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SIGN12</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DIFF12</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SIGN13</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DIFF13</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SIGN14</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DIFF14</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SIGN15</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DIFF15</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIMCON2</name>
          <description>ADCIMCON2 register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIGN16</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DIFF16</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIGN17</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIFF17</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIGN18</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIFF18</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIGN19</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DIFF19</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIGN20</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIFF20</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIGN21</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DIFF21</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIGN22</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIFF22</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SIGN23</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DIFF23</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SIGN24</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DIFF24</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SIGN25</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DIFF25</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SIGN26</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIFF26</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SIGN27</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DIFF27</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SIGN28</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DIFF28</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SIGN29</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DIFF29</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SIGN30</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DIFF30</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SIGN31</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DIFF31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIMCON3</name>
          <description>ADCIMCON3 register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIGN32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DIFF32</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIGN33</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIFF33</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SIGN34</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIFF34</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIGN35</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DIFF35</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SIGN36</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIFF36</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SIGN37</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DIFF37</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIGN38</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIFF38</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SIGN39</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DIFF39</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SIGN40</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DIFF40</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SIGN41</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DIFF41</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SIGN42</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIFF42</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SIGN43</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DIFF43</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SIGN44</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DIFF44</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCGIRQEN1</name>
          <description>ADCGIRQEN1 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AGIEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AGIEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AGIEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AGIEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AGIEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AGIEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AGIEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AGIEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AGIEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AGIEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AGIEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AGIEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AGIEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AGIEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AGIEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AGIEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AGIEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AGIEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>AGIEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>AGIEN19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>AGIEN20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>AGIEN21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>AGIEN22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AGIEN23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AGIEN24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AGIEN25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>AGIEN26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>AGIEN27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AGIEN28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>AGIEN29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AGIEN30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AGIEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
