kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ADCGIRQEN2</name>
          <description>ADCGIRQEN2 register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AGIEN32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AGIEN33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AGIEN34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AGIEN35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AGIEN36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AGIEN37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AGIEN38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AGIEN39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AGIEN40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AGIEN41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AGIEN42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AGIEN43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AGIEN44</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCSS1</name>
          <description>ADCCSS1 register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSS0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSS1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSS2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSS3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSS4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSS5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSS6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CSS7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSS8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CSS9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSS10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSS11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSS12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CSS13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSS14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSS15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSS16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CSS17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CSS18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CSS19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CSS20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CSS21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CSS22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CSS23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CSS24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CSS25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CSS26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CSS27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CSS28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CSS29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CSS30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CSS31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCSS2</name>
          <description>ADCCSS2 register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSS32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSS33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSS34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSS35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSS36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSS37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSS38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CSS39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSS40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CSS41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSS42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSS43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSS44</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDSTAT1</name>
          <description>ADCDSTAT1 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARDY0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ARDY1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ARDY2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ARDY3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARDY4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ARDY5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ARDY6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ARDY7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ARDY8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARDY9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ARDY10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ARDY11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ARDY12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ARDY13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ARDY14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ARDY15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ARDY16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ARDY17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ARDY18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ARDY19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ARDY20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ARDY21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ARDY22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ARDY23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ARDY24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ARDY25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ARDY26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ARDY27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ARDY28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ARDY29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ARDY30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ARDY31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDSTAT2</name>
          <description>ADCDSTAT2 register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ARDY32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ARDY33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ARDY34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ARDY35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARDY36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ARDY37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ARDY38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ARDY39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ARDY40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARDY41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ARDY42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ARDY43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ARDY44</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPEN1</name>
          <description>ADCCMPEN1 register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP1</name>
          <description>ADCCMP1 register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPEN2</name>
          <description>ADCCMPEN2 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP2</name>
          <description>ADCCMP2 register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
