kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ADCCMPEN3</name>
          <description>ADCCMPEN3 register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP3</name>
          <description>ADCCMP3 register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPEN4</name>
          <description>ADCCMPEN4 register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP4</name>
          <description>ADCCMP4 register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPEN5</name>
          <description>ADCCMPEN5 register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP5</name>
          <description>ADCCMP5 register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPEN6</name>
          <description>ADCCMPEN6 register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMPE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMPE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CMPE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CMPE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CMPE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CMPE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CMPE10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CMPE11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CMPE12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CMPE13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CMPE14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CMPE15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CMPE16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CMPE17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CMPE18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CMPE19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CMPE20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPE21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CMPE22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CMPE23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CMPE24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CMPE25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CMPE26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CMPE27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CMPE28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CMPE29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMPE30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMPE31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMP6</name>
          <description>ADCCMP6 register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DCMPLO</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DCMPHI</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFLTR1</name>
          <description>ADCFLTR1 register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFLTR2</name>
          <description>ADCFLTR2 register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFLTR3</name>
          <description>ADCFLTR3 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFLTR4</name>
          <description>ADCFLTR4 register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
