kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ADCFLTR5</name>
          <description>ADCFLTR5 register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFLTR6</name>
          <description>ADCFLTR6 register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FLTRDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CHNLID</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>AFRDY</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AFGIEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OVRSAM</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>DFMODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DATA16EN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AFEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRG1</name>
          <description>ADCTRG1 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRGSRC0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>TRGSRC1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>TRGSRC2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TRGSRC3</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRG2</name>
          <description>ADCTRG2 register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRGSRC4</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>TRGSRC5</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>TRGSRC6</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TRGSRC7</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRG3</name>
          <description>ADCTRG3 register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRGSRC8</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>TRGSRC9</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>TRGSRC10</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TRGSRC11</name>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON1</name>
          <description>ADCCMPCON1 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>CVDDATA</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON2</name>
          <description>ADCCMPCON2 register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON3</name>
          <description>ADCCMPCON3 register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON4</name>
          <description>ADCCMPCON4 register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON5</name>
          <description>ADCCMPCON5 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCMPCON6</name>
          <description>ADCCMPCON6 register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>IELOLO</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IELOHI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IEHILO</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IEHIHI</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IEBTWN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCMPED</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCMPGIEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ENDCMP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AINID</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFSTAT</name>
          <description>ADCFSTAT register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCID</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>FSIGN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>FWROVERR</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>FRDY</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FIEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADC0EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ADC1EN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ADC2EN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ADC3EN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ADC4EN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFIFO</name>
          <description>ADCFIFO register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCBASE</name>
          <description>ADCBASE register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCBASE</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRGSNS</name>
          <description>ADCTRGSNS register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LVL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LVL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LVL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LVL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LVL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LVL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LVL6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LVL7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LVL8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LVL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LVL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LVL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0TIME</name>
          <description>ADC0TIME register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SAMC</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADCDIV</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1TIME</name>
          <description>ADC1TIME register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SAMC</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADCDIV</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2TIME</name>
          <description>ADC2TIME register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SAMC</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADCDIV</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC3TIME</name>
          <description>ADC3TIME register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SAMC</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADCDIV</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC4TIME</name>
          <description>ADC4TIME register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SAMC</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ADCDIV</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>SELRES</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ADCEIS</name>
              <bitRange>[28:26]</bitRange>
            </field>
          </fields>
        </register>
