kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ADCEIQEN1</name>
          <description>ADCEIQEN1 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EIEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EIEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EIEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EIEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EIEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EIEN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EIEN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EIEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EIEN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EIEN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EIEN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EIEN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EIEN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EIEN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EIEN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EIEN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EIEN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EIEN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EIEN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EIEN19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EIEN20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EIEN21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EIEN22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EIEN23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EIEN24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EIEN25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EIEN26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EIEN27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EIEN28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EIEN29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EIEN30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EIEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCEIQEN2</name>
          <description>ADCEIQEN2 register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EIEN32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EIEN33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EIEN34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EIEN35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EIEN36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EIEN37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EIEN38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EIEN39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EIEN40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EIEN41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EIEN42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EIEN43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EIEN44</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCEISTAT1</name>
          <description>ADCEISTAT1 register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EIRDY0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EIRDY1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EIRDY2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EIRDY3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EIRDY4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EIRDY5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EIRDY6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EIRDY7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EIRDY8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EIRDY9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EIRDY10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EIRDY11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EIRDY12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EIRDY13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EIRDY14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EIRDY15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EIRDY16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EIRDY17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EIRDY18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EIRDY19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EIRDY20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EIRDY21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EIRDY22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EIRDY23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EIRDY24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EIRDY25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>EIRDY26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EIRDY27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>EIRDY28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>EIRDY29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EIRDY30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>EIRDY31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCEISTAT2</name>
          <description>ADCEISTAT2 register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EIRDY32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EIRDY33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EIRDY34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EIRDY35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EIRDY36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EIRDY37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EIRDY38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EIRDY39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EIRDY40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EIRDY41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EIRDY42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EIRDY43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EIRDY44</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCANCON</name>
          <description>ADCANCON register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANEN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANEN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANEN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ANEN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ANEN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANEN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>WKRDY0</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>WKRDY1</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WKRDY2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WKRDY3</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>WKRDY4</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WKRDY7</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WKIEN0</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>WKIEN1</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>WKIEN2</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>WKIEN3</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>WKIEN4</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>WKIEN7</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WKUPCLKCNT</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC0CFG</name>
          <description>ADC0CFG register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1CFG</name>
          <description>ADC1CFG register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC2CFG</name>
          <description>ADC2CFG register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC3CFG</name>
          <description>ADC3CFG register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC4CFG</name>
          <description>ADC4CFG register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC7CFG</name>
          <description>ADC7CFG register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADCCFG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSYSCFG0</name>
          <description>ADCSYSCFG0 register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AN0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AN1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AN2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AN3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AN4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AN5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AN6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AN7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AN8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AN9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AN10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AN11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AN12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AN13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AN14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AN15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AN16</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AN17</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>AN18</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>AN19</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>AN20</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>AN21</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>AN22</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AN23</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AN24</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AN25</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>AN26</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>AN27</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AN28</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>AN29</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AN30</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
