kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ADCSYSCFG1</name>
          <description>ADCSYSCFG1 register</description>
          <addressOffset>0x1c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>AN32</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>AN33</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AN34</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AN35</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AN36</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AN37</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AN38</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AN39</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AN40</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AN41</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AN42</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AN43</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AN44</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AN45</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AN46</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AN47</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AN48</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>AN49</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>AN50</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>AN51</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>AN52</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>AN53</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>AN54</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>AN55</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>AN56</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>AN57</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>AN58</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>AN59</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>AN60</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>AN61</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AN62</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AN63</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA0</name>
          <description>ADCDATA0 register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA1</name>
          <description>ADCDATA1 register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA2</name>
          <description>ADCDATA2 register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA3</name>
          <description>ADCDATA3 register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA4</name>
          <description>ADCDATA4 register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA5</name>
          <description>ADCDATA5 register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA6</name>
          <description>ADCDATA6 register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA7</name>
          <description>ADCDATA7 register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA8</name>
          <description>ADCDATA8 register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA9</name>
          <description>ADCDATA9 register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA10</name>
          <description>ADCDATA10 register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA11</name>
          <description>ADCDATA11 register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA12</name>
          <description>ADCDATA12 register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA13</name>
          <description>ADCDATA13 register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA14</name>
          <description>ADCDATA14 register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA15</name>
          <description>ADCDATA15 register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA16</name>
          <description>ADCDATA16 register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA17</name>
          <description>ADCDATA17 register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA18</name>
          <description>ADCDATA18 register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA19</name>
          <description>ADCDATA19 register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA20</name>
          <description>ADCDATA20 register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA21</name>
          <description>ADCDATA21 register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA22</name>
          <description>ADCDATA22 register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA23</name>
          <description>ADCDATA23 register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA24</name>
          <description>ADCDATA24 register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA25</name>
          <description>ADCDATA25 register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA26</name>
          <description>ADCDATA26 register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA27</name>
          <description>ADCDATA27 register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA28</name>
          <description>ADCDATA28 register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA29</name>
          <description>ADCDATA29 register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA30</name>
          <description>ADCDATA30 register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA31</name>
          <description>ADCDATA31 register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA32</name>
          <description>ADCDATA32 register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA33</name>
          <description>ADCDATA33 register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA34</name>
          <description>ADCDATA34 register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA35</name>
          <description>ADCDATA35 register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA36</name>
          <description>ADCDATA36 register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA37</name>
          <description>ADCDATA37 register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA38</name>
          <description>ADCDATA38 register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA39</name>
          <description>ADCDATA39 register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA40</name>
          <description>ADCDATA40 register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA41</name>
          <description>ADCDATA41 register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA42</name>
          <description>ADCDATA42 register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA43</name>
          <description>ADCDATA43 register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCDATA44</name>
          <description>ADCDATA44 register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
