kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP1</name>
      <description>CMP1 peripheral</description>
      <baseAddress>0xbf84c000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CM1CON</name>
          <description>CM1CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONCLR</name>
          <description>CM1CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONSET</name>
          <description>CM1CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM1CONINV</name>
          <description>CM1CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP2</name>
      <description>CMP2 peripheral</description>
      <baseAddress>0xbf84c010</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CM2CON</name>
          <description>CM2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>195</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONCLR</name>
          <description>CM2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONSET</name>
          <description>CM2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM2CONINV</name>
          <description>CM2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CCH</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CREF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EVPOL</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>COUT</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
