kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMP</name>
      <description>CMP peripheral</description>
      <baseAddress>0xbf84c060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMSTAT</name>
          <description>CMSTAT register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATCLR</name>
          <description>CMSTATCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATSET</name>
          <description>CMSTATSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMSTATINV</name>
          <description>CMSTATINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>C1OUT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>C2OUT</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTA</name>
      <description>PORTA peripheral</description>
      <baseAddress>0xbf860000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xe0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELA</name>
          <description>ANSELA register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>1571</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELACLR</name>
          <description>ANSELACLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELASET</name>
          <description>ANSELASET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELAINV</name>
          <description>ANSELAINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISA</name>
          <description>TRISA register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>50943</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISACLR</name>
          <description>TRISACLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISASET</name>
          <description>TRISASET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISAINV</name>
          <description>TRISAINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTA</name>
          <description>PORTA register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTACLR</name>
          <description>PORTACLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTASET</name>
          <description>PORTASET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTAINV</name>
          <description>PORTAINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATA</name>
          <description>LATA register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATACLR</name>
          <description>LATACLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
