kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>LATASET</name>
          <description>LATASET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATAINV</name>
          <description>LATAINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCA</name>
          <description>ODCA register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCACLR</name>
          <description>ODCACLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCASET</name>
          <description>ODCASET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCAINV</name>
          <description>ODCAINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUA</name>
          <description>CNPUA register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUACLR</name>
          <description>CNPUACLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUASET</name>
          <description>CNPUASET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUAINV</name>
          <description>CNPUAINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDA</name>
          <description>CNPDA register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDACLR</name>
          <description>CNPDACLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDASET</name>
          <description>CNPDASET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDAINV</name>
          <description>CNPDAINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONA</name>
          <description>CNCONA register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
