kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNCONACLR</name>
          <description>CNCONACLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONASET</name>
          <description>CNCONASET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONAINV</name>
          <description>CNCONAINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENA</name>
          <description>CNENA register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENACLR</name>
          <description>CNENACLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENASET</name>
          <description>CNENASET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENAINV</name>
          <description>CNENAINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATA</name>
          <description>CNSTATA register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATACLR</name>
          <description>CNSTATACLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATASET</name>
          <description>CNSTATASET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATAINV</name>
          <description>CNSTATAINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEA</name>
          <description>CNNEA register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEACLR</name>
          <description>CNNEACLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEASET</name>
          <description>CNNEASET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEAINV</name>
          <description>CNNEAINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFA</name>
          <description>CNFA register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
