kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNFACLR</name>
          <description>CNFACLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFASET</name>
          <description>CNFASET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFAINV</name>
          <description>CNFAINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFA0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFA1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFA2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFA3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFA4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFA5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFA6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFA7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFA9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFA10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFA14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFA15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0A</name>
          <description>SRCON0A register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0ACLR</name>
          <description>SRCON0ACLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0ASET</name>
          <description>SRCON0ASET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0AINV</name>
          <description>SRCON0AINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1A</name>
          <description>SRCON1A register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1ACLR</name>
          <description>SRCON1ACLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1ASET</name>
          <description>SRCON1ASET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1AINV</name>
          <description>SRCON1AINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1A6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1A7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
