kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATB</name>
          <description>CNSTATB register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBCLR</name>
          <description>CNSTATBCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBSET</name>
          <description>CNSTATBSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATBINV</name>
          <description>CNSTATBINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEB</name>
          <description>CNNEB register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEBCLR</name>
          <description>CNNEBCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEBSET</name>
          <description>CNNEBSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEBINV</name>
          <description>CNNEBINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFB</name>
          <description>CNFB register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFBCLR</name>
          <description>CNFBCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFBSET</name>
          <description>CNFBSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
