kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNFBINV</name>
          <description>CNFBINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFB0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFB1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFB2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFB3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFB4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFB5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFB6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFB7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFB8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFB9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFB10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFB11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFB12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFB13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFB14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFB15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0B</name>
          <description>SRCON0B register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR0B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR0B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR0B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR0B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0BCLR</name>
          <description>SRCON0BCLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR0B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR0B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR0B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR0B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0BSET</name>
          <description>SRCON0BSET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR0B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR0B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR0B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR0B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0BINV</name>
          <description>SRCON0BINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR0B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR0B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR0B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR0B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1B</name>
          <description>SRCON1B register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR1B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR1B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR1B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR1B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1BCLR</name>
          <description>SRCON1BCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR1B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR1B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR1B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR1B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1BSET</name>
          <description>SRCON1BSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR1B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR1B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR1B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR1B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1BINV</name>
          <description>SRCON1BINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1B3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SR1B5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SR1B8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SR1B9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1B10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SR1B14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
