kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNNECINV</name>
          <description>CNNECINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFC</name>
          <description>CNFC register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFCCLR</name>
          <description>CNFCCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFCSET</name>
          <description>CNFCSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFCINV</name>
          <description>CNFCINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFC1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFC2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFC3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFC4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFC12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFC13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFC14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFC15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
