kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNPDDCLR</name>
          <description>CNPDDCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDDSET</name>
          <description>CNPDDSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDDINV</name>
          <description>CNPDDINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCOND</name>
          <description>CNCOND register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDCLR</name>
          <description>CNCONDCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDSET</name>
          <description>CNCONDSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONDINV</name>
          <description>CNCONDINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNEND</name>
          <description>CNEND register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDCLR</name>
          <description>CNENDCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDSET</name>
          <description>CNENDSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENDINV</name>
          <description>CNENDINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATD</name>
          <description>CNSTATD register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDCLR</name>
          <description>CNSTATDCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATDSET</name>
          <description>CNSTATDSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
