kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATDINV</name>
          <description>CNSTATDINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNED</name>
          <description>CNNED register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEDCLR</name>
          <description>CNNEDCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEDSET</name>
          <description>CNNEDSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEDINV</name>
          <description>CNNEDINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNED0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNED1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNED2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNED3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNED4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNED5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNED6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNED7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNED9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNED10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNED11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNED12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNED13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNED14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNED15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFD</name>
          <description>CNFD register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFDCLR</name>
          <description>CNFDCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFDSET</name>
          <description>CNFDSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFDINV</name>
          <description>CNFDINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFD0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFD1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFD2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFD3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFD4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFD5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFD6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFD7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFD9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFD10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFD11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFD12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFD13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFD14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFD15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
