kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTE</name>
      <description>PORTE peripheral</description>
      <baseAddress>0xbf860400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xe0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELE</name>
          <description>ANSELE register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>1008</resetValue>
          <fields>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELECLR</name>
          <description>ANSELECLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELESET</name>
          <description>ANSELESET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELEINV</name>
          <description>ANSELEINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ANSE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ANSE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <description>TRISE register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>1023</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISECLR</name>
          <description>TRISECLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISESET</name>
          <description>TRISESET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISEINV</name>
          <description>TRISEINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTE</name>
          <description>PORTE register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTECLR</name>
          <description>PORTECLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTESET</name>
          <description>PORTESET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTEINV</name>
          <description>PORTEINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATE</name>
          <description>LATE register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATECLR</name>
          <description>LATECLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATESET</name>
          <description>LATESET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATEINV</name>
          <description>LATEINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCE</name>
          <description>ODCE register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
