kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATE</name>
          <description>CNSTATE register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATECLR</name>
          <description>CNSTATECLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATESET</name>
          <description>CNSTATESET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATEINV</name>
          <description>CNSTATEINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEE</name>
          <description>CNNEE register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEECLR</name>
          <description>CNNEECLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEESET</name>
          <description>CNNEESET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEEINV</name>
          <description>CNNEEINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFE</name>
          <description>CNFE register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFECLR</name>
          <description>CNFECLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFESET</name>
          <description>CNFESET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFEINV</name>
          <description>CNFEINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFE0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFE1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFE2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFE3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFE4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFE5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFE6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFE7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFE8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFE9</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0E</name>
          <description>SRCON0E register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR0E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR0E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0ECLR</name>
          <description>SRCON0ECLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR0E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR0E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0ESET</name>
          <description>SRCON0ESET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR0E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR0E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0EINV</name>
          <description>SRCON0EINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR0E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR0E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1E</name>
          <description>SRCON1E register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR1E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR1E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1ECLR</name>
          <description>SRCON1ECLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR1E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR1E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1ESET</name>
          <description>SRCON1ESET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR1E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR1E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1EINV</name>
          <description>SRCON1EINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1E0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1E1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SR1E2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SR1E3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
