kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNNEF</name>
          <description>CNNEF register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEFCLR</name>
          <description>CNNEFCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEFSET</name>
          <description>CNNEFSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEFINV</name>
          <description>CNNEFINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFF</name>
          <description>CNFF register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFFCLR</name>
          <description>CNFFCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFFSET</name>
          <description>CNFFSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFFINV</name>
          <description>CNFFINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFF0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFF1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFF2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFF3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFF4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFF5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFF8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFF12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFF13</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0F</name>
          <description>SRCON0F register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0FCLR</name>
          <description>SRCON0FCLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0FSET</name>
          <description>SRCON0FSET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0FINV</name>
          <description>SRCON0FINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR0F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1F</name>
          <description>SRCON1F register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1FCLR</name>
          <description>SRCON1FCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1FSET</name>
          <description>SRCON1FSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1FINV</name>
          <description>SRCON1FINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1F0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SR1F1</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
