kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATGCLR</name>
          <description>CNSTATGCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGSET</name>
          <description>CNSTATGSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATGINV</name>
          <description>CNSTATGINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEG</name>
          <description>CNNEG register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEGCLR</name>
          <description>CNNEGCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEGSET</name>
          <description>CNNEGSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEGINV</name>
          <description>CNNEGINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFG</name>
          <description>CNFG register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFGCLR</name>
          <description>CNFGCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFGSET</name>
          <description>CNFGSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFGINV</name>
          <description>CNFGINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFG0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFG1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFG6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFG7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFG8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFG9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFG12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFG13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFG14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFG15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0G</name>
          <description>SRCON0G register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR0G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR0G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0GCLR</name>
          <description>SRCON0GCLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR0G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR0G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0GSET</name>
          <description>SRCON0GSET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR0G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR0G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON0GINV</name>
          <description>SRCON0GINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR0G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR0G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR0G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR0G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR0G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1G</name>
          <description>SRCON1G register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR1G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR1G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1GCLR</name>
          <description>SRCON1GCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR1G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR1G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1GSET</name>
          <description>SRCON1GSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR1G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR1G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCON1GINV</name>
          <description>SRCON1GINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SR1G6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SR1G9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SR1G12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SR1G13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SR1G14</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
