kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTH</name>
      <description>PORTH peripheral</description>
      <baseAddress>0xbf860700</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xc0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELH</name>
          <description>ANSELH register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>115</resetValue>
          <fields>
            <field>
              <name>ANSH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELHCLR</name>
          <description>ANSELHCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELHSET</name>
          <description>ANSELHSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELHINV</name>
          <description>ANSELHINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ANSH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANSH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ANSH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ANSH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISH</name>
          <description>TRISH register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>TRISH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISHCLR</name>
          <description>TRISHCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISHSET</name>
          <description>TRISHSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISHINV</name>
          <description>TRISHINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTH</name>
          <description>PORTH register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTHCLR</name>
          <description>PORTHCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTHSET</name>
          <description>PORTHSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTHINV</name>
          <description>PORTHINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATH</name>
          <description>LATH register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
