kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>LATHCLR</name>
          <description>LATHCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATHSET</name>
          <description>LATHSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATHINV</name>
          <description>LATHINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCH</name>
          <description>ODCH register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCHCLR</name>
          <description>ODCHCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCHSET</name>
          <description>ODCHSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCHINV</name>
          <description>ODCHINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUH</name>
          <description>CNPUH register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUHCLR</name>
          <description>CNPUHCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUHSET</name>
          <description>CNPUHSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUHINV</name>
          <description>CNPUHINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
