kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNPDH</name>
          <description>CNPDH register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDHCLR</name>
          <description>CNPDHCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDHSET</name>
          <description>CNPDHSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDHINV</name>
          <description>CNPDHINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONH</name>
          <description>CNCONH register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONHCLR</name>
          <description>CNCONHCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONHSET</name>
          <description>CNCONHSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONHINV</name>
          <description>CNCONHINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENH</name>
          <description>CNENH register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENHCLR</name>
          <description>CNENHCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENHSET</name>
          <description>CNENHSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENHINV</name>
          <description>CNENHINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATH</name>
          <description>CNSTATH register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATHCLR</name>
          <description>CNSTATHCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
