kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATHSET</name>
          <description>CNSTATHSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATHINV</name>
          <description>CNSTATHINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEH</name>
          <description>CNNEH register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEHCLR</name>
          <description>CNNEHCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEHSET</name>
          <description>CNNEHSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEHINV</name>
          <description>CNNEHINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFH</name>
          <description>CNFH register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFHCLR</name>
          <description>CNFHCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFHSET</name>
          <description>CNFHSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFHINV</name>
          <description>CNFHINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFH0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFH1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFH2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFH3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFH4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFH5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFH6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFH7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFH8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFH9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFH10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFH11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFH12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFH13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFH14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFH15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
