kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTJ</name>
      <description>PORTJ peripheral</description>
      <baseAddress>0xbf860800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xc0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANSELJ</name>
          <description>ANSELJ register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>2816</resetValue>
          <fields>
            <field>
              <name>ANSJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELJCLR</name>
          <description>ANSELJCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELJSET</name>
          <description>ANSELJSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANSELJINV</name>
          <description>ANSELJINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ANSJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ANSJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ANSJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISJ</name>
          <description>TRISJ register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>65535</resetValue>
          <fields>
            <field>
              <name>TRISJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISJCLR</name>
          <description>TRISJCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISJSET</name>
          <description>TRISJSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISJINV</name>
          <description>TRISJINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRISJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRISJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRISJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRISJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRISJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TRISJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRISJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TRISJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTJ</name>
          <description>PORTJ register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTJCLR</name>
          <description>PORTJCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTJSET</name>
          <description>PORTJSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTJINV</name>
          <description>PORTJINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATJ</name>
          <description>LATJ register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
