kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>LATJCLR</name>
          <description>LATJCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATJSET</name>
          <description>LATJSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATJINV</name>
          <description>LATJINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCJ</name>
          <description>ODCJ register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCJCLR</name>
          <description>ODCJCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCJSET</name>
          <description>ODCJSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCJINV</name>
          <description>ODCJINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ODCJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ODCJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ODCJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ODCJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ODCJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ODCJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ODCJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ODCJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUJ</name>
          <description>CNPUJ register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUJCLR</name>
          <description>CNPUJCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUJSET</name>
          <description>CNPUJSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUJINV</name>
          <description>CNPUJINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPUJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPUJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPUJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPUJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPUJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPUJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPUJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPUJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
