kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNPDJ</name>
          <description>CNPDJ register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDJCLR</name>
          <description>CNPDJCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDJSET</name>
          <description>CNPDJSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDJINV</name>
          <description>CNPDJINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNPDJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNPDJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNPDJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNPDJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNPDJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNPDJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNPDJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNPDJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONJ</name>
          <description>CNCONJ register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONJCLR</name>
          <description>CNCONJCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONJSET</name>
          <description>CNCONJSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONJINV</name>
          <description>CNCONJINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENJ</name>
          <description>CNENJ register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENJCLR</name>
          <description>CNENJCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENJSET</name>
          <description>CNENJSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENJINV</name>
          <description>CNENJINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNIEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNIEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNIEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNIEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNIEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNIEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNIEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNIEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATJ</name>
          <description>CNSTATJ register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATJCLR</name>
          <description>CNSTATJCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
