kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNSTATJSET</name>
          <description>CNSTATJSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATJINV</name>
          <description>CNSTATJINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNSTATJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNSTATJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNSTATJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNSTATJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNSTATJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNSTATJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNSTATJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNSTATJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEJ</name>
          <description>CNNEJ register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEJCLR</name>
          <description>CNNEJCLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEJSET</name>
          <description>CNNEJSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEJINV</name>
          <description>CNNEJINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNNEJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNNEJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNNEJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNNEJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNNEJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNNEJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNNEJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNNEJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFJ</name>
          <description>CNFJ register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFJCLR</name>
          <description>CNFJCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFJSET</name>
          <description>CNFJSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFJINV</name>
          <description>CNFJINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFJ0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFJ1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFJ2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFJ3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFJ4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFJ5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFJ6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFJ7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CNFJ8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CNFJ9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CNFJ10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CNFJ11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CNFJ12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CNFJ13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CNFJ14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CNFJ15</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
