kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PORTK</name>
      <description>PORTK peripheral</description>
      <baseAddress>0xbf860910</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xb0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRISK</name>
          <description>TRISK register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>255</resetValue>
          <fields>
            <field>
              <name>TRISK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISKCLR</name>
          <description>TRISKCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISKSET</name>
          <description>TRISKSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISKINV</name>
          <description>TRISKINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRISK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRISK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRISK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRISK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRISK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRISK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRISK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRISK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTK</name>
          <description>PORTK register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTKCLR</name>
          <description>PORTKCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTKSET</name>
          <description>PORTKSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PORTKINV</name>
          <description>PORTKINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATK</name>
          <description>LATK register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATKCLR</name>
          <description>LATKCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATKSET</name>
          <description>LATKSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LATKINV</name>
          <description>LATKINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCK</name>
          <description>ODCK register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCKCLR</name>
          <description>ODCKCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCKSET</name>
          <description>ODCKSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODCKINV</name>
          <description>ODCKINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ODCK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ODCK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ODCK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ODCK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ODCK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ODCK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ODCK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ODCK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUK</name>
          <description>CNPUK register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUKCLR</name>
          <description>CNPUKCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPUKSET</name>
          <description>CNPUKSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
