kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>CNPUKINV</name>
          <description>CNPUKINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPUK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPUK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPUK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPUK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPUK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPUK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPUK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPUK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDK</name>
          <description>CNPDK register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDKCLR</name>
          <description>CNPDKCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDKSET</name>
          <description>CNPDKSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNPDKINV</name>
          <description>CNPDKINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNPDK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNPDK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNPDK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNPDK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNPDK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNPDK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNPDK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNPDK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONK</name>
          <description>CNCONK register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONKCLR</name>
          <description>CNCONKCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONKSET</name>
          <description>CNCONKSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNCONKINV</name>
          <description>CNCONKINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EDGEDETECT</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENK</name>
          <description>CNENK register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENKCLR</name>
          <description>CNENKCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENKSET</name>
          <description>CNENKSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNENKINV</name>
          <description>CNENKINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNIEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNIEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNIEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNIEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNIEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNIEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNIEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNIEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATK</name>
          <description>CNSTATK register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATKCLR</name>
          <description>CNSTATKCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATKSET</name>
          <description>CNSTATKSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNSTATKINV</name>
          <description>CNSTATKINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNSTATK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNSTATK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNSTATK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNSTATK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNSTATK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNSTATK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNSTATK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNSTATK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEK</name>
          <description>CNNEK register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEKCLR</name>
          <description>CNNEKCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEKSET</name>
          <description>CNNEKSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNNEKINV</name>
          <description>CNNEKINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNNEK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNNEK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNNEK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNNEK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNNEK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNNEK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNNEK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNNEK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNFK</name>
          <description>CNFK register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CNFK0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CNFK1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CNFK2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CNFK3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNFK4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CNFK5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CNFK6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CNFK7</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
