kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C1VECCLR</name>
          <description>C1VECCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1VECSET</name>
          <description>C1VECSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1VECINV</name>
          <description>C1VECINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TREC</name>
          <description>C1TREC register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TRECCLR</name>
          <description>C1TRECCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TRECSET</name>
          <description>C1TRECSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TRECINV</name>
          <description>C1TRECINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FSTAT</name>
          <description>C1FSTAT register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FSTATCLR</name>
          <description>C1FSTATCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FSTATSET</name>
          <description>C1FSTATSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FSTATINV</name>
          <description>C1FSTATINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVF</name>
          <description>C1RXOVF register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVFCLR</name>
          <description>C1RXOVFCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVFSET</name>
          <description>C1RXOVFSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXOVFINV</name>
          <description>C1RXOVFINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TMR</name>
          <description>C1TMR register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TMRCLR</name>
          <description>C1TMRCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TMRSET</name>
          <description>C1TMRSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1TMRINV</name>
          <description>C1TMRINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0</name>
          <description>C1RXM0 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0CLR</name>
          <description>C1RXM0CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0SET</name>
          <description>C1RXM0SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM0INV</name>
          <description>C1RXM0INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1</name>
          <description>C1RXM1 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1CLR</name>
          <description>C1RXM1CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1SET</name>
          <description>C1RXM1SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM1INV</name>
          <description>C1RXM1INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2</name>
          <description>C1RXM2 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2CLR</name>
          <description>C1RXM2CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2SET</name>
          <description>C1RXM2SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM2INV</name>
          <description>C1RXM2INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM3</name>
          <description>C1RXM3 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM3CLR</name>
          <description>C1RXM3CLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM3SET</name>
          <description>C1RXM3SET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXM3INV</name>
          <description>C1RXM3INV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FLTCON0</name>
          <description>C1FLTCON0 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL0</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN0</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL1</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN1</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL2</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN2</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL3</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL3</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
