kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C1FLTCON7CLR</name>
          <description>C1FLTCON7CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FLTCON7SET</name>
          <description>C1FLTCON7SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FLTCON7INV</name>
          <description>C1FLTCON7INV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0</name>
          <description>C1RXF0 register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0CLR</name>
          <description>C1RXF0CLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0SET</name>
          <description>C1RXF0SET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF0INV</name>
          <description>C1RXF0INV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1</name>
          <description>C1RXF1 register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1CLR</name>
          <description>C1RXF1CLR register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1SET</name>
          <description>C1RXF1SET register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF1INV</name>
          <description>C1RXF1INV register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2</name>
          <description>C1RXF2 register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2CLR</name>
          <description>C1RXF2CLR register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2SET</name>
          <description>C1RXF2SET register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF2INV</name>
          <description>C1RXF2INV register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3</name>
          <description>C1RXF3 register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3CLR</name>
          <description>C1RXF3CLR register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3SET</name>
          <description>C1RXF3SET register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF3INV</name>
          <description>C1RXF3INV register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4</name>
          <description>C1RXF4 register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4CLR</name>
          <description>C1RXF4CLR register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4SET</name>
          <description>C1RXF4SET register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF4INV</name>
          <description>C1RXF4INV register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5</name>
          <description>C1RXF5 register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5CLR</name>
          <description>C1RXF5CLR register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5SET</name>
          <description>C1RXF5SET register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF5INV</name>
          <description>C1RXF5INV register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6</name>
          <description>C1RXF6 register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6CLR</name>
          <description>C1RXF6CLR register</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6SET</name>
          <description>C1RXF6SET register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF6INV</name>
          <description>C1RXF6INV register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7</name>
          <description>C1RXF7 register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF7CLR</name>
          <description>C1RXF7CLR register</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
