kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C1RXF17</name>
          <description>C1RXF17 register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF17CLR</name>
          <description>C1RXF17CLR register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF17SET</name>
          <description>C1RXF17SET register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF17INV</name>
          <description>C1RXF17INV register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF18</name>
          <description>C1RXF18 register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF18CLR</name>
          <description>C1RXF18CLR register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF18SET</name>
          <description>C1RXF18SET register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF18INV</name>
          <description>C1RXF18INV register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF19</name>
          <description>C1RXF19 register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF19CLR</name>
          <description>C1RXF19CLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF19SET</name>
          <description>C1RXF19SET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF19INV</name>
          <description>C1RXF19INV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF20</name>
          <description>C1RXF20 register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF20CLR</name>
          <description>C1RXF20CLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF20SET</name>
          <description>C1RXF20SET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF20INV</name>
          <description>C1RXF20INV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF21</name>
          <description>C1RXF21 register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF21CLR</name>
          <description>C1RXF21CLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF21SET</name>
          <description>C1RXF21SET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF21INV</name>
          <description>C1RXF21INV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF22</name>
          <description>C1RXF22 register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF22CLR</name>
          <description>C1RXF22CLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF22SET</name>
          <description>C1RXF22SET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF22INV</name>
          <description>C1RXF22INV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF23</name>
          <description>C1RXF23 register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF23CLR</name>
          <description>C1RXF23CLR register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF23SET</name>
          <description>C1RXF23SET register</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF23INV</name>
          <description>C1RXF23INV register</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF24</name>
          <description>C1RXF24 register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF24CLR</name>
          <description>C1RXF24CLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF24SET</name>
          <description>C1RXF24SET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF24INV</name>
          <description>C1RXF24INV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF25</name>
          <description>C1RXF25 register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF25CLR</name>
          <description>C1RXF25CLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF25SET</name>
          <description>C1RXF25SET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF25INV</name>
          <description>C1RXF25INV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF26</name>
          <description>C1RXF26 register</description>
          <addressOffset>0x2e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF26CLR</name>
          <description>C1RXF26CLR register</description>
          <addressOffset>0x2e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
