kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C1RXF26SET</name>
          <description>C1RXF26SET register</description>
          <addressOffset>0x2e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF26INV</name>
          <description>C1RXF26INV register</description>
          <addressOffset>0x2ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF27</name>
          <description>C1RXF27 register</description>
          <addressOffset>0x2f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF27CLR</name>
          <description>C1RXF27CLR register</description>
          <addressOffset>0x2f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF27SET</name>
          <description>C1RXF27SET register</description>
          <addressOffset>0x2f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF27INV</name>
          <description>C1RXF27INV register</description>
          <addressOffset>0x2fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF28</name>
          <description>C1RXF28 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF28CLR</name>
          <description>C1RXF28CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF28SET</name>
          <description>C1RXF28SET register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF28INV</name>
          <description>C1RXF28INV register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF29</name>
          <description>C1RXF29 register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF29CLR</name>
          <description>C1RXF29CLR register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF29SET</name>
          <description>C1RXF29SET register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF29INV</name>
          <description>C1RXF29INV register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF30</name>
          <description>C1RXF30 register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF30CLR</name>
          <description>C1RXF30CLR register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF30SET</name>
          <description>C1RXF30SET register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF30INV</name>
          <description>C1RXF30INV register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF31</name>
          <description>C1RXF31 register</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF31CLR</name>
          <description>C1RXF31CLR register</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF31SET</name>
          <description>C1RXF31SET register</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1RXF31INV</name>
          <description>C1RXF31INV register</description>
          <addressOffset>0x33c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOBA</name>
          <description>C1FIFOBA register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOBA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOBACLR</name>
          <description>C1FIFOBACLR register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOBA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOBASET</name>
          <description>C1FIFOBASET register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOBA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOBAINV</name>
          <description>C1FIFOBAINV register</description>
          <addressOffset>0x34c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOBA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON0</name>
          <description>C1FIFOCON0 register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON0CLR</name>
          <description>C1FIFOCON0CLR register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON0SET</name>
          <description>C1FIFOCON0SET register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON0INV</name>
          <description>C1FIFOCON0INV register</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT0</name>
          <description>C1FIFOINT0 register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
