kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C1FIFOCON11SET</name>
          <description>C1FIFOCON11SET register</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON11INV</name>
          <description>C1FIFOCON11INV register</description>
          <addressOffset>0x61c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT11</name>
          <description>C1FIFOINT11 register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT11CLR</name>
          <description>C1FIFOINT11CLR register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT11SET</name>
          <description>C1FIFOINT11SET register</description>
          <addressOffset>0x628</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT11INV</name>
          <description>C1FIFOINT11INV register</description>
          <addressOffset>0x62c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOUA11</name>
          <description>C1FIFOUA11 register</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOUA11CLR</name>
          <description>C1FIFOUA11CLR register</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOUA11SET</name>
          <description>C1FIFOUA11SET register</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOUA11INV</name>
          <description>C1FIFOUA11INV register</description>
          <addressOffset>0x63c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCI11</name>
          <description>C1FIFOCI11 register</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCI11CLR</name>
          <description>C1FIFOCI11CLR register</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCI11SET</name>
          <description>C1FIFOCI11SET register</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCI11INV</name>
          <description>C1FIFOCI11INV register</description>
          <addressOffset>0x64c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON12</name>
          <description>C1FIFOCON12 register</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON12CLR</name>
          <description>C1FIFOCON12CLR register</description>
          <addressOffset>0x654</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON12SET</name>
          <description>C1FIFOCON12SET register</description>
          <addressOffset>0x658</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOCON12INV</name>
          <description>C1FIFOCON12INV register</description>
          <addressOffset>0x65c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C1FIFOINT12</name>
          <description>C1FIFOINT12 register</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
