kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CAN2</name>
      <description>CAN2 peripheral</description>
      <baseAddress>0xbf881000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xb50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>C2CON</name>
          <description>C2CON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>75497472</resetValue>
          <fields>
            <field>
              <name>DNCNT</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>CANBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CANCAP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>OPMOD</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>REQOP</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>ABAT</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CONCLR</name>
          <description>C2CONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DNCNT</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>CANBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CANCAP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>OPMOD</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>REQOP</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>ABAT</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CONSET</name>
          <description>C2CONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DNCNT</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>CANBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CANCAP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>OPMOD</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>REQOP</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>ABAT</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CONINV</name>
          <description>C2CONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DNCNT</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>CANBUSY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRZ</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CANCAP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>OPMOD</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>REQOP</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>ABAT</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFG</name>
          <description>C2CFG register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SJW</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PRSEG</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SEG1PH</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SAM</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SEG2PHTS</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SEG2PH</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>WAKFIL</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFGCLR</name>
          <description>C2CFGCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SJW</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PRSEG</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SEG1PH</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SAM</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SEG2PHTS</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SEG2PH</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>WAKFIL</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFGSET</name>
          <description>C2CFGSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SJW</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PRSEG</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SEG1PH</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SAM</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SEG2PHTS</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SEG2PH</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>WAKFIL</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2CFGINV</name>
          <description>C2CFGINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BRP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SJW</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PRSEG</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SEG1PH</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>SAM</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SEG2PHTS</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SEG2PH</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>WAKFIL</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2INT</name>
          <description>C2INT register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTMRIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RBOVIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SERRIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CERRIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAKIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IVRIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TBIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RBIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CTMRIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MODIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RBOVIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SERRIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CERRIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WAKIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IVRIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2INTCLR</name>
          <description>C2INTCLR register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTMRIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RBOVIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SERRIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CERRIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAKIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IVRIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TBIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RBIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CTMRIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MODIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RBOVIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SERRIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CERRIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WAKIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IVRIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2INTSET</name>
          <description>C2INTSET register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTMRIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RBOVIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SERRIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CERRIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAKIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IVRIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TBIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RBIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CTMRIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MODIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RBOVIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SERRIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CERRIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WAKIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IVRIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2INTINV</name>
          <description>C2INTINV register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TBIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RBIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTMRIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RBOVIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SERRIF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CERRIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WAKIF</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IVRIF</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TBIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RBIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CTMRIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MODIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RBOVIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SERRIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CERRIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WAKIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IVRIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2VEC</name>
          <description>C2VEC register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>64</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2VECCLR</name>
          <description>C2VECCLR register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2VECSET</name>
          <description>C2VECSET register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2VECINV</name>
          <description>C2VECINV register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ICODE</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>FILHIT</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TREC</name>
          <description>C2TREC register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
