kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2TRECCLR</name>
          <description>C2TRECCLR register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TRECSET</name>
          <description>C2TRECSET register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TRECINV</name>
          <description>C2TRECINV register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RERRCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TERRCNT</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EWARN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXWARN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXWARN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXBP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXBP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TXBO</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FSTAT</name>
          <description>C2FSTAT register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FSTATCLR</name>
          <description>C2FSTATCLR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FSTATSET</name>
          <description>C2FSTATSET register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FSTATINV</name>
          <description>C2FSTATINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOIP</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVF</name>
          <description>C2RXOVF register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVFCLR</name>
          <description>C2RXOVFCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVFSET</name>
          <description>C2RXOVFSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXOVFINV</name>
          <description>C2RXOVFINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TMR</name>
          <description>C2TMR register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TMRCLR</name>
          <description>C2TMRCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TMRSET</name>
          <description>C2TMRSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2TMRINV</name>
          <description>C2TMRINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CANTSPRE</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CANTS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0</name>
          <description>C2RXM0 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0CLR</name>
          <description>C2RXM0CLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0SET</name>
          <description>C2RXM0SET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM0INV</name>
          <description>C2RXM0INV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1</name>
          <description>C2RXM1 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1CLR</name>
          <description>C2RXM1CLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1SET</name>
          <description>C2RXM1SET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM1INV</name>
          <description>C2RXM1INV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2</name>
          <description>C2RXM2 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2CLR</name>
          <description>C2RXM2CLR register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2SET</name>
          <description>C2RXM2SET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM2INV</name>
          <description>C2RXM2INV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM3</name>
          <description>C2RXM3 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM3CLR</name>
          <description>C2RXM3CLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM3SET</name>
          <description>C2RXM3SET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXM3INV</name>
          <description>C2RXM3INV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>MIDE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON0</name>
          <description>C2FLTCON0 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL0</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN0</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL1</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN1</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL2</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN2</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL3</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL3</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON0CLR</name>
          <description>C2FLTCON0CLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL0</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN0</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL1</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN1</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL2</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN2</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL3</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL3</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON0SET</name>
          <description>C2FLTCON0SET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL0</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN0</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL1</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN1</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL2</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN2</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL3</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL3</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
