kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FLTCON0INV</name>
          <description>C2FLTCON0INV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL0</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL0</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN0</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL1</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL1</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN1</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL2</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL2</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN2</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL3</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL3</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN3</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON1</name>
          <description>C2FLTCON1 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL4</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL4</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN4</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL5</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL5</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN5</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL6</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL6</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN6</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL7</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL7</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN7</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON1CLR</name>
          <description>C2FLTCON1CLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL4</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL4</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN4</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL5</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL5</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN5</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL6</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL6</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN6</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL7</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL7</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN7</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON1SET</name>
          <description>C2FLTCON1SET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL4</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL4</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN4</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL5</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL5</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN5</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL6</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL6</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN6</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL7</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL7</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN7</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON1INV</name>
          <description>C2FLTCON1INV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL4</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL4</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN4</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL5</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL5</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN5</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL6</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL6</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN6</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL7</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL7</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN7</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON2</name>
          <description>C2FLTCON2 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL8</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL8</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL9</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL9</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN9</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL10</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL10</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN10</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL11</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL11</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN11</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON2CLR</name>
          <description>C2FLTCON2CLR register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL8</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL8</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL9</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL9</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN9</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL10</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL10</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN10</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL11</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL11</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN11</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON2SET</name>
          <description>C2FLTCON2SET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL8</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL8</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL9</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL9</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN9</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL10</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL10</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN10</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL11</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL11</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN11</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON2INV</name>
          <description>C2FLTCON2INV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL8</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL8</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL9</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL9</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN9</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL10</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL10</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN10</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL11</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL11</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN11</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON3</name>
          <description>C2FLTCON3 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL12</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL12</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN12</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL13</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL13</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN13</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL14</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL14</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN14</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL15</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL15</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN15</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON3CLR</name>
          <description>C2FLTCON3CLR register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL12</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL12</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN12</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL13</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL13</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN13</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL14</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL14</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN14</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL15</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL15</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN15</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON3SET</name>
          <description>C2FLTCON3SET register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL12</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL12</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN12</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL13</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL13</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN13</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL14</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL14</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN14</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL15</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL15</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN15</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON3INV</name>
          <description>C2FLTCON3INV register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL12</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL12</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN12</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL13</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL13</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN13</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL14</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL14</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN14</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL15</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL15</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN15</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON4</name>
          <description>C2FLTCON4 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL16</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL16</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN16</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL17</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL17</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN17</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL18</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL18</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN18</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL19</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL19</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN19</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
