kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FLTCON4CLR</name>
          <description>C2FLTCON4CLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL16</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL16</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN16</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL17</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL17</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN17</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL18</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL18</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN18</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL19</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL19</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN19</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON4SET</name>
          <description>C2FLTCON4SET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL16</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL16</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN16</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL17</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL17</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN17</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL18</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL18</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN18</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL19</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL19</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN19</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON4INV</name>
          <description>C2FLTCON4INV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL16</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL16</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN16</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL17</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL17</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN17</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL18</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL18</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN18</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL19</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL19</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN19</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON5</name>
          <description>C2FLTCON5 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL20</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL20</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN20</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL21</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL21</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN21</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL22</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL22</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN22</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL23</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL23</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN23</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON5CLR</name>
          <description>C2FLTCON5CLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL20</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL20</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN20</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL21</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL21</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN21</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL22</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL22</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN22</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL23</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL23</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN23</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON5SET</name>
          <description>C2FLTCON5SET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL20</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL20</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN20</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL21</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL21</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN21</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL22</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL22</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN22</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL23</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL23</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN23</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON5INV</name>
          <description>C2FLTCON5INV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL20</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL20</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN20</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL21</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL21</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN21</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL22</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL22</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN22</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL23</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL23</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN23</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON6</name>
          <description>C2FLTCON6 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL24</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL24</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN24</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL25</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL25</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN25</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL26</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL26</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN26</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL27</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL27</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN27</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON6CLR</name>
          <description>C2FLTCON6CLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL24</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL24</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN24</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL25</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL25</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN25</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL26</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL26</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN26</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL27</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL27</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN27</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON6SET</name>
          <description>C2FLTCON6SET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL24</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL24</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN24</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL25</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL25</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN25</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL26</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL26</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN26</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL27</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL27</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN27</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON6INV</name>
          <description>C2FLTCON6INV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL24</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL24</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN24</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL25</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL25</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN25</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL26</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL26</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN26</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL27</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL27</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN27</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON7</name>
          <description>C2FLTCON7 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON7CLR</name>
          <description>C2FLTCON7CLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FLTCON7SET</name>
          <description>C2FLTCON7SET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FSEL28</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MSEL28</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>FLTEN28</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FSEL29</name>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>MSEL29</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>FLTEN29</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>FSEL30</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>MSEL30</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>FLTEN30</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FSEL31</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>MSEL31</name>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>FLTEN31</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
