kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2RXF8INV</name>
          <description>C2RXF8INV register</description>
          <addressOffset>0x1cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9</name>
          <description>C2RXF9 register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9CLR</name>
          <description>C2RXF9CLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9SET</name>
          <description>C2RXF9SET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF9INV</name>
          <description>C2RXF9INV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10</name>
          <description>C2RXF10 register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10CLR</name>
          <description>C2RXF10CLR register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10SET</name>
          <description>C2RXF10SET register</description>
          <addressOffset>0x1e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF10INV</name>
          <description>C2RXF10INV register</description>
          <addressOffset>0x1ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF11</name>
          <description>C2RXF11 register</description>
          <addressOffset>0x1f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF11CLR</name>
          <description>C2RXF11CLR register</description>
          <addressOffset>0x1f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF11SET</name>
          <description>C2RXF11SET register</description>
          <addressOffset>0x1f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF11INV</name>
          <description>C2RXF11INV register</description>
          <addressOffset>0x1fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12</name>
          <description>C2RXF12 register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12CLR</name>
          <description>C2RXF12CLR register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12SET</name>
          <description>C2RXF12SET register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF12INV</name>
          <description>C2RXF12INV register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13</name>
          <description>C2RXF13 register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13CLR</name>
          <description>C2RXF13CLR register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13SET</name>
          <description>C2RXF13SET register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF13INV</name>
          <description>C2RXF13INV register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14</name>
          <description>C2RXF14 register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14CLR</name>
          <description>C2RXF14CLR register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14SET</name>
          <description>C2RXF14SET register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF14INV</name>
          <description>C2RXF14INV register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15</name>
          <description>C2RXF15 register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15CLR</name>
          <description>C2RXF15CLR register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15SET</name>
          <description>C2RXF15SET register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF15INV</name>
          <description>C2RXF15INV register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF16</name>
          <description>C2RXF16 register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF16CLR</name>
          <description>C2RXF16CLR register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF16SET</name>
          <description>C2RXF16SET register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF16INV</name>
          <description>C2RXF16INV register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF17</name>
          <description>C2RXF17 register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF17CLR</name>
          <description>C2RXF17CLR register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF17SET</name>
          <description>C2RXF17SET register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF17INV</name>
          <description>C2RXF17INV register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2RXF18</name>
          <description>C2RXF18 register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EID</name>
              <bitRange>[17:0]</bitRange>
            </field>
            <field>
              <name>EXID</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SID</name>
              <bitRange>[31:21]</bitRange>
            </field>
          </fields>
        </register>
