kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FIFOINT15CLR</name>
          <description>C2FIFOINT15CLR register</description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT15SET</name>
          <description>C2FIFOINT15SET register</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT15INV</name>
          <description>C2FIFOINT15INV register</description>
          <addressOffset>0x72c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA15</name>
          <description>C2FIFOUA15 register</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA15CLR</name>
          <description>C2FIFOUA15CLR register</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA15SET</name>
          <description>C2FIFOUA15SET register</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA15INV</name>
          <description>C2FIFOUA15INV register</description>
          <addressOffset>0x73c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI15</name>
          <description>C2FIFOCI15 register</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI15CLR</name>
          <description>C2FIFOCI15CLR register</description>
          <addressOffset>0x744</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI15SET</name>
          <description>C2FIFOCI15SET register</description>
          <addressOffset>0x748</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI15INV</name>
          <description>C2FIFOCI15INV register</description>
          <addressOffset>0x74c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON16</name>
          <description>C2FIFOCON16 register</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON16CLR</name>
          <description>C2FIFOCON16CLR register</description>
          <addressOffset>0x754</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON16SET</name>
          <description>C2FIFOCON16SET register</description>
          <addressOffset>0x758</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON16INV</name>
          <description>C2FIFOCON16INV register</description>
          <addressOffset>0x75c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT16</name>
          <description>C2FIFOINT16 register</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT16CLR</name>
          <description>C2FIFOINT16CLR register</description>
          <addressOffset>0x764</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT16SET</name>
          <description>C2FIFOINT16SET register</description>
          <addressOffset>0x768</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT16INV</name>
          <description>C2FIFOINT16INV register</description>
          <addressOffset>0x76c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA16</name>
          <description>C2FIFOUA16 register</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA16CLR</name>
          <description>C2FIFOUA16CLR register</description>
          <addressOffset>0x774</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
