kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FIFOCON22SET</name>
          <description>C2FIFOCON22SET register</description>
          <addressOffset>0x8d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON22INV</name>
          <description>C2FIFOCON22INV register</description>
          <addressOffset>0x8dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT22</name>
          <description>C2FIFOINT22 register</description>
          <addressOffset>0x8e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT22CLR</name>
          <description>C2FIFOINT22CLR register</description>
          <addressOffset>0x8e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT22SET</name>
          <description>C2FIFOINT22SET register</description>
          <addressOffset>0x8e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT22INV</name>
          <description>C2FIFOINT22INV register</description>
          <addressOffset>0x8ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA22</name>
          <description>C2FIFOUA22 register</description>
          <addressOffset>0x8f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA22CLR</name>
          <description>C2FIFOUA22CLR register</description>
          <addressOffset>0x8f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA22SET</name>
          <description>C2FIFOUA22SET register</description>
          <addressOffset>0x8f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA22INV</name>
          <description>C2FIFOUA22INV register</description>
          <addressOffset>0x8fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI22</name>
          <description>C2FIFOCI22 register</description>
          <addressOffset>0x900</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI22CLR</name>
          <description>C2FIFOCI22CLR register</description>
          <addressOffset>0x904</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI22SET</name>
          <description>C2FIFOCI22SET register</description>
          <addressOffset>0x908</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI22INV</name>
          <description>C2FIFOCI22INV register</description>
          <addressOffset>0x90c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON23</name>
          <description>C2FIFOCON23 register</description>
          <addressOffset>0x910</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON23CLR</name>
          <description>C2FIFOCON23CLR register</description>
          <addressOffset>0x914</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON23SET</name>
          <description>C2FIFOCON23SET register</description>
          <addressOffset>0x918</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON23INV</name>
          <description>C2FIFOCON23INV register</description>
          <addressOffset>0x91c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT23</name>
          <description>C2FIFOINT23 register</description>
          <addressOffset>0x920</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
