kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FIFOUA24SET</name>
          <description>C2FIFOUA24SET register</description>
          <addressOffset>0x978</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA24INV</name>
          <description>C2FIFOUA24INV register</description>
          <addressOffset>0x97c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI24</name>
          <description>C2FIFOCI24 register</description>
          <addressOffset>0x980</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI24CLR</name>
          <description>C2FIFOCI24CLR register</description>
          <addressOffset>0x984</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI24SET</name>
          <description>C2FIFOCI24SET register</description>
          <addressOffset>0x988</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI24INV</name>
          <description>C2FIFOCI24INV register</description>
          <addressOffset>0x98c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON25</name>
          <description>C2FIFOCON25 register</description>
          <addressOffset>0x990</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON25CLR</name>
          <description>C2FIFOCON25CLR register</description>
          <addressOffset>0x994</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON25SET</name>
          <description>C2FIFOCON25SET register</description>
          <addressOffset>0x998</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON25INV</name>
          <description>C2FIFOCON25INV register</description>
          <addressOffset>0x99c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT25</name>
          <description>C2FIFOINT25 register</description>
          <addressOffset>0x9a0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT25CLR</name>
          <description>C2FIFOINT25CLR register</description>
          <addressOffset>0x9a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT25SET</name>
          <description>C2FIFOINT25SET register</description>
          <addressOffset>0x9a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT25INV</name>
          <description>C2FIFOINT25INV register</description>
          <addressOffset>0x9ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA25</name>
          <description>C2FIFOUA25 register</description>
          <addressOffset>0x9b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA25CLR</name>
          <description>C2FIFOUA25CLR register</description>
          <addressOffset>0x9b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA25SET</name>
          <description>C2FIFOUA25SET register</description>
          <addressOffset>0x9b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA25INV</name>
          <description>C2FIFOUA25INV register</description>
          <addressOffset>0x9bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI25</name>
          <description>C2FIFOCI25 register</description>
          <addressOffset>0x9c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI25CLR</name>
          <description>C2FIFOCI25CLR register</description>
          <addressOffset>0x9c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI25SET</name>
          <description>C2FIFOCI25SET register</description>
          <addressOffset>0x9c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI25INV</name>
          <description>C2FIFOCI25INV register</description>
          <addressOffset>0x9cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON26</name>
          <description>C2FIFOCON26 register</description>
          <addressOffset>0x9d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON26CLR</name>
          <description>C2FIFOCON26CLR register</description>
          <addressOffset>0x9d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
