kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>C2FIFOCON26SET</name>
          <description>C2FIFOCON26SET register</description>
          <addressOffset>0x9d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON26INV</name>
          <description>C2FIFOCON26INV register</description>
          <addressOffset>0x9dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT26</name>
          <description>C2FIFOINT26 register</description>
          <addressOffset>0x9e0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT26CLR</name>
          <description>C2FIFOINT26CLR register</description>
          <addressOffset>0x9e4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT26SET</name>
          <description>C2FIFOINT26SET register</description>
          <addressOffset>0x9e8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT26INV</name>
          <description>C2FIFOINT26INV register</description>
          <addressOffset>0x9ec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA26</name>
          <description>C2FIFOUA26 register</description>
          <addressOffset>0x9f0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA26CLR</name>
          <description>C2FIFOUA26CLR register</description>
          <addressOffset>0x9f4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA26SET</name>
          <description>C2FIFOUA26SET register</description>
          <addressOffset>0x9f8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOUA26INV</name>
          <description>C2FIFOUA26INV register</description>
          <addressOffset>0x9fc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FIFOUA</name>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI26</name>
          <description>C2FIFOCI26 register</description>
          <addressOffset>0xa00</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI26CLR</name>
          <description>C2FIFOCI26CLR register</description>
          <addressOffset>0xa04</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI26SET</name>
          <description>C2FIFOCI26SET register</description>
          <addressOffset>0xa08</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCI26INV</name>
          <description>C2FIFOCI26INV register</description>
          <addressOffset>0xa0c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CFIFOCI</name>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON27</name>
          <description>C2FIFOCON27 register</description>
          <addressOffset>0xa10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON27CLR</name>
          <description>C2FIFOCON27CLR register</description>
          <addressOffset>0xa14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON27SET</name>
          <description>C2FIFOCON27SET register</description>
          <addressOffset>0xa18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOCON27INV</name>
          <description>C2FIFOCON27INV register</description>
          <addressOffset>0xa1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXPRI</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>RTREN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXREQ</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXERR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TXLARB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXABAT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONLY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UINC</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FSIZE</name>
              <bitRange>[20:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>C2FIFOINT27</name>
          <description>C2FIFOINT27 register</description>
          <addressOffset>0xa20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXNEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXHALFIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXOVFLIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXHALFIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXNFULLIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RXNEMPTYIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXHALFIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RXOVFLIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TXHALFIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TXNFULLIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
