kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ETHRXFCSET</name>
          <description>ETHRXFCSET register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BCEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTMEEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RUNTEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RUNTERREN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCOKEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCERREN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PMMODE</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>NOTPM</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>MPEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HTEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXFCINV</name>
          <description>ETHRXFCINV register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BCEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MCEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTMEEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UCEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RUNTEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RUNTERREN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCOKEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CRCERREN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PMMODE</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>NOTPM</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>MPEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HTEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXWM</name>
          <description>ETHRXWM register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXEWM</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RXFWM</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXWMCLR</name>
          <description>ETHRXWMCLR register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXEWM</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RXFWM</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXWMSET</name>
          <description>ETHRXWMSET register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXEWM</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RXFWM</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHRXWMINV</name>
          <description>ETHRXWMINV register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXEWM</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>RXFWM</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIEN</name>
          <description>ETHIEN register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNAIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORTIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACTIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPENDIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARKIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARKIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSEIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSEIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIENCLR</name>
          <description>ETHIENCLR register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNAIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORTIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACTIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPENDIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARKIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARKIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSEIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSEIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIENSET</name>
          <description>ETHIENSET register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNAIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORTIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACTIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPENDIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARKIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARKIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSEIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSEIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIENINV</name>
          <description>ETHIENINV register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNAIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORTIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONEIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACTIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPENDIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARKIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARKIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSEIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSEIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIRQ</name>
          <description>ETHIRQ register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLW</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNA</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPEND</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARK</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARK</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIRQCLR</name>
          <description>ETHIRQCLR register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLW</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNA</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPEND</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARK</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARK</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIRQSET</name>
          <description>ETHIRQSET register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLW</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNA</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPEND</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARK</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARK</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHIRQINV</name>
          <description>ETHIRQINV register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLW</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXBUFNA</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXABORT</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXDONE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXACT</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PKTPEND</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RXDONE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FWMARK</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EWMARK</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RXBUSE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TXBUSE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSTAT</name>
          <description>ETHSTAT register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BUFCNT</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSTATCLR</name>
          <description>ETHSTATCLR register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BUFCNT</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSTATSET</name>
          <description>ETHSTATSET register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BUFCNT</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSTATINV</name>
          <description>ETHSTATINV register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUSY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BUFCNT</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOVFLOW</name>
          <description>RXOVFLOW register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOVFLOWCLR</name>
          <description>RXOVFLOWCLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOVFLOWSET</name>
          <description>RXOVFLOWSET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXOVFLOWINV</name>
          <description>RXOVFLOWINV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXOVFLWCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMTXOK</name>
          <description>ETHFRMTXOK register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMTXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMTXOKCLR</name>
          <description>ETHFRMTXOKCLR register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMTXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMTXOKSET</name>
          <description>ETHFRMTXOKSET register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMTXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
