kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>ETHFRMTXOKINV</name>
          <description>ETHFRMTXOKINV register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMTXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSCOLFRM</name>
          <description>ETHSCOLFRM register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSCOLFRMCLR</name>
          <description>ETHSCOLFRMCLR register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSCOLFRMSET</name>
          <description>ETHSCOLFRMSET register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHSCOLFRMINV</name>
          <description>ETHSCOLFRMINV register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHMCOLFRM</name>
          <description>ETHMCOLFRM register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHMCOLFRMCLR</name>
          <description>ETHMCOLFRMCLR register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHMCOLFRMSET</name>
          <description>ETHMCOLFRMSET register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHMCOLFRMINV</name>
          <description>ETHMCOLFRMINV register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MCOLFRMCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMRXOK</name>
          <description>ETHFRMRXOK register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMRXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMRXOKCLR</name>
          <description>ETHFRMRXOKCLR register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMRXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMRXOKSET</name>
          <description>ETHFRMRXOKSET register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMRXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFRMRXOKINV</name>
          <description>ETHFRMRXOKINV register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRMRXOKCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFCSERR</name>
          <description>ETHFCSERR register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCSERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFCSERRCLR</name>
          <description>ETHFCSERRCLR register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCSERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFCSERRSET</name>
          <description>ETHFCSERRSET register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCSERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHFCSERRINV</name>
          <description>ETHFCSERRINV register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FCSERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHALGNERR</name>
          <description>ETHALGNERR register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALGNERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHALGNERRCLR</name>
          <description>ETHALGNERRCLR register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALGNERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHALGNERRSET</name>
          <description>ETHALGNERRSET register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALGNERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETHALGNERRINV</name>
          <description>ETHALGNERRINV register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ALGNERRCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG1</name>
          <description>EMAC1CFG1 register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>32781</resetValue>
          <fields>
            <field>
              <name>RXENABLE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PASSALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXPAUSE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXPAUSE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LOOPBACK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESETTFUN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETTMCS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESETRFUN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RESETRMCS</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIMRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SOFTRESET</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG1CLR</name>
          <description>EMAC1CFG1CLR register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXENABLE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PASSALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXPAUSE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXPAUSE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LOOPBACK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESETTFUN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETTMCS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESETRFUN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RESETRMCS</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIMRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SOFTRESET</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG1SET</name>
          <description>EMAC1CFG1SET register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXENABLE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PASSALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXPAUSE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXPAUSE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LOOPBACK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESETTFUN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETTMCS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESETRFUN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RESETRMCS</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIMRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SOFTRESET</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG1INV</name>
          <description>EMAC1CFG1INV register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXENABLE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PASSALL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RXPAUSE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TXPAUSE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LOOPBACK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESETTFUN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETTMCS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESETRFUN</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RESETRMCS</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SIMRESET</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SOFTRESET</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG2</name>
          <description>EMAC1CFG2 register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <resetValue>16564</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG2CLR</name>
          <description>EMAC1CFG2CLR register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG2SET</name>
          <description>EMAC1CFG2SET register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CFG2INV</name>
          <description>EMAC1CFG2INV register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FULLDPLX</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LENGTHCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HUGEFRM</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DELAYCRC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CRCENABLE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PADENABLE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VLANPAD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUTOPAD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PUREPRE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LONGPRE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NOBKOFF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BPNOBKOFF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EXCESSDFR</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGT</name>
          <description>EMAC1IPGT register</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <resetValue>18</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTCLR</name>
          <description>EMAC1IPGTCLR register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTSET</name>
          <description>EMAC1IPGTSET register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGTINV</name>
          <description>EMAC1IPGTINV register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>B2BIPKTGP</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
