kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>EMAC1IPGR</name>
          <description>EMAC1IPGR register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <resetValue>3090</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRCLR</name>
          <description>EMAC1IPGRCLR register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRSET</name>
          <description>EMAC1IPGRSET register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1IPGRINV</name>
          <description>EMAC1IPGRINV register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NB2BIPKTGP2</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>NB2BIPKTGP1</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRT</name>
          <description>EMAC1CLRT register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <resetValue>14095</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTCLR</name>
          <description>EMAC1CLRTCLR register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTSET</name>
          <description>EMAC1CLRTSET register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1CLRTINV</name>
          <description>EMAC1CLRTINV register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RETX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CWINDOW</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXF</name>
          <description>EMAC1MAXF register</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <resetValue>1518</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFCLR</name>
          <description>EMAC1MAXFCLR register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFSET</name>
          <description>EMAC1MAXFSET register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MAXFINV</name>
          <description>EMAC1MAXFINV register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MACMAXF</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPP</name>
          <description>EMAC1SUPP register</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <resetValue>4096</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPCLR</name>
          <description>EMAC1SUPPCLR register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPSET</name>
          <description>EMAC1SUPPSET register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SUPPINV</name>
          <description>EMAC1SUPPINV register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SPEEDRMII</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RESETRMII</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TEST</name>
          <description>EMAC1TEST register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTCLR</name>
          <description>EMAC1TESTCLR register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTSET</name>
          <description>EMAC1TESTSET register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1TESTINV</name>
          <description>EMAC1TESTINV register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SHRTQNTA</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TESTPAUSE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TESTBP</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFG</name>
          <description>EMAC1MCFG register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGCLR</name>
          <description>EMAC1MCFGCLR register</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGSET</name>
          <description>EMAC1MCFGSET register</description>
          <addressOffset>0x288</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCFGINV</name>
          <description>EMAC1MCFGINV register</description>
          <addressOffset>0x28c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SCANINC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>NOPRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKSEL</name>
              <bitRange>[5:2]</bitRange>
            </field>
            <field>
              <name>RESETMGMT</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMD</name>
          <description>EMAC1MCMD register</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDCLR</name>
          <description>EMAC1MCMDCLR register</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDSET</name>
          <description>EMAC1MCMDSET register</description>
          <addressOffset>0x298</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MCMDINV</name>
          <description>EMAC1MCMDINV register</description>
          <addressOffset>0x29c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADR</name>
          <description>EMAC1MADR register</description>
          <addressOffset>0x2a0</addressOffset>
          <size>32</size>
          <resetValue>256</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRCLR</name>
          <description>EMAC1MADRCLR register</description>
          <addressOffset>0x2a4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRSET</name>
          <description>EMAC1MADRSET register</description>
          <addressOffset>0x2a8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MADRINV</name>
          <description>EMAC1MADRINV register</description>
          <addressOffset>0x2ac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REGADDR</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>PHYADDR</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTD</name>
          <description>EMAC1MWTD register</description>
          <addressOffset>0x2b0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTDCLR</name>
          <description>EMAC1MWTDCLR register</description>
          <addressOffset>0x2b4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTDSET</name>
          <description>EMAC1MWTDSET register</description>
          <addressOffset>0x2b8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MWTDINV</name>
          <description>EMAC1MWTDINV register</description>
          <addressOffset>0x2bc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MWTD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDD</name>
          <description>EMAC1MRDD register</description>
          <addressOffset>0x2c0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDCLR</name>
          <description>EMAC1MRDDCLR register</description>
          <addressOffset>0x2c4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDSET</name>
          <description>EMAC1MRDDSET register</description>
          <addressOffset>0x2c8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MRDDINV</name>
          <description>EMAC1MRDDINV register</description>
          <addressOffset>0x2cc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MRDD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MIND</name>
          <description>EMAC1MIND register</description>
          <addressOffset>0x2d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDCLR</name>
          <description>EMAC1MINDCLR register</description>
          <addressOffset>0x2d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDSET</name>
          <description>EMAC1MINDSET register</description>
          <addressOffset>0x2d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1MINDINV</name>
          <description>EMAC1MINDINV register</description>
          <addressOffset>0x2dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>MIIMBUSY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SCAN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NOTVALID</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LINKFAIL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
