kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>EMAC1SA0</name>
          <description>EMAC1SA0 register</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0CLR</name>
          <description>EMAC1SA0CLR register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0SET</name>
          <description>EMAC1SA0SET register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA0INV</name>
          <description>EMAC1SA0INV register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR5</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR6</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1</name>
          <description>EMAC1SA1 register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1CLR</name>
          <description>EMAC1SA1CLR register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1SET</name>
          <description>EMAC1SA1SET register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA1INV</name>
          <description>EMAC1SA1INV register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR3</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR4</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2</name>
          <description>EMAC1SA2 register</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2CLR</name>
          <description>EMAC1SA2CLR register</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2SET</name>
          <description>EMAC1SA2SET register</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EMAC1SA2INV</name>
          <description>EMAC1SA2INV register</description>
          <addressOffset>0x32c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STNADDR1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>STNADDR2</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
