kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USBCRCON</name>
      <description>USBCRCON peripheral</description>
      <baseAddress>0xbf884000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USBCRCON</name>
          <description>USBCRCON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>USBWKUPEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USBRIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USBIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SENDMONEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BSVALMONEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ASVALMONEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VBUSMONEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PHYIDEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USBIDVAL</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USBIDOVEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USBWKUP</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>USBRF</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>USBIF</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PCACHE</name>
      <description>PCACHE peripheral</description>
      <baseAddress>0xbf8e0000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PRECON</name>
          <description>PRECON register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>7</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PFMSECEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECONCLR</name>
          <description>PRECONCLR register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PFMSECEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECONSET</name>
          <description>PRECONSET register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PFMSECEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECONINV</name>
          <description>PRECONINV register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMWS</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PREFEN</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PFMSECEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESTAT</name>
          <description>PRESTAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMSECCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PFMSEC</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PFMDED</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESTATCLR</name>
          <description>PRESTATCLR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMSECCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PFMSEC</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PFMDED</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESTATSET</name>
          <description>PRESTATSET register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMSECCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PFMSEC</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PFMDED</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRESTATINV</name>
          <description>PRESTATINV register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PFMSECCNT</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>PFMSEC</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PFMDED</name>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
