kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EBI</name>
      <description>EBI peripheral</description>
      <baseAddress>0xbf8e1014</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa0</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EBICS0</name>
          <description>EBICS0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSADDR</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBICS1</name>
          <description>EBICS1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSADDR</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBICS2</name>
          <description>EBICS2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSADDR</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBICS3</name>
          <description>EBICS3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSADDR</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBIMSK0</name>
          <description>EBIMSK0 register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>MEMSIZE</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MEMTYPE</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>REGSEL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBIMSK1</name>
          <description>EBIMSK1 register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>MEMSIZE</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MEMTYPE</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>REGSEL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBIMSK2</name>
          <description>EBIMSK2 register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>MEMSIZE</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MEMTYPE</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>REGSEL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBIMSK3</name>
          <description>EBIMSK3 register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>32</resetValue>
          <fields>
            <field>
              <name>MEMSIZE</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>MEMTYPE</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>REGSEL</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBISMT0</name>
          <description>EBISMT0 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>69480780</resetValue>
          <fields>
            <field>
              <name>TRC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TAS</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TWR</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWP</name>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>TBTA</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>TPRC</name>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>PAGEMODE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>PAGESIZE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>RDYMODE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBISMT1</name>
          <description>EBISMT1 register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>69480780</resetValue>
          <fields>
            <field>
              <name>TRC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TAS</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TWR</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWP</name>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>TBTA</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>TPRC</name>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>PAGEMODE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>PAGESIZE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>RDYMODE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBISMT2</name>
          <description>EBISMT2 register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>69480780</resetValue>
          <fields>
            <field>
              <name>TRC</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TAS</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TWR</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>TWP</name>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>TBTA</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>TPRC</name>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>PAGEMODE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>PAGESIZE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>RDYMODE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBIFTRPD</name>
          <description>EBIFTRPD register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>513</resetValue>
          <fields>
            <field>
              <name>TRPD</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EBISMCON</name>
          <description>EBISMCON register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>513</resetValue>
          <fields>
            <field>
              <name>SMRP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SMDWIDTH0</name>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>SMDWIDTH1</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>SMDWIDTH2</name>
              <bitRange>[15:13]</bitRange>
            </field>
          </fields>
        </register>
