kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SQI1</name>
      <description>SQI1 peripheral</description>
      <baseAddress>0xbf8e2000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SQI1XCON1</name>
          <description>SQI1XCON1 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>2886656</resetValue>
          <fields>
            <field>
              <name>TYPECMD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TYPEADDR</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>TYPEMODE</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TYPEDUMMY</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>TYPEDATA</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>READOPCODE</name>
              <bitRange>[17:10]</bitRange>
            </field>
            <field>
              <name>ADDRBYTES</name>
              <bitRange>[20:18]</bitRange>
            </field>
            <field>
              <name>DUMMYBYTES</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>DDRCMD</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DDRADDR</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DDRMODE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DDRDUMMY</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DDRDATA</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SDRCMD</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1XCON2</name>
          <description>SQI1XCON2 register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>160</resetValue>
          <fields>
            <field>
              <name>MODECODE</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>MODEBYTES</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DEVSEL</name>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1CFG</name>
          <description>SQI1CFG register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>32768</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>CPHA</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LSBF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HOLD</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BURSTEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RESET</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TXBUFRST</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RXBUFRST</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CONBUFRST</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DATAEN</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SQIEN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CSEN</name>
              <bitRange>[25:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1CON</name>
          <description>SQI1CON register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXRXCOUNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CMDINIT</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LANEMODE</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>DEVSEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>DASSERT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DDRMODE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SCHECK</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1CLKCON</name>
          <description>SQI1CLKCON register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>STABLE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLKDIV</name>
              <bitRange>[18:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1CMDTHR</name>
          <description>SQI1CMDTHR register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCMDTHR</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TXCMDTHR</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1INTTHR</name>
          <description>SQI1INTTHR register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXINTTHR</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TXINTTHR</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1INTEN</name>
          <description>SQI1INTEN register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXEMPTYIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXFULLIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXTHRIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXEMPTYIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFULLIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXTHRIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CONFULLIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CONEMPTYIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CONTHRIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BDDONEIE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PKTCOMPIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEIE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1INTSTAT</name>
          <description>SQI1INTSTAT register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>173</resetValue>
          <fields>
            <field>
              <name>TXEMPTYIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXFULLIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXTHRIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXEMPTYIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFULLIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXTHRIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CONFULLIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CONEMPTYIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CONTHRIF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BDDONEIF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PKTCOMPIF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEIF</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1TXDATA</name>
          <description>SQI1TXDATA register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1RXDATA</name>
          <description>SQI1RXDATA register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXDATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1STAT1</name>
          <description>SQI1STAT1 register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXBUFCNT</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>TXBUFFREE</name>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1STAT2</name>
          <description>SQI1STAT2 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXOV</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RXUN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SQID0</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SQID1</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SQID2</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SQID3</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CONAVAIL</name>
              <bitRange>[10:7]</bitRange>
            </field>
            <field>
              <name>CMDSTAT</name>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDCON</name>
          <description>SQI1BDCON register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>POLLEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>START</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDCURADD</name>
          <description>SQI1BDCURADD register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDCURRADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDBASEADD</name>
          <description>SQI1BDBASEADD register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDSTAT</name>
          <description>SQI1BDSTAT register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDCON</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>DMAACTV</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMASTART</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BDSTATE</name>
              <bitRange>[21:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDPOLLCON</name>
          <description>SQI1BDPOLLCON register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>POLLCON</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDTXDSTAT</name>
          <description>SQI1BDTXDSTAT register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXCURBUFLEN</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>TXBUFCNT</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TXSTATE</name>
              <bitRange>[28:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1BDRXDSTAT</name>
          <description>SQI1BDRXDSTAT register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCURBUFLEN</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>RXBUFCNT</name>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RXSTATE</name>
              <bitRange>[28:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1THR</name>
          <description>SQI1THR register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>THRES</name>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1INTSIGEN</name>
          <description>SQI1INTSIGEN register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXEMPTYISE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TXFULLISE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TXTHRISE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RXEMPTYISE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RXFULLISE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXTHRISE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CONFULLISE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CONEMPTYISE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CONTHRISE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BDDONEISE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PKTCOMPISE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEISE</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1TAPCON</name>
          <description>SQI1TAPCON register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLKOUTDLY</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DATAOUTDLY</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>SDRCLKINDLY</name>
              <bitRange>[13:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1MEMSTAT</name>
          <description>SQI1MEMSTAT register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>STATCMD</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>STATBYTES</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>STATTYPE</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>STATPOS</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1XCON3</name>
          <description>SQI1XCON3 register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INIT1CMD1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>INIT1CMD2</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>INIT1CMD3</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>INIT1TYPE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INIT1COUNT</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>INIT1SCHECK</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SQI1XCON4</name>
          <description>SQI1XCON4 register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>INIT2CMD1</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>INIT2CMD2</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>INIT2CMD3</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>INIT2TYPE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>INIT2COUNT</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>INIT2SCHECK</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
