kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>USB peripheral</description>
      <baseAddress>0xbf8e3000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x374</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>USBCSR0</name>
          <description>USBCSR0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>512</resetValue>
          <fields>
            <field>
              <name>FUNC</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SUSPEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SUSPMODE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RESUME</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RESET</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>HSMODE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>HSEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SOFTCONN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ISOUPD</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EP0IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EP1TXIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EP2TXIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EP3TXIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EP4TXIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EP5TXIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EP6TXIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EP7TXIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCSR1</name>
          <description>USBCSR1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>255</resetValue>
          <fields>
            <field>
              <name>EP1RXIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EP2RXIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EP3RXIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EP4RXIF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EP5RXIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EP6RXIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EP7RXIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EP0IE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EP1TXIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EP2TXIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EP3TXIE</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EP4TXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EP5TXIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EP6TXIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EP7TXIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCSR2</name>
          <description>USBCSR2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>100663550</resetValue>
          <fields>
            <field>
              <name>EP1RXIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EP2RXIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EP3RXIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EP4RXIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EP5RXIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EP6RXIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EP7RXIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SUSPIF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RESUMEIF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RESETIF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SOFIF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CONNIF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DISCONIF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SESSRQIF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VBUSERRIF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SUSPIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RESUMEIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>RESETIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SOFIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CONNIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DISCONIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SESSRQIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>VBUSERRIE</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBCSR3</name>
          <description>USBCSR3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RFRMNUM</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>ENDPOINT</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>NAK</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TESTJ</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TESTK</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PACKET</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>FORCEHS</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>FORCEFS</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>FIFOACC</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>FORCEHST</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBIENCSR1</name>
          <description>USBIENCSR1 register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO0</name>
          <description>USBFIFO0 register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO1</name>
          <description>USBFIFO1 register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO2</name>
          <description>USBFIFO2 register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO3</name>
          <description>USBFIFO3 register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO4</name>
          <description>USBFIFO4 register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO5</name>
          <description>USBFIFO5 register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO6</name>
          <description>USBFIFO6 register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFO7</name>
          <description>USBFIFO7 register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBOTG</name>
          <description>USBOTG register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>128</resetValue>
          <fields>
            <field>
              <name>SESSION</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HOSTREQ</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HOSTMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VBUS</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>LSDEV</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FSDEV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BDEV</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RXEDMA</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TXEDMA</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TXDPB</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXDPB</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBFIFOA</name>
          <description>USBFIFOA register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFIFOAD</name>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>RXFIFOAD</name>
              <bitRange>[28:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBHWVER</name>
          <description>USBHWVER register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VERMINOR</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>VERMAJOR</name>
              <bitRange>[14:10]</bitRange>
            </field>
            <field>
              <name>RC</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBINFO</name>
          <description>USBINFO register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>1012698231</resetValue>
          <fields>
            <field>
              <name>TXENDPTS</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>RXENDPTS</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>RAMBITS</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DMACHANS</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>WTID</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>WTCON</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>VPLEN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBEOFRST</name>
          <description>USBEOFRST register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>7501696</resetValue>
          <fields>
            <field>
              <name>HSEOF</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>FSEOF</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>LSEOF</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>NRST</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NRSTX</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE0TXA</name>
          <description>USBE0TXA register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE0RXA</name>
          <description>USBE0RXA register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1TXA</name>
          <description>USBE1TXA register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1RXA</name>
          <description>USBE1RXA register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2TXA</name>
          <description>USBE2TXA register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2RXA</name>
          <description>USBE2RXA register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
