kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>USBE3TXA</name>
          <description>USBE3TXA register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3RXA</name>
          <description>USBE3RXA register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4TXA</name>
          <description>USBE4TXA register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4RXA</name>
          <description>USBE4RXA register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5TXA</name>
          <description>USBE5TXA register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5RXA</name>
          <description>USBE5RXA register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6TXA</name>
          <description>USBE6TXA register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6RXA</name>
          <description>USBE6RXA register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7TXA</name>
          <description>USBE7TXA register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>TXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7RXA</name>
          <description>USBE7RXA register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXFADDR</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>RXHUBADD</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>MULTTRAN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RXHUBPRT</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE0CSR0</name>
          <description>USBE0CSR0 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>RXRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TXRDY</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>STALLED</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SETUP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>STATUS</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTO</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DT</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DTWE</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE0CSR2</name>
          <description>USBE0CSR2 register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>NAKLIM</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE0CSR3</name>
          <description>USBE0CSR3 register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>UTMIDWID</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SOFTCONE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DYNFIFOS</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>HBTXEN</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>HBRXEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>BIGEND</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>MPTXEN</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>MPRXEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1CSR0</name>
          <description>USBE1CSR0 register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1CSR1</name>
          <description>USBE1CSR1 register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1CSR2</name>
          <description>USBE1CSR2 register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1CSR3</name>
          <description>USBE1CSR3 register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2CSR0</name>
          <description>USBE2CSR0 register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2CSR1</name>
          <description>USBE2CSR1 register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2CSR2</name>
          <description>USBE2CSR2 register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
