kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>USBE2CSR3</name>
          <description>USBE2CSR3 register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3CSR0</name>
          <description>USBE3CSR0 register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3CSR1</name>
          <description>USBE3CSR1 register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3CSR2</name>
          <description>USBE3CSR2 register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3CSR3</name>
          <description>USBE3CSR3 register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4CSR0</name>
          <description>USBE4CSR0 register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4CSR1</name>
          <description>USBE4CSR1 register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4CSR2</name>
          <description>USBE4CSR2 register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4CSR3</name>
          <description>USBE4CSR3 register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5CSR0</name>
          <description>USBE5CSR0 register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5CSR1</name>
          <description>USBE5CSR1 register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5CSR2</name>
          <description>USBE5CSR2 register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5CSR3</name>
          <description>USBE5CSR3 register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6CSR0</name>
          <description>USBE6CSR0 register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
