kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>USBE6CSR1</name>
          <description>USBE6CSR1 register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6CSR2</name>
          <description>USBE6CSR2 register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6CSR3</name>
          <description>USBE6CSR3 register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7CSR0</name>
          <description>USBE7CSR0 register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFONE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETUPPKT</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NAKTMOUT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DTWREN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>FRCDATTG</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTOSET</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7CSR1</name>
          <description>USBE7CSR1 register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXMAXP</name>
              <bitRange>[10:0]</bitRange>
            </field>
            <field>
              <name>MULT</name>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>RXPKTRDY</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>FIFOFULL</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ERROR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DERRNAKT</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>FLUSH</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>REQPKT</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RXSTALL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRDT</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>INCOMPRX</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATATGGL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>DATATWEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DMAREQMD</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PIDERR</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DMAREQEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>AUTORQ</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>AUTOCLR</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7CSR2</name>
          <description>USBE7CSR2 register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RXCNT</name>
              <bitRange>[13:0]</bitRange>
            </field>
            <field>
              <name>TEP</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>TXINTERV</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7CSR3</name>
          <description>USBE7CSR3 register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TEP</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SPEED</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>RXINTERV</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TXFIFOSZ</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>RXFIFOSZ</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMAINT</name>
          <description>USBDMAINT register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMA1IF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMA2IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMA3IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMA4IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMA5IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DMA6IF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMA7IF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMA8IF</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA1C</name>
          <description>USBDMA1C register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA1A</name>
          <description>USBDMA1A register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA1N</name>
          <description>USBDMA1N register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA2C</name>
          <description>USBDMA2C register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA2A</name>
          <description>USBDMA2A register</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA2N</name>
          <description>USBDMA2N register</description>
          <addressOffset>0x21c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA3C</name>
          <description>USBDMA3C register</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA3A</name>
          <description>USBDMA3A register</description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA3N</name>
          <description>USBDMA3N register</description>
          <addressOffset>0x22c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA4C</name>
          <description>USBDMA4C register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA4A</name>
          <description>USBDMA4A register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA4N</name>
          <description>USBDMA4N register</description>
          <addressOffset>0x23c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA5C</name>
          <description>USBDMA5C register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA5A</name>
          <description>USBDMA5A register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA5N</name>
          <description>USBDMA5N register</description>
          <addressOffset>0x24c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA6C</name>
          <description>USBDMA6C register</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA6A</name>
          <description>USBDMA6A register</description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA6N</name>
          <description>USBDMA6N register</description>
          <addressOffset>0x25c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
