kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>USBDMA7C</name>
          <description>USBDMA7C register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA7A</name>
          <description>USBDMA7A register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA7N</name>
          <description>USBDMA7N register</description>
          <addressOffset>0x26c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA8C</name>
          <description>USBDMA8C register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DMADIR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DMAMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DMAIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DMAEP</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DMAERR</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DMABRSTM</name>
              <bitRange>[10:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA8A</name>
          <description>USBDMA8A register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDMA8N</name>
          <description>USBDMA8N register</description>
          <addressOffset>0x27c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMACOUNT</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE1RPC</name>
          <description>USBE1RPC register</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE2RPC</name>
          <description>USBE2RPC register</description>
          <addressOffset>0x308</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE3RPC</name>
          <description>USBE3RPC register</description>
          <addressOffset>0x30c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE4RPC</name>
          <description>USBE4RPC register</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE5RPC</name>
          <description>USBE5RPC register</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE6RPC</name>
          <description>USBE6RPC register</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBE7RPC</name>
          <description>USBE7RPC register</description>
          <addressOffset>0x31c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RQPKTCNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBDPBFD</name>
          <description>USBDPBFD register</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>EP1RXD</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EP2RXD</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EP3RXD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EP4RXD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EP5RXD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EP6RXD</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EP7RXD</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EP1TXD</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EP2TXD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EP3TXD</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EP4TXD</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EP5TXD</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EP6TXD</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EP7TXD</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTMCON1</name>
          <description>USBTMCON1 register</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TUCH</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>THHSRTN</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBTMCON2</name>
          <description>USBTMCON2 register</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>THSBT</name>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBLPMR1</name>
          <description>USBLPMR1 register</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LNKSTATE</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>HIRD</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>RMTWAK</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ENDPOINT</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>LPMXMT</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LPMRES</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>LPMEN</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>LPMNAK</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>LPMTOIE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>LPMSTIE</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>LPMNYIE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>LPMACKIE</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>LPMRESIE</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LPMERRIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USBLPMR2</name>
          <description>USBLPMR2 register</description>
          <addressOffset>0x364</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>LPMST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPMNY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LPMACK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LPMNC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LPMRES</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPMERR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LPMFADDR</name>
              <bitRange>[14:8]</bitRange>
            </field>
          </fields>
        </register>
