kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTO</name>
      <description>CRYPTO peripheral</description>
      <baseAddress>0xbf8e5000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x34</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CEVER</name>
          <description>CEVER register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ID</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>VERSION</name>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>REVISION</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CECON</name>
          <description>CECON register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BDPPLEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BDPCHST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWAPEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SWRST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWAPOEN</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEBDADDR</name>
          <description>CEBDADDR register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDPADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEBDPADDR</name>
          <description>CEBDPADDR register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BASEADDR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CESTAT</name>
          <description>CESTAT register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDCTRL</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>START</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BDSTATE</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>ERRPHASE</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>ERROP</name>
              <bitRange>[28:26]</bitRange>
            </field>
            <field>
              <name>ERRMODE</name>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEINTSRC</name>
          <description>CEINTSRC register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PENDIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBDIF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PKTIF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AREIF</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEINTEN</name>
          <description>CEINTEN register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PENDIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBDIE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PKTIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AREIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEPOLLCON</name>
          <description>CEPOLLCON register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>BDPPLCON</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CEHDLEN</name>
          <description>CEHDLEN register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>HDRLEN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CETRLLEN</name>
          <description>CETRLLEN register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>TRLRLEN</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
