kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RNG</name>
      <description>RNG peripheral</description>
      <baseAddress>0xbf8e6000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RNGVER</name>
          <description>RNGVER register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>VERSION</name>
              <bitRange>[15:7]</bitRange>
            </field>
            <field>
              <name>ID</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGCON</name>
          <description>RNGCON register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>64</resetValue>
          <fields>
            <field>
              <name>PLEN</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>TRNGEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PRNGEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CONT</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRNGMODE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LOAD</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGPOLY1</name>
          <description>RNGPOLY1 register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>4294901760</resetValue>
          <fields>
            <field>
              <name>POLY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGPOLY2</name>
          <description>RNGPOLY2 register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>4294901760</resetValue>
          <fields>
            <field>
              <name>POLY</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGNUMGEN1</name>
          <description>RNGNUMGEN1 register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>4294967295</resetValue>
          <fields>
            <field>
              <name>RNG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGNUMGEN2</name>
          <description>RNGNUMGEN2 register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>4294967295</resetValue>
          <fields>
            <field>
              <name>RNG</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGSEED1</name>
          <description>RNGSEED1 register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEED</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGSEED2</name>
          <description>RNGSEED2 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SEED</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGCNT</name>
          <description>RNGCNT register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>RCNT</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SB</name>
      <description>SB peripheral</description>
      <baseAddress>0xbf8f0510</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xaf58</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SBFLAG</name>
          <description>SBFLAG register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>T0PGV</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>T1PGV</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>T2PGV</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>T3PGV</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>T4PGV</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>T5PGV</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>T6PGV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>T7PGV</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>T8PGV</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>T9PGV</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>T10PGV</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>T11PGV</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>T12PGV</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>T13PGV</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0ELOG1</name>
          <description>SBT0ELOG1 register</description>
          <addressOffset>0x7b10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0ELOG2</name>
          <description>SBT0ELOG2 register</description>
          <addressOffset>0x7b14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0ECON</name>
          <description>SBT0ECON register</description>
          <addressOffset>0x7b18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0ECLRS</name>
          <description>SBT0ECLRS register</description>
          <addressOffset>0x7b20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0ECLRM</name>
          <description>SBT0ECLRM register</description>
          <addressOffset>0x7b28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0REG0</name>
          <description>SBT0REG0 register</description>
          <addressOffset>0x7b30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0RD0</name>
          <description>SBT0RD0 register</description>
          <addressOffset>0x7b40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0WR0</name>
          <description>SBT0WR0 register</description>
          <addressOffset>0x7b48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0REG1</name>
          <description>SBT0REG1 register</description>
          <addressOffset>0x7b50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0RD1</name>
          <description>SBT0RD1 register</description>
          <addressOffset>0x7b60</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT0WR1</name>
          <description>SBT0WR1 register</description>
          <addressOffset>0x7b68</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1ELOG1</name>
          <description>SBT1ELOG1 register</description>
          <addressOffset>0x7f10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1ELOG2</name>
          <description>SBT1ELOG2 register</description>
          <addressOffset>0x7f14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1ECON</name>
          <description>SBT1ECON register</description>
          <addressOffset>0x7f18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1ECLRS</name>
          <description>SBT1ECLRS register</description>
          <addressOffset>0x7f20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1ECLRM</name>
          <description>SBT1ECLRM register</description>
          <addressOffset>0x7f28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG0</name>
          <description>SBT1REG0 register</description>
          <addressOffset>0x7f30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD0</name>
          <description>SBT1RD0 register</description>
          <addressOffset>0x7f40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR0</name>
          <description>SBT1WR0 register</description>
          <addressOffset>0x7f48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG2</name>
          <description>SBT1REG2 register</description>
          <addressOffset>0x7f70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD2</name>
          <description>SBT1RD2 register</description>
          <addressOffset>0x7f80</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR2</name>
          <description>SBT1WR2 register</description>
          <addressOffset>0x7f88</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG3</name>
          <description>SBT1REG3 register</description>
          <addressOffset>0x7f90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD3</name>
          <description>SBT1RD3 register</description>
          <addressOffset>0x7fa0</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR3</name>
          <description>SBT1WR3 register</description>
          <addressOffset>0x7fa8</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG4</name>
          <description>SBT1REG4 register</description>
          <addressOffset>0x7fb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD4</name>
          <description>SBT1RD4 register</description>
          <addressOffset>0x7fc0</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
