kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SBT1WR4</name>
          <description>SBT1WR4 register</description>
          <addressOffset>0x7fc8</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG5</name>
          <description>SBT1REG5 register</description>
          <addressOffset>0x7fd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD5</name>
          <description>SBT1RD5 register</description>
          <addressOffset>0x7fe0</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR5</name>
          <description>SBT1WR5 register</description>
          <addressOffset>0x7fe8</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG6</name>
          <description>SBT1REG6 register</description>
          <addressOffset>0x7ff0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD6</name>
          <description>SBT1RD6 register</description>
          <addressOffset>0x8000</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR6</name>
          <description>SBT1WR6 register</description>
          <addressOffset>0x8008</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG7</name>
          <description>SBT1REG7 register</description>
          <addressOffset>0x8010</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD7</name>
          <description>SBT1RD7 register</description>
          <addressOffset>0x8020</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR7</name>
          <description>SBT1WR7 register</description>
          <addressOffset>0x8028</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1REG8</name>
          <description>SBT1REG8 register</description>
          <addressOffset>0x8030</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1RD8</name>
          <description>SBT1RD8 register</description>
          <addressOffset>0x8040</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT1WR8</name>
          <description>SBT1WR8 register</description>
          <addressOffset>0x8048</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2ELOG1</name>
          <description>SBT2ELOG1 register</description>
          <addressOffset>0x8310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2ELOG2</name>
          <description>SBT2ELOG2 register</description>
          <addressOffset>0x8314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2ECON</name>
          <description>SBT2ECON register</description>
          <addressOffset>0x8318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2ECLRS</name>
          <description>SBT2ECLRS register</description>
          <addressOffset>0x8320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2ECLRM</name>
          <description>SBT2ECLRM register</description>
          <addressOffset>0x8328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2REG0</name>
          <description>SBT2REG0 register</description>
          <addressOffset>0x8330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2RD0</name>
          <description>SBT2RD0 register</description>
          <addressOffset>0x8340</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2WR0</name>
          <description>SBT2WR0 register</description>
          <addressOffset>0x8348</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2REG1</name>
          <description>SBT2REG1 register</description>
          <addressOffset>0x8350</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2RD1</name>
          <description>SBT2RD1 register</description>
          <addressOffset>0x8360</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2WR1</name>
          <description>SBT2WR1 register</description>
          <addressOffset>0x8368</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2REG2</name>
          <description>SBT2REG2 register</description>
          <addressOffset>0x8370</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2RD2</name>
          <description>SBT2RD2 register</description>
          <addressOffset>0x8380</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT2WR2</name>
          <description>SBT2WR2 register</description>
          <addressOffset>0x8388</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3ELOG1</name>
          <description>SBT3ELOG1 register</description>
          <addressOffset>0x8710</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3ELOG2</name>
          <description>SBT3ELOG2 register</description>
          <addressOffset>0x8714</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3ECON</name>
          <description>SBT3ECON register</description>
          <addressOffset>0x8718</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3ECLRS</name>
          <description>SBT3ECLRS register</description>
          <addressOffset>0x8720</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3ECLRM</name>
          <description>SBT3ECLRM register</description>
          <addressOffset>0x8728</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3REG0</name>
          <description>SBT3REG0 register</description>
          <addressOffset>0x8730</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3RD0</name>
          <description>SBT3RD0 register</description>
          <addressOffset>0x8740</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3WR0</name>
          <description>SBT3WR0 register</description>
          <addressOffset>0x8748</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3REG1</name>
          <description>SBT3REG1 register</description>
          <addressOffset>0x8750</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3RD1</name>
          <description>SBT3RD1 register</description>
          <addressOffset>0x8760</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
