kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SBT3WR1</name>
          <description>SBT3WR1 register</description>
          <addressOffset>0x8768</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3REG2</name>
          <description>SBT3REG2 register</description>
          <addressOffset>0x8770</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3RD2</name>
          <description>SBT3RD2 register</description>
          <addressOffset>0x8780</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT3WR2</name>
          <description>SBT3WR2 register</description>
          <addressOffset>0x8788</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4ELOG1</name>
          <description>SBT4ELOG1 register</description>
          <addressOffset>0x8b10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4ELOG2</name>
          <description>SBT4ELOG2 register</description>
          <addressOffset>0x8b14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4ECON</name>
          <description>SBT4ECON register</description>
          <addressOffset>0x8b18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4ECLRS</name>
          <description>SBT4ECLRS register</description>
          <addressOffset>0x8b20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4ECLRM</name>
          <description>SBT4ECLRM register</description>
          <addressOffset>0x8b28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4REG0</name>
          <description>SBT4REG0 register</description>
          <addressOffset>0x8b30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4RD0</name>
          <description>SBT4RD0 register</description>
          <addressOffset>0x8b40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4WR0</name>
          <description>SBT4WR0 register</description>
          <addressOffset>0x8b48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4REG2</name>
          <description>SBT4REG2 register</description>
          <addressOffset>0x8b70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4RD2</name>
          <description>SBT4RD2 register</description>
          <addressOffset>0x8b80</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT4WR2</name>
          <description>SBT4WR2 register</description>
          <addressOffset>0x8b88</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5ELOG1</name>
          <description>SBT5ELOG1 register</description>
          <addressOffset>0x8f10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5ELOG2</name>
          <description>SBT5ELOG2 register</description>
          <addressOffset>0x8f14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5ECON</name>
          <description>SBT5ECON register</description>
          <addressOffset>0x8f18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5ECLRS</name>
          <description>SBT5ECLRS register</description>
          <addressOffset>0x8f20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5ECLRM</name>
          <description>SBT5ECLRM register</description>
          <addressOffset>0x8f28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5REG0</name>
          <description>SBT5REG0 register</description>
          <addressOffset>0x8f30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5RD0</name>
          <description>SBT5RD0 register</description>
          <addressOffset>0x8f40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5WR0</name>
          <description>SBT5WR0 register</description>
          <addressOffset>0x8f48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5REG1</name>
          <description>SBT5REG1 register</description>
          <addressOffset>0x8f50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5RD1</name>
          <description>SBT5RD1 register</description>
          <addressOffset>0x8f60</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5WR1</name>
          <description>SBT5WR1 register</description>
          <addressOffset>0x8f68</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5REG2</name>
          <description>SBT5REG2 register</description>
          <addressOffset>0x8f70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5RD2</name>
          <description>SBT5RD2 register</description>
          <addressOffset>0x8f80</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT5WR2</name>
          <description>SBT5WR2 register</description>
          <addressOffset>0x8f88</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6ELOG1</name>
          <description>SBT6ELOG1 register</description>
          <addressOffset>0x9310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6ELOG2</name>
          <description>SBT6ELOG2 register</description>
          <addressOffset>0x9314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6ECON</name>
          <description>SBT6ECON register</description>
          <addressOffset>0x9318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6ECLRS</name>
          <description>SBT6ECLRS register</description>
          <addressOffset>0x9320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6ECLRM</name>
          <description>SBT6ECLRM register</description>
          <addressOffset>0x9328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6REG0</name>
          <description>SBT6REG0 register</description>
          <addressOffset>0x9330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6RD0</name>
          <description>SBT6RD0 register</description>
          <addressOffset>0x9340</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6WR0</name>
          <description>SBT6WR0 register</description>
          <addressOffset>0x9348</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6REG1</name>
          <description>SBT6REG1 register</description>
          <addressOffset>0x9350</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
