kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SBT6RD1</name>
          <description>SBT6RD1 register</description>
          <addressOffset>0x9360</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT6WR1</name>
          <description>SBT6WR1 register</description>
          <addressOffset>0x9368</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7ELOG1</name>
          <description>SBT7ELOG1 register</description>
          <addressOffset>0x9710</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7ELOG2</name>
          <description>SBT7ELOG2 register</description>
          <addressOffset>0x9714</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7ECON</name>
          <description>SBT7ECON register</description>
          <addressOffset>0x9718</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7ECLRS</name>
          <description>SBT7ECLRS register</description>
          <addressOffset>0x9720</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7ECLRM</name>
          <description>SBT7ECLRM register</description>
          <addressOffset>0x9728</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7REG0</name>
          <description>SBT7REG0 register</description>
          <addressOffset>0x9730</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7RD0</name>
          <description>SBT7RD0 register</description>
          <addressOffset>0x9740</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7WR0</name>
          <description>SBT7WR0 register</description>
          <addressOffset>0x9748</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7REG1</name>
          <description>SBT7REG1 register</description>
          <addressOffset>0x9750</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7RD1</name>
          <description>SBT7RD1 register</description>
          <addressOffset>0x9760</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT7WR1</name>
          <description>SBT7WR1 register</description>
          <addressOffset>0x9768</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8ELOG1</name>
          <description>SBT8ELOG1 register</description>
          <addressOffset>0x9b10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8ELOG2</name>
          <description>SBT8ELOG2 register</description>
          <addressOffset>0x9b14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8ECON</name>
          <description>SBT8ECON register</description>
          <addressOffset>0x9b18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8ECLRS</name>
          <description>SBT8ECLRS register</description>
          <addressOffset>0x9b20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8ECLRM</name>
          <description>SBT8ECLRM register</description>
          <addressOffset>0x9b28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8REG0</name>
          <description>SBT8REG0 register</description>
          <addressOffset>0x9b30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8RD0</name>
          <description>SBT8RD0 register</description>
          <addressOffset>0x9b40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8WR0</name>
          <description>SBT8WR0 register</description>
          <addressOffset>0x9b48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8REG1</name>
          <description>SBT8REG1 register</description>
          <addressOffset>0x9b50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8RD1</name>
          <description>SBT8RD1 register</description>
          <addressOffset>0x9b60</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT8WR1</name>
          <description>SBT8WR1 register</description>
          <addressOffset>0x9b68</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9ELOG1</name>
          <description>SBT9ELOG1 register</description>
          <addressOffset>0x9f10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9ELOG2</name>
          <description>SBT9ELOG2 register</description>
          <addressOffset>0x9f14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9ECON</name>
          <description>SBT9ECON register</description>
          <addressOffset>0x9f18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9ECLRS</name>
          <description>SBT9ECLRS register</description>
          <addressOffset>0x9f20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9ECLRM</name>
          <description>SBT9ECLRM register</description>
          <addressOffset>0x9f28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9REG0</name>
          <description>SBT9REG0 register</description>
          <addressOffset>0x9f30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9RD0</name>
          <description>SBT9RD0 register</description>
          <addressOffset>0x9f40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9WR0</name>
          <description>SBT9WR0 register</description>
          <addressOffset>0x9f48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9REG1</name>
          <description>SBT9REG1 register</description>
          <addressOffset>0x9f50</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9RD1</name>
          <description>SBT9RD1 register</description>
          <addressOffset>0x9f60</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT9WR1</name>
          <description>SBT9WR1 register</description>
          <addressOffset>0x9f68</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10ELOG1</name>
          <description>SBT10ELOG1 register</description>
          <addressOffset>0xa310</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10ELOG2</name>
          <description>SBT10ELOG2 register</description>
          <addressOffset>0xa314</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10ECON</name>
          <description>SBT10ECON register</description>
          <addressOffset>0xa318</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10ECLRS</name>
          <description>SBT10ECLRS register</description>
          <addressOffset>0xa320</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10ECLRM</name>
          <description>SBT10ECLRM register</description>
          <addressOffset>0xa328</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
