kc101010/PIC32MZ2048EFM144-rs/PIC32MZ2048EFM144.svd
        <register>
          <name>SBT10REG0</name>
          <description>SBT10REG0 register</description>
          <addressOffset>0xa330</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10RD0</name>
          <description>SBT10RD0 register</description>
          <addressOffset>0xa340</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT10WR0</name>
          <description>SBT10WR0 register</description>
          <addressOffset>0xa348</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11ELOG1</name>
          <description>SBT11ELOG1 register</description>
          <addressOffset>0xa710</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11ELOG2</name>
          <description>SBT11ELOG2 register</description>
          <addressOffset>0xa714</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11ECON</name>
          <description>SBT11ECON register</description>
          <addressOffset>0xa718</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11ECLRS</name>
          <description>SBT11ECLRS register</description>
          <addressOffset>0xa720</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11ECLRM</name>
          <description>SBT11ECLRM register</description>
          <addressOffset>0xa728</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11REG0</name>
          <description>SBT11REG0 register</description>
          <addressOffset>0xa730</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11RD0</name>
          <description>SBT11RD0 register</description>
          <addressOffset>0xa740</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11WR0</name>
          <description>SBT11WR0 register</description>
          <addressOffset>0xa748</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11REG1</name>
          <description>SBT11REG1 register</description>
          <addressOffset>0xa750</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11RD1</name>
          <description>SBT11RD1 register</description>
          <addressOffset>0xa760</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT11WR1</name>
          <description>SBT11WR1 register</description>
          <addressOffset>0xa768</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12ELOG1</name>
          <description>SBT12ELOG1 register</description>
          <addressOffset>0xab10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12ELOG2</name>
          <description>SBT12ELOG2 register</description>
          <addressOffset>0xab14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12ECON</name>
          <description>SBT12ECON register</description>
          <addressOffset>0xab18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12ECLRS</name>
          <description>SBT12ECLRS register</description>
          <addressOffset>0xab20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12ECLRM</name>
          <description>SBT12ECLRM register</description>
          <addressOffset>0xab28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12REG0</name>
          <description>SBT12REG0 register</description>
          <addressOffset>0xab30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12RD0</name>
          <description>SBT12RD0 register</description>
          <addressOffset>0xab40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT12WR0</name>
          <description>SBT12WR0 register</description>
          <addressOffset>0xab48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13ELOG1</name>
          <description>SBT13ELOG1 register</description>
          <addressOffset>0xaf10</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INITID</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MULTI</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13ELOG2</name>
          <description>SBT13ELOG2 register</description>
          <addressOffset>0xaf14</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>GROUP</name>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13ECON</name>
          <description>SBT13ECON register</description>
          <addressOffset>0xaf18</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ERRP</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13ECLRS</name>
          <description>SBT13ECLRS register</description>
          <addressOffset>0xaf20</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13ECLRM</name>
          <description>SBT13ECLRM register</description>
          <addressOffset>0xaf28</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CLEAR</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13REG0</name>
          <description>SBT13REG0 register</description>
          <addressOffset>0xaf30</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PRI</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BASE</name>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13RD0</name>
          <description>SBT13RD0 register</description>
          <addressOffset>0xaf40</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SBT13WR0</name>
          <description>SBT13WR0 register</description>
          <addressOffset>0xaf48</addressOffset>
          <size>32</size>
          <resetValue>15</resetValue>
          <fields>
            <field>
              <name>GROUP0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GROUP1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GROUP2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GROUP3</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>